{
  "name": "LearnEnglish Grammar",
  "google_package": "bc.leg",
  "google": {
    "title": "LearnEnglish Grammar",
    "description": "<b>** Our premium grammar app LearnEnglish Grammar is now 100% FREE! Download now and start practising grammar with different topics from beginner to advanced levels. **</b>\r\n\r\nLearnEnglish Grammar is a free grammar practice app designed to help improve English grammar accuracy. The app offers 1000s of questions to help practise and reinforce your English grammar skills.\r\n\r\n<b>FOUR LEVELS FROM BEGINNER TO ADVANCED</b>\r\nThe app is suitable for learners of all levels and offers grammar activities at Beginner (CEFR level A1), Elementary, Intermediate and Advanced (CEFR level C2).  Start at your level, and as your grammar accuracy improves, progress to the next. \r\n\r\n<b>NOW FREE! - OVER 1000 PRACTICE QUESTIONS AVAILABLE</b>\r\nEach level contains over 600 grammar activities, split into about 25 grammar topics such as Simple past, Past continuous, Question tags, Prepositions, Conditionals and Future perfect. The grammar questions use 10 unique activity types such as fill-in-the-blanks, multiple choice and matching. \r\n\r\n<b>PRACTICE AND TEST</b>\r\nWork through practice questions at your own pace in the Practice section or challenge your knowledge in the Test section and see how well you know the grammar topics at your level.\r\n\r\n<b>LANGUAGES</b>\r\nThe app is fully available in English, Japanese, Spanish and traditional and simplified Chinese.  Help files are additionally available in Arabic, Chinese, English, Italian, Japanese and Spanish.\r\n\r\n<b>TOP GRAMMAR PRACTICE APP</b>\r\nEnglish learners from all over the world love our app. LearnEnglish Grammar has ranked #1 in the iTunes Education category in 44 countries and ranks in the top ten in over 111 countries. The app has over 5,500,000 downloads!\r\n\r\n<b>LEARN ENGLISH WITH THE BRITISH COUNCIL</b>\r\nLearn English in our classrooms with the world’s English experts. We’ve been teaching English for more than 75 years and have helped more than 100 million people in 100 different countries improve their English skills and build their confidence. Visit www.britishcouncil.org/english to find out more information. \r\n\r\n<b>ABOUT THE BRITISH COUNCIL’S ENGLISH LEARNING APPS</b>\r\nThe British Council creates top English learning apps for learners of all ages. You can download our apps to practise grammar, vocabulary and listening.\r\n\r\nGet more great English learning apps from the British Council at: \r\nhttp://learnenglish.britishcouncil.org/apps",
    "rating": 4.15,
    "rating_text": null,
    "ratings_total": 10721,
    "ratings_histogram": [
      1069,
      530,
      795,
      1600,
      6699
    ],
    "installs": "1,000,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 1,
      "review": "Kaolo wacky",
      "date": "2018-05-31T11:16:45"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Je koopt voor bijna 90 eurocent paar vragen, blazerij!!!!",
      "date": "2014-03-07T05:56:21"
    }
  ]
}