{
  "name": "RemNote - Notes & Flashcards",
  "google_package": "com.remnote.v2",
  "google": {
    "title": "RemNote - Notes & Flashcards",
    "description": "RemNote is an all-in-one learning tool that combines note-taking, knowledge management, flashcards, and spaced repetition to enable effective and efficient learning. Sure, it’s a note-taking tool. But there’s also flashcards, PDFs, backlinks, and more - to help you study, stay organized, and think.\r\n\r\nWHY CHOOSE REMNOTE?\r\n\r\nLearn more in less time: RemNote makes learning easy. Get higher grades or reach your learning goals in less time.\r\n\r\nGrow your knowledge: Using RemNote you’ll can connect the concept you learn about and generate more ideas. \r\n\r\nOrganize your thoughts, plans, and tasks: We’re built to help you plan all of your life in one place.\r\n\r\n\r\nWHAT DOES REMNOTE HAVE TO OFFER?\r\n\r\nNotes, Docs & Outlines: Capture and link your ideas. RemNote is built for thinking and long-term knowledge management.\r\n\r\nSmart Flashcards: Create flashcards directly from your notes.\r\n\r\nSpaced Repetition: Remember more with less studying. Build your long-term memory with the spaced repetition plan built into your flashcards.\r\n\r\nLinked Reference: Reference and review all notes connected to a specific topic with contextual links and create flashcard sets on-the-fly as you take notes.\r\n\r\nPDF Annotation: Work with external documents directly in the app, make your notes and create flashcards using the source materials. Highlight, create margin notes, and link sections of your document to the rest of your digital library.\r\n\r\nMultimedia Embedding: Incorporate documents, videos, and anything else embeddable into your notes as you make them.\r\n\r\nTags: Tag your notes, to-do items, and even multimedia source materials like images and video. And get your life sorted.\r\n\r\nTo-dos: Take in new information and generate to-do lists and action items with reminders on the fly, without juggling windows or switching apps.\r\n\r\n\r\nWANT MORE?\r\n\r\nEasy Formula Handling: The Latex feature allows you to create inline formulas with a simple annotation editor. Easily create and edit formulas on the fly as you take notes, and enjoy a clear and attractive display of these formulas as you review your notes and flashcards.\r\n\r\nTemplates: Create templates to make repetitive tasks a thing of the past. Whether you’re preparing briefs or structured lecture notes, a predefined template can help you create better materials, save time, and pay more attention to the subject matter.\r\n\r\nBuild knowledge that lasts forever: Import from every note-taking app. Bring your data, and enjoy!\r\n\r\nCode Block Notes: Take notes with a tool designed to accommodate programming, keeping your notes and annotations visually and semantically separate from your code.\r\n\r\nWorks offline: Access and make changes with or without internet access.\r\n\r\nUnlimited Free Plan: We’re committed to a powerful free plan for every inspired learner.\r\n\r\n----\r\n\r\nWe are committed to protecting your personal information and your right to privacy. If you have any questions or concerns about our practices with regard to your personal information, please contact us at support@remnote.com. or visit https://www.remnote.com/privacy_policy\r\n\r\n----\r\n\r\nMake your life a little easier using RemNote’s structured note-taking, knowledge management, and intuitive memorization tools.",
    "rating": 4.6568627,
    "rating_text": null,
    "ratings_total": 3689,
    "ratings_histogram": [
      102,
      64,
      179,
      243,
      3074
    ],
    "installs": "100,000+",
    "genre": "Productivity"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 1,
      "review": "you can't change font size. What a pile of trash.",
      "date": "2025-09-04T14:41:18"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "a toy. works well with 3 cards, when you try to use 5000 it is super slow, unresponsive, and demotivating",
      "date": "2025-04-12T01:35:49"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "the best of it's kind",
      "date": "2025-03-29T21:13:07"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Echt goede op om te leren",
      "date": "2024-05-25T02:38:57"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Ik kan niet inloggen via Apple.",
      "date": "2023-02-03T07:11:20"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "De app laadt niet eens.",
      "date": "2023-02-01T00:22:31"
    }
  ]
}