{
  "name": "LearnSpanish for Kids Game App",
  "google_package": "com.MagicalTranslations.FabuLingua",
  "google": {
    "title": "LearnSpanish for Kids Game App",
    "description": "A Spanish language learning platform for kids based on game design and beautiful interactive stories. Our fun game and engaging tales will help children learn Spanish through adventures filled with magical characters. Using kids’ natural love of gameplay and storytelling makes language learning fun and easy. Interactive stories and games are infused with a unique methodology that enables your child to acquire Spanish skills while they listen and play!\r\n\r\n-> Download it today FOR FREE and learn Spanish while trying one of our beautiful interactive stories!\r\n-> Subscribe to our monthly or discounted annual plan to gain unlimited access to all the interactive stories, gameplay, rewards, and new content!\r\n-> Available for tablets and mobile devices.\r\n-> We love hearing from our customers! Email us at support@fabulingua.com with feedback or questions.\r\n\r\nWINNER of Launchpad global “Best New Language Education Technology” award organized by the Language Flagship Technology Innovation Center.\r\n\r\nWINNER of Fast Company’s \"Innovation by Design\" Award\r\n\r\nMain Features:\r\n\r\n• “Play to Learn” - An interactive, story-based mobile game to engage kids and learn Spanish.\r\n• An adaptive learning path that develops progressive language skills - comprehension, pronunciation, grammar, and literacy.\r\n• Science-backed “Magical Translations” learning method based on “comprehensible input.”\r\n• A growing collection of beautiful, interactive language-learning stories.\r\n• New features for stories and games that are added regularly.\r\n• Fun free play and games that reinforce knowledge.\r\n• A free reward system that incentivizes and motivates learning.\r\n• Audio recording mode that allows the child to practice pronunciation and develop reading skills.\r\n• Unique playing cards and free collectible digital stickers.\r\n• Parental controls and progress tracking.\r\n• MAGICAL TRANSLATIONS- An innovative way to teach Spanish to kids:\r\nThrough our Magical Translations™ method, children see only the Spanish text but hear the narrator’s rhythmic (and strategically timed) alternation between Spanish and English translation. Our method is supported by Dr. Stephen Krashen’s Comprehensible Input Hypothesis. Simply put, “comprehensible input” is new-language input that can be comprehended by listeners despite them not understanding all the words.\r\n\r\nThis theory and our method are most effective when applied during early childhood when children’s brains will wire more efficiently to the languages they are exposed to.\r\n\r\nFabuLingua is: A story. A game. A tool for language learning. A gentle introduction to a second language. A way to reinforce and supplement literacy. A parent-child bonding activity. An after-school plan. A super fun method for language learning!\r\n\r\nAnd the best part? Any parent or teacher - whether you speak a second language or not - can do it. Lean back and enjoy the journey with your child while they learn Spanish.\r\n\r\nADVANTAGES OF LEARNING SPANISH DURING CHILDHOOD\r\n\r\n#1 Language learning benefits early brain development, especially executive functioning, such as problem-solving, focusing, and switching between tasks efficiently.\r\n\r\n#2 Studies by Harvard University suggest that learning languages early has advantages over doing it later in life, such as enhanced creativity and critical thinking skills.\r\n\r\n#3 It provides academic and professional advantages, cultural awareness, emotional intelligence, and self-confidence.\r\n\r\n#4 In an increasingly globalized world, new languages acquire exponential value. An estimated 130 million people in the USA will speak Spanish over the next 30 years.\r\n\r\n#5 In the case of Spanish and Hispanic heritage families, Spanish will allow their children to understand their background, bond with relatives better, and connect to their culture.\r\n\r\nFabuLingua is a magical source of Spanish learning for kids. It helps them learn Spanish through engaging interactive stories and innovative language learning activities, making the process enjoyable and effective. Try it for free!",
    "rating": 4.0526314,
    "rating_text": null,
    "ratings_total": 134,
    "ratings_histogram": [
      21,
      9,
      2,
      7,
      93
    ],
    "installs": "50,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 1,
      "review": "Geen account te openen. Zegt dat je al een account hebt. Met ander emailadres geprobeerd maar ook zelfde melding.",
      "date": "2024-08-15T13:48:52"
    }
  ]
}