{
  "name": "Spelling and Grammar",
  "google_package": "com.holucent.grammar",
  "google": {
    "title": "Spelling and Grammar",
    "description": "English Spelling and Grammar will help you learn to spell well in an entertaining way by\r\nplaying multiple-choice tests and quizzes. It covers complete spelling and grammar\r\nincluding spelling rules, tricky words, irregular spelling, and commonly misspelled\r\nwords.\r\n\r\nYou can practice your English in more than 100 categories:\r\n* Short and long vowels/ syllables: Magic -e\r\n* G or j? K, c, or ck? S or c? F, ff, or ph? D or t?\r\n* Spelling patterns: Wa or wo? Thr or tr? Aw, al, all, or au? Oi or oy? W\r\nor wh? X, cs, ct, or cc?\r\n* Double consonants and letters\r\n* R-controlled patterns: \"Bossy r\" words with er, ir, ur, or, etc.\r\n* Endings, prefixes and suffixes:\r\n-dge, -tch, -ge, -ch\r\n-ey, -ie, -y, -ee\r\n- ible or able\r\n- ant or ent\r\n- ance or ence\r\n- ency or incy\r\n- ary,ery, or ory\r\n- tion, sion, cion, xion, or cian\r\n- ic or ical\r\n- for/fore/four\r\n* Silent letters\r\n* Homophones\r\n* Who or whom? Contractions and plurals. Verbs in present tense, past tense\r\nand future tense.\r\n*Capitalization (Uppercases and lowercases): names, professions, titles, cities, geographical names\r\n* Punctuation: Serial comma, coordinating and\r\nsubordinating conjunctions, relative clauses, interrupters\r\n * Grammar: Parts of speech (noun, adjectives, adverbs, verbs, etc.),\r\ntypes of nouns (concrete /abstract, common /proper, countable /uncountable), types\r\nof pronouns (personal, subject, object, possessive and reflexive pronouns) \r\n* Sentence structure/Sentence types: Complete sentences, fragments, run-ons, clauses.\r\n\r\nThis app is the perfect spelling game for children of all ages, high school or adult students. Compete in our games and become a champion. \r\n\r\nHave grammar rules simply explained, store your statistics and results.  Track your kids’ progress by connecting to Eductify Parent Connect. You can also create a study plan to plan your day-to-day learning. Suitable for many exams and competitions, such as Spelling bee, SAT, LSAT, MCAT, GMAT or CAT,.\r\n\r\nImprove your English spelling skills in a fun and challenging way!",
    "rating": 4.57,
    "rating_text": null,
    "ratings_total": 1788,
    "ratings_histogram": [
      85,
      16,
      85,
      175,
      1411
    ],
    "installs": "100,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 5,
      "review": "Heel leerzaam",
      "date": "2021-03-01T23:17:23"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Erg leuk",
      "date": "2020-05-06T09:40:07"
    }
  ]
}