{
  "name": "Learn Dutch with Flashcards!",
  "google_package": "ru.poas.learn.dutch.language.words.vocabulary",
  "google": {
    "title": "Learn Dutch with Flashcards!",
    "description": "ReWord is a highly effective Dutch vocabulary app. It is your best tool to learn Dutch language and improve your vocabulary. Did you know you can learn languages just taking 5-10 minutes a day? With our interval system, your Dutch lessons will reach a new level. And will give you great results, of course!\r\n\r\nAs with any other language, Dutch lessons must include learning Dutch grammar and memorizing new Dutch words. However, one of the problems with foreign language learning is you can’t achieve good results if you don’t systematize the memorizing.\r\nWith ReWord, you get a dedicated system and will memorize new Dutch words without much effort on your part.\r\n\r\nFeatures:\r\n• Thousands of Dutch words and phrases divided into thematic categories, including the most commonly used words in Dutch. Choose the category you want to learn this time and change it whenever you want.\r\n• Add your own Dutch words and categories easily: you can create your own word base you want to master first.\r\n• Handy flashcards with pictures and example sentences: helpful mental shortcuts to build your vocabulary and understand the nuances of word meaning and how these words are used in real practice.\r\n• Spaced repetitions really work: ReWord has a science-based approach to memorizing foreign words so you can learn languages at the highest efficiency.\r\n• Tracking your progress: set your daily goal and keep achieving it every day.\r\n• Offline mode: now it is possible to learn Dutch wherever you go.\r\n\r\nYes, with ReWord, memorizing new words is extremely easy and utterly efficient!\r\n\r\nUse the app at least twice a day, with regular breaks every few hours. Start with just five words a day and you will have at least 1825 new words in your active vocab within a year. Increase your daily goal, take more Dutch lessons, and you will accelerate your progress and learn Dutch even faster.\r\nReWord – your best Dutch learning app! We are here to help you learn languages in a hassle-free way! Start to speak Dutch!",
    "rating": 4.2222223,
    "rating_text": null,
    "ratings_total": 125,
    "ratings_histogram": [
      13,
      0,
      0,
      41,
      69
    ],
    "installs": "10,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 5,
      "review": "Really good app.",
      "date": "2025-03-11T18:09:32"
    }
  ]
}