{
  "name": "ELSA Speak: English Learning",
  "google_package": "us.nobarriers.elsa",
  "google": {
    "title": "ELSA Speak: English Learning",
    "description": "Meet ELSA Speak - Your personal AI-powered English tutor.\r\n\r\nELSA Speak is an AI-powered language coach designed to help professionals and learners speak English with confidence. Engage in real-time, speaking scenarios to practice job interviews, presentations, meetings, and more. Reinforce your skills with interactive AI-powered games that make learning engaging and effective. With 8,000+ lessons, you'll learn proper pronunciation, grammar, and vocabulary faster than ever.\r\n\r\nDownload the best AI-powered English learning app today and start your journey to confident English communication!\r\n\r\nELSA SPEAK FEATURES:\r\n\r\nENGLISH COMMUNICATION\r\n- Career-Specific Focus - Learn vocabulary and communication styles tailored to your field - Confident Exam Preparation\r\n- Prepare for IELTS, TOEFL, TOEIC, EIKEN, and more with targeted practice in our bilingual app to boost fluency.\r\n\r\nHYPER-PERSONALIZED LEARNING PATHS\r\n- Personalized language learning - Learn to succeed in workplace interviews, giving presentations, interacting in meetings, succeeding at client calls, and daily conversations.\r\n- AI-Driven Conversations & Open-Ended Dialogues - Personalized language learning through practicing realistic conversations. \r\n\r\nREAL-LIFE CONVERSATION PRACTICE\r\n- Grammar & Vocabulary - AI-driven conversation helps you build a solid foundation in English grammar and expand your vocabulary with everyday, practical words. The adaptive AI adjusts to your progress, ensuring you always learn exactly what you need.\r\n- Conversation Practice - Improve fluency with role-plays, open-ended dialogues, and real-life scenarios. Learn to speak English confidently and with clarity. Leave language misunderstandings behind, whether in the workplace or the classroom.\r\n- Pronunciation Training - Practice speaking English and conquer tricky sounds, learn nuanced English pronunciation.\r\n- Personalized Study Sets – Save words, phrases, or sentences from lessons or create your own, explore and share sets, and improve your pronunciation with real-time feedback.\r\n\r\nINSTANT FEEDBACK & AI COACH FOR CONVERSATIONS\r\n- Quantitative Progress Tracking - Monitor your improvement with data-driven insights.\r\n- Pronunciation & Word Stress Guidance from our AI English Coach - Receive real-time corrections to sound more natural.\r\n\r\nACCENT TRAINING\r\n- English learning accent choices: American, British, Australian, and more.\r\n- Pick your preferred gender to help you feel confident while interacting with others from different cultures.\r\n\r\nENGLISH COMMUNICATION BENEFITS\r\n- Enhanced Global Collaboration: Bridge language gaps and foster seamless teamwork with international colleagues or friends.\r\n- Career Potential: Boost your career by impressing clients and colleagues with polished English communication\r\n- Expand Your Network: Build meaningful relationships and confidently explore global opportunities.\r\n- Beyond Pronunciation: Learn grammar, vocabulary, and communication techniques to succeed academically, personally, or professionally.\r\n---\r\n\r\nTRUSTED BY ENGLISH LEARNERS AND INDUSTRY EXPERTS\r\n- Honorable Mention in the AI and Data category of Fast Company's 2020 World Changing Ideas Awards\r\n- Top 100 Influencers in State of EdTech Report by EdTech Digest 2020\r\n- Mentioned by TechCrunch, Forbes, Mashable, VentureBeat, Yahoo, Salma Hayek, and more\r\n---\r\n\r\nReach out to us:\r\nWhether it’s for feedback, questions, suggestions, or personal experiences, our inboxes are always open to hearing from you. Please write us an email at support@elsanow.io.",
    "rating": 4.575611,
    "rating_text": null,
    "ratings_total": 952275,
    "ratings_histogram": [
      40137,
      15932,
      34009,
      127766,
      734428
    ],
    "installs": "10,000,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 3,
      "review": "Приложение классное, но постоянно зависает даже с платной версией",
      "date": "2025-10-10T19:58:54"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Ik leer weinig van ELSA en de voortdurende negatieve feedback die het geeft op mijn uitspraak is frustrerend. De enige uitleg is een geschreven instructie over hoe je je tong, lippen en stembanden moet gebruiken. Zo heeft volgens mij nog nooit iemand een taal leren spreken.",
      "date": "2025-08-11T17:09:42"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "you cannot delete your account and the yearly payment with the app!!!!",
      "date": "2025-06-28T21:46:19"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "the longer I use the app during a session, the warmer my phone gets, and the slower it becomes. It seems like ELSA uses a lot of processing power or battery, especially during longer conversations or repeated practice. This can be frustrating when the app starts lagging or freezing. I hope this issue gets fixed in a future update, I’m quite happy with the content and structure of the app.",
      "date": "2025-06-17T01:21:46"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "geschikt om te oefenen op uitspraak (US English)",
      "date": "2025-06-07T20:18:06"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "good app to practice",
      "date": "2024-08-25T17:08:57"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "wauw, just a great pleasure to practice",
      "date": "2024-08-10T20:55:34"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Heb net de lessen/opdrachten gedaan van de eerste dag. Prettig te doen. Je krijgt ook gelijk commentaar op waar het in je uitspraak aan schort. Over 24 uur krijg ik toegang tot de opdrachten van dag 2. Ik kan niet wachten:)) vond het echt leuk om te doen",
      "date": "2024-05-24T12:50:17"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Je kunt één proeflesje doen onbetaald",
      "date": "2023-06-07T19:44:14"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Eerst Betalen",
      "date": "2023-05-18T20:21:44"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "I like the app! I really do. But I still have uninstalled it because it focuses only on the pronunciation of American English. English is my second language and I speak British English.",
      "date": "2023-05-10T11:21:58"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "like it helps you fix things you cannot do",
      "date": "2023-05-03T13:51:42"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "super leuke en leerzaam",
      "date": "2022-11-20T13:21:46"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Works very good!!",
      "date": "2022-09-12T14:32:19"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "uts so nice",
      "date": "2022-08-16T08:54:19"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Ik kan het niet downloaden",
      "date": "2022-07-21T15:51:32"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Super goede app",
      "date": "2022-07-12T20:25:57"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "het helpt heel erg als je moeite hebt met engels",
      "date": "2022-07-10T20:21:42"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Its pay or wait.",
      "date": "2022-06-25T22:24:45"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "I recommend this app to everyone that has a problem with pronouncing English words correctly ✅",
      "date": "2022-06-10T18:51:05"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Just practiced a first day lesson and already learned a lot. Especially when it comes to heart and hard. But what about heard (surname of Amber) and hurt. Wished to have this one included :)",
      "date": "2022-05-22T19:26:47"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "good app",
      "date": "2022-05-07T11:40:29"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "best voice game ever!!!",
      "date": "2022-04-07T17:42:39"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Nice, but I would have preferred an option to learn British pronounciation.",
      "date": "2022-03-19T14:35:07"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "super leuk en heel handig",
      "date": "2022-03-19T09:04:51"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Eerste wat ik zie is abonnement. Als we voor elke app, service, web pagina zoveel moeten betalen kunnen we niet meer eten, wonen, internet gebruiken enz enz dat en ontwikkelaar ook moet eten snapt iedereen. Maar is iedereen dan zo blind dat mensen om moeten leven en betalen voor alles wat los en vast zit.",
      "date": "2022-01-30T15:42:42"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "If it wasn't for the enjoying bugs I would give this app a 4 star review. Whilst speaking, the Elsa app shutdown and your progress is lost. Is there a solution for this problem? I do like the pronation exercises and the detailed video's that come with it.",
      "date": "2022-01-08T11:43:16"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Echt heel goed om Engelse uitspraak te oefenen",
      "date": "2021-12-29T13:26:05"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "good",
      "date": "2021-11-27T22:45:07"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "ik vindt die leuk app want idee kun vraag stellen makkelijk te English worden doorgeve begint met spreekt dan wel eens pracht app de eerste keer en onthouden misschien leiders van het kan niet mij hoofd beloofd om als \"ja\" dat weer leuk app toch wel leuke dingen spreektijd type les spreekt les samen deel te Engels super v keihard bedankt bedrijf! 🥰",
      "date": "2021-11-05T12:21:20"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "amazing tot see that lieve of tool.great help and evolutied apps",
      "date": "2021-10-28T00:12:54"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Virus app!!! Installeert bij instaleren ander programma om je mail te checken",
      "date": "2021-10-23T21:39:38"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "best app to empty your wallet bank account safe crypto wallet etc give it all",
      "date": "2021-08-06T19:00:46"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Great idea but terrible app. Bunch of bugs",
      "date": "2021-06-30T18:14:36"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "het last minute echo goed engels nu pretend",
      "date": "2021-06-29T22:52:16"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "so good",
      "date": "2021-06-03T18:29:47"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "The best",
      "date": "2021-05-19T16:08:38"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "The BEST English learning app!",
      "date": "2021-04-07T16:24:20"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "muito bom e legal aplicativo",
      "date": "2021-03-12T09:11:00"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "top top top and top",
      "date": "2020-12-16T16:22:31"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuke app om bij te leren",
      "date": "2020-06-18T04:30:57"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "No recommendation from me, i expected more information how to move your mouth and tongue in a video. For the user its very unclear now by reading it by text.",
      "date": "2020-03-24T12:58:46"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "La meilleure application gratuite, elle marche parfaitement",
      "date": "2020-03-11T16:45:10"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Slecht onhandig onduidelijk en het is niet gratis",
      "date": "2017-09-24T10:24:41"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Fantastisch",
      "date": "2017-09-12T07:29:54"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Aaahh cant speak the rrrrrr",
      "date": "2016-08-12T16:44:42"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "deze app is superhandig voor als je Engels lastig vindt.",
      "date": "2016-06-21T08:00:56"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Fun and helpful!",
      "date": "2016-06-20T22:16:22"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Very good app to practice your languages.",
      "date": "2016-06-20T21:34:31"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "I love it",
      "date": "2016-06-19T17:10:36"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuke manier om je Engelse uitspraak te verbeteren.",
      "date": "2016-06-19T15:11:56"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Werkt gemakkelijk. Goede feedback.",
      "date": "2016-06-19T14:45:49"
    }
  ]
}