{
  "name": "Learn Dutch with LENGO",
  "google_package": "com.lengo.uni.nl",
  "google": {
    "title": "Learn Dutch with LENGO",
    "description": "Learning languages has never been so easy! More and more people learn languages with LENGO every day. Join today and be part of our growing community!\r\n\r\nLENGO IS FREE TO USE\r\nOur goal is to make education accessible to anyone. Thus, all basic features are permanently free to use. We are continuously extending paid content as well as free content to make LENGO even better.\r\n\r\nWHAT TO EXPECT\r\nLENGO equips you with everything you need to learn the language you want. It has been shown that you can significantly reduce the time invested in learning a new language by using instant feedback, recurrent material, and other methodologies that LENGO supports. Another aspect that is likely to improve your learning success is the motivation methods, which are often missing from traditional language-learning methods. However, you still have to bring some initiative.\r\n\r\nEXTRA CONTENT? THAT'S PREMIUM\r\nWith LENGO Premium, you unlock your full potential. You unlock everything you need to learn languages as quickly and successfully as possible.\r\n\r\nABOUT LENGO\r\nLENGO is a language learning platform that strives to enrich global human interaction by improving people’s ability to communicate.\r\n\r\nPrivacy policy: https://www.lengo.io/about/privacy/\r\nTerms of use: https://www.lengo.io/about/terms\r\n\r\nQuestions? Contact us:\r\ncontact@lengo.io\r\n\r\n---------------------------------------------------------------\r\n\r\nInformation about the auto-renewable nature of the subscription\r\n\r\nA subscription is not essential to get access to the full learning materials. You can also gain access by uploading content that adds value to the community. Otherwise, content can be unlocked through in-app-purchases. However, subscriptions are useful for users who want full access without any further action required. The subscribed user does not have to pay attention to our digital currency. Therefore, full access to the app is Lengo Premium.\r\n\r\nEach subscription will be automatically renewed unless auto-renew is turned off at least 24 hours before the end of the current payment period. Your iTunes account will be automatically charged at the same price for renewal within 24 hours of the end of the current payment period unless you change your subscription preferences in your iTunes Account Settings. When a subscription is canceled, access to the app’s courses and features will expire at the end of the current payment period.",
    "rating": 0,
    "rating_text": null,
    "ratings_total": 0,
    "ratings_histogram": [
      0,
      0,
      0,
      0,
      0
    ],
    "installs": "5,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": []
}