{
  "name": "Learn French - Beginners",
  "google_package": "com.breboucas.francesparaviajar",
  "google": {
    "title": "Learn French - Beginners",
    "description": "Want to learn French online for free? Join over 30 million people who have chosen to study with the BNR Languages apps!\r\n\r\nFrench for beginners — designed for anyone who wants to learn French from scratch and study at their own pace, in a simple and practical way.\r\n\r\nWith interactive activities and native audio to help with pronunciation and listening comprehension, you'll learn French quickly and intuitively.\r\n\r\nStudy on your own, in your own time, with no daily limits. Choose what you want to practice: reading, writing, listening, or vocabulary. Everything is easy to use and personalized for you.\r\n\r\nExercises use images to help you memorize words, and the review mode lets you practice and refresh everything you've already learned — anytime you want.\r\n\r\nLearning a new language has never been easier, more accessible, and 100% free!\r\n\r\nFind out why our app is the ideal choice to study anytime, anywhere:\r\n\r\n- Complete offline French course — from beginner to advanced levels.\r\n\r\n- Learn on your own! Study French independently, at your own pace, without needing teachers or tutors.\r\n\r\n- 100% free! All content and features are available for free — you don't need to pay to learn!\r\n\r\n- Start from the very beginning, learning the alphabet!\r\n\r\n- Set your own study time. Learn as much as you want — no time limits! No daily activity limits! Practice and learn as many times as you like every day!\r\n\r\n- Large selection of words to help expand your vocabulary.\r\n\r\n- Interactive exercises with images that make it easier to memorize new words! Learn in a fun and easy way — with a gamified interface that makes studying feel like playing a game.\r\n\r\n- Review mode to practice and refresh everything you've already learned.\r\n\r\n- Native audio recordings with adjustable playback speed.\r\n\r\n- Different types of tests! Practice your reading, writing, and listening skills.\r\n\r\n- Full translation available in many languages: Chinese, Spanish, English, Hindi, Arabic, Bengali, Portuguese, Russian, Japanese, Korean, French, Turkish, Vietnamese, Italian, Thai, Persian, Indonesian, Urdu, Polish, Ukrainian, Malay, Uzbek, Romanian, Dutch, Greek, Czech, Hungarian, Swedish, Belarusian, Bulgarian, Croatian, Danish, Norwegian, Slovak, Finnish, Hebrew, Irish, Catalan, Swahili.\r\n\r\n- Choose what you want to study and customize your learning experience.\r\n\r\n- Perfect for learning French quickly — whether for travel, work, study, or to connect with family and friends.\r\n\r\n- Simple, intuitive, and user-friendly interface for all ages.\r\n\r\n- No internet connection needed to learn French! The app works completely offline.\r\n\r\n- Earn medals, track your progress, and stay motivated.\r\n\r\n- Join the weekly ranking and compete with other users!\r\n\r\n- New words and vocabulary categories added regularly.\r\n\r\nDownload the BNR Languages app now and start your French course!",
    "rating": 4.77,
    "rating_text": null,
    "ratings_total": 15718,
    "ratings_histogram": [
      300,
      0,
      601,
      1052,
      13612
    ],
    "installs": "1,000,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 5,
      "review": "Misschien wel een beetje veel reclames, maar helpt voor de rest écht met het frans!",
      "date": "2025-03-21T20:36:17"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Heel veel dankbaar voor het maken van deze geweldige app, ik heb mijn Nederlandse woordenschat verbeterde en ook geleerd dankzij de BNR groep. Duimen op ook voor de Frans ervaring.😁",
      "date": "2024-09-17T08:11:26"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "easy peasy",
      "date": "2024-07-03T01:29:39"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "ik vind het echt kei leuk om op deze manier frans te leren want op school is het saai dus ik zeg dit tegen de maker van dit spel dankjewel voor dit alleen er is een dingetje om 90 te zeggen moeten we op school wel leren nonante of zo te schrijven maar dankjewel😁😀🥴",
      "date": "2024-03-14T18:04:35"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Goed voor het BEGIN",
      "date": "2023-06-16T21:22:32"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Handeg",
      "date": "2023-03-26T11:48:13"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "C'est un bon app, gotta stay multilangual as a husller.",
      "date": "2022-08-07T20:58:52"
    }
  ]
}