{
  "name": "Vocabulary.com",
  "google_package": "com.vocab.app",
  "google": {
    "title": "Vocabulary.com",
    "description": "With its uniquely effective word learning system, the Vocabulary.com app helps you master words through a fun and addictive game. And it’s powered by the world's smartest, fastest dictionary. From the makers of the award-winning Vocabulary.com website, this app will expand your vocabulary with lightning speed!\r\n\r\nIT’S A SCIENCE...\r\nVocabulary.com is a comprehensive program for lifelong learning of vocabulary, in which each activity is specially chosen for you.\r\n\r\n• We use sophisticated algorithms to help you learn more effectively.\r\n• We start with 235,858 questions that teach 15,914 words.\r\n• We use the science of learning to model how you learn (and retain) new words.\r\n• By comparing your answers to the hundreds of millions of answers given by other Vocabulary.com users, we personalize your learning experience and choose the best question for you at just the right time.\r\n\r\n...AND IT’S A GAME\r\nWe’ve turned learning vocabulary into an addictive game. You may not even notice that you’re learning along the way.\r\n\r\n• Accumulate points, achievements and badges.\r\n• Compete with Vocabulary.com users from throughout the world.\r\n\r\nYOU CHOOSE...\r\nStudying for an exam like the SAT, GRE, or TOEFL? We have learnable lists for you, covering everything from standardized tests to breaking news — you name it.\r\n\r\n• Choose from one of our 50,000 ready-to-learn lists.\r\n• Or if you see a word in the dictionary that you want to learn, just click \"learn this word\" and we'll teach it to you.\r\n\r\n...OR WE CHOOSE\r\nDon't have a specific word or list in mind? Let our adaptive learning system find the right word for you.\r\n\r\n• Just play a few questions, and we'll pinpoint the words that are appropriate for your level.\r\n• We won't waste your time on words that are too easy or too hard.\r\n\r\nYOU IMPROVE\r\nLike a good coach, Vocabulary.com won’t give up on you. Whether you pick the words or let us find them for you, we’ll work with you until you've mastered them.\r\n\r\nAnd even after you've achieved mastery, we'll continue to reinforce what you have learned to make sure that it all stays fresh in your memory. Next thing you know, you’ll be expanding your vocabulary and improving your communication, a key to success in school and business.\r\n\r\nFINALLY, A DICTIONARY WITH A SOUL\r\nOur dictionary was written for humans, by humans. Look up a word, and you’ll read a friendly explanation that you'll actually remember. It’s as if your favorite teacher were explaining it to you.\r\n\r\nWe include clever usage tips and thousands of real-world example sentences that'll show you how words live in the wild and will make you more confident about using them yourself.\r\n\r\nSee a word you’d like to know better? Tap \"Learn this Word\" and easily add it to your learning program.\r\n\r\nWHAT PEOPLE ARE SAYING\r\n\"Vocabulary.com is among the quickest and most intelligent ways for students to improve their vocabulary. Regardless of education level or age, Vocabulary.com will help master the words that are essential to academic and business success.\" —National Education Association\r\n\r\n“Educators who are familiar with Vocabulary.com are impressed by the technology. It is a sign, they say, that real progress is finally being made in computer-assisted education.”  —The New York Times\r\n\r\n“Vocabulary.com could actually make speaking well cool again.” —TIME\r\n\r\n“Vocabulary.com boasts a Web-based dashboard bristling with points, levels, progress bars and achievement bonuses, among other attractions.” —USA Today\r\n\r\nHONORS AND AWARDS\r\n• TIME’s 50 Best Websites of the Year\r\n• PC Magazine's Top 100 Websites of the Year\r\n• Tech & Learning Award of Excellence\r\n• Webby Awards: Official Honoree in Education",
    "rating": 3.82,
    "rating_text": null,
    "ratings_total": 934,
    "ratings_histogram": [
      139,
      73,
      117,
      73,
      522
    ],
    "installs": "100,000+",
    "genre": "Books & Reference"
  },
  "apple": null,
  "reviews": []
}