{
  "name": "GRE Vocabulary Flashcards",
  "google_package": "com.magoosh.flashcards.gre",
  "google": {
    "title": "GRE Vocabulary Flashcards",
    "description": "Magoosh has helped MILLIONS of students pass their GRE!\r\n\r\nMaster the 1500 most important GRE words with free flashcards! Practice every day to improve your vocab knowledge. Study to rectify your benightedness and prepare to trounce the GRE verbal section!\r\n\r\n\r\n• 1500 vocab words picked by an expert GRE tutor\r\n\r\n• Definitions and example sentences for every word\r\n\r\n• Decks for every difficulty level\r\n\r\n• Track your progress as you study\r\n\r\n• Smart algorithm focuses your practice for efficient learning\r\n\r\n\r\nThis app gives you access to all of Magoosh’s GRE vocab flash cards.\r\n\r\n\r\nWho makes the flashcards?\r\n\r\n===\r\n\r\nThe entire GRE wordlist is selected and defined with usage examples by Magoosh’s expert GRE tutor, Chris Lele. He has been teaching the GRE for more than 10 years, runs a popular vocabulary series on YouTube and he’s also written an eBook on vocabulary. He is nigh unbeatable in Scrabble, or any other word game for that matter.\r\n\r\n\r\nHow well will I learn the words?\r\n\r\n===\r\n\r\nAcademic research has found that memories are formed by repeated exposure to new information, so Magoosh’s flashcard app uses a spaced repetition system. Words you are learning will reappear frequently (occurring less frequently the better you know them) and words you already know won’t be repeated. The GRE word list is culled so that you focus on only the most important words.\r\n\r\n\r\nYour practice will focus on the words that you need to review the most to make sure the words you learn will really stick.\r\n\r\n\r\nWhat is Magoosh?\r\n\r\n===\r\n\r\nMagoosh is an online test prep company with a focus on teaching the GRE.\r\n\r\n\r\nThe Magoosh team blogs about GRE words, formulas, grammar, problem solving, quantitative reasoning, and reading comprehension along with GRE study guides and study tips.\r\n\r\n\r\nHow else should I study?\r\n\r\n===\r\n\r\nSearch the app store for “magoosh gre” to prep for the GRE Exam with Magoosh’s video lessons app. Learn all the math, verbal, and writing you need to know for the test!\r\n\r\n\r\nWhat about other tests?\r\n\r\n===\r\n\r\nMagoosh also has apps for GMAT prep and English grammar. Search the store for “magoosh gmat” or “magoosh english” to find them!\r\n\r\n\r\nHow do I contact you?\r\n\r\n===\r\n\r\nCustomer satisfaction is incredibly important to us. If you have any questions or comments, please send us an email at help@magoosh.com and we’ll get back to you as quickly as we can. \r\n\r\n\r\n“The collection of words is great. I liked the visual indication of the three categories and their progress.”\r\n\r\n\r\n“The Magoosh staff was awesome; I peppered them with questions and requests and they always responded thoroughly and quickly.”\r\n\r\n\r\n“I didn’t have much time to prepare for the GRE, and Magoosh made it possible for me to succeed on the test in a short period of time. I looked at Kaplan GRE, Barron’s, and Princeton Review products, and I can confidently say that Magoosh was definitely the best.”\r\n\r\n\r\n“The team is really great and actually cares about your score as much as they would care about their own. Simply the best.”\r\n\r\n\r\nDon’t wait until the last minute to start studying, start memorizing words today!",
    "rating": 4.633333,
    "rating_text": null,
    "ratings_total": 21288,
    "ratings_histogram": [
      567,
      425,
      993,
      2270,
      17030
    ],
    "installs": "1,000,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": []
}