{
  "name": "Learn English with WSE",
  "google_package": "com.wsi.wallstreetenglish.nse",
  "google": {
    "title": "Learn English with WSE",
    "description": "LEARN ENGLISH ANYTIME, ANYWHERE WITH WALL STREET ENGLISH\r\nOur English course is built around you. Beginner or advanced, you can learn at your own pace with teaching that fits around your schedule.\r\n\r\nWall Street English offers a proven English language learning method that guarantees results and makes learning English a more effective, supportive, and entertaining experience so you stay motivated to study and achieve your goals.\r\n\r\nSTART STUDYING AT WALL STREET ENGLISH\r\nThe Learn English app is only available to people currently studying at Wall Street English. \r\n\r\nNot a student yet? Join us at wallstreetenglish.com\r\n\r\nGET RESULTS WITH THE LEARN ENGLISH APP \r\nOur App features 20 levels of English learning aligned with CEFR standards: A1 to C1. It is a comprehensive and interactive course designed to study English on the go on your phone or tablet.\r\n\r\n⭐ “Make it Big” English TV Show \r\nImmerse yourself in English with our own English TV series. You’ll start learning the second you’ll start watching! It’s a fun, fast and effective way to dive into the language.\r\n\r\n⭐ Flexible Lessons \r\nWith our method, you learn to listen and speak first. You’ll discuss the TV series language you’ve seen and complete interactive exercises to check your understanding and build your confidence.\r\n\r\nOur automated speech-recognition software and role-play activities mean you can start speaking English from day one – and perfect your pronunciation while you do it.\r\n\r\n⭐ Interactive Exercises \r\nComplete English grammar lessons and other English language exercises, and get instant feedback on your performance in your digital student workbooks.\r\n\r\n⭐ Live Classes \r\nWhether you book in a school, a digital classroom or both, you’ll have small classes, highly-qualified teachers and a personal coach. So, you can learn real English – and feel confident speaking it.\r\n\r\n⭐ Personalized Student Dashboard \r\nAccess your personalized dashboard and get reminders for upcoming English classes and events so you never miss out on anything.\r\n\r\nTrack your activity and review your progress as you improve your English to achieve your personal learning goals.\r\n\r\nABOUT WALL STREET ENGLISH\r\nSince 1972, Wall Street English helps people go further with English by offering an immersive, integrated and unmatched method. Our English learning experience has helped millions of people get great results, on their own terms.\r\n\r\nWe help you go further by going further ourselves – constantly innovating and creating new ways to make learning fun, flexible and effective. Tell us your ambition and we’ll get you there.\r\n\r\nFind out more at wallstreetenglish.com",
    "rating": 4.285714,
    "rating_text": null,
    "ratings_total": 9324,
    "ratings_histogram": [
      888,
      296,
      740,
      740,
      6660
    ],
    "installs": "100,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": []
}