{
  "name": "Pingo AI Language Learning",
  "google_package": "com.picoai.languageapp.android",
  "google": {
    "title": "Pingo AI Language Learning",
    "description": "Join 1,500,000+ language learners who use Pingo AI to learn a language. Pingo AI is an AI language learning app that uses results-driven AI for you to learn a language and speak fluently through real-life conversations.\r\n\r\n👋 Speak to Pingo AI as you would a friend\r\nTalk about your day, ask questions, and explore the language together. Pingo, your speaking companion, gives you instant feedback to dramatically improve your language learning skills. Practice speaking from 25+ languages to refine your vocabulary, grammar, and fluency, as well as speak confidently in real conversations.\r\n\r\n🎯 Why use Pingo AI to learn languages\r\n✓ Learn to speak fluently through real-life conversations.\r\n✓ Get personalized language lessons.\r\n✓ Learn exactly what to improve, including vocabulary, grammar, relevancy and fluency.\r\n✓ Learn words and phrases you’ll actually use.\r\n✓ Become fluent in a language.\r\n✓ Proven effectiveness for beginners, advanced learners, and everyone in between.\r\n\r\n💬 Choose language lessons from these languages:\r\nLearn to speak fluent English, Spanish, French, German, Japanese, Korean, Italian, Chinese (Mandarin), Portuguese, Russian, Arabic, Dutch, Turkish, Polish, Vietnamese, Hindi, Thai, Hebrew, Greek, Indonesian, Swedish, Norwegian, Danish, Persian, and Ukrainian.\r\n\r\n✨ How to use Pingo AI* to learn a language:\r\n1) Create or choose from engaging, real-life conversation scenarios.\r\n\r\n2) Talk with an ultra-realistic AI that feels like a native speaker, adapting to your pace and skill level.\r\n\r\n3) Receive actionable feedback and tips for improvement on vocabulary, grammar, fluency, engagement, and relevance for every language conversation.\r\n\r\n4) Use Language Learning Tutor Mode for guided practice and review useful words to reinforce learning.\r\n\r\n5) Get fluent faster and build lasting language confidence.\r\n\r\n🗣️ Consistently speaking and conversing in the foreign language is essential to confidently speak, learn, and become fluent in a language. Pingo AI Language Learning transforms self-guided practice into a goal-oriented, interactive learning experience that’s far more effective than simply repeating basic phrases aloud or struggling to find opportunities for real-life conversations. Pingo AI helps you on your language learning journey.\r\n\r\n⚡️ Ditch static, repetitive modules and boring lessons. At Pingo AI, we’re building the most dynamic and immersive AI language learning experience ever to help you reach your language goals as fast as possible.\r\n\r\n🚀 Whether you want to learn English, Spanish, French, German, Japanese, Korean, Italian, Chinese (Mandarin), Portuguese, Russian, Arabic, Dutch, Turkish, Polish, Vietnamese, Hindi, Thai, Hebrew, Greek, Indonesian, Swedish, Norwegian, Danish, Persian (Farsi), or Ukrainian, Pingo AI Language Learning is your learning language app to achieve fluency.\r\n\r\nIf you have any ideas or questions, please email us at support@mypingoai.com.\r\n\r\n*Note: All conversations require a subscription\r\nTerms: https://mypingoai.com/terms\r\nPrivacy Policy: https://mypingoai.com/privacy",
    "rating": 4.661111,
    "rating_text": null,
    "ratings_total": 37774,
    "ratings_histogram": [
      1250,
      402,
      1876,
      2725,
      31474
    ],
    "installs": "500,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 5,
      "review": "大好きです。",
      "date": "2025-10-25T16:35:52"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "great app",
      "date": "2025-10-07T16:26:30"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "✨️🤏🏾TOP✨️🤏🏾",
      "date": "2025-10-06T17:58:31"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "quite good yes. not good enough to make me swap from another app",
      "date": "2025-09-20T16:21:38"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Useless. The AI did not respond to any words at all. tried to restart the lesson and then had to pay for a subscription to continue. So far for a free trial.",
      "date": "2025-09-13T23:30:33"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "goed app",
      "date": "2025-09-06T22:27:45"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "works amazing but you need to pay for it",
      "date": "2025-09-05T20:48:01"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "the prices are outrageous.",
      "date": "2025-09-02T18:16:38"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Many people liked that app. and I was like if they like it why not downloading it? so I did, and I DONT regret it",
      "date": "2025-07-28T20:59:05"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "je moet er voor betalen en voor sommige mensen is het niet gemakkelijk aan de andere kant is het wel goed het helpt je en zeg wat je beter kunt zeggen",
      "date": "2025-07-17T15:15:05"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "Het beginnerniveau is te hoog bij het Japans. De snelheid van de spreker is te hoog, en hier kun je weinig in aanpassen.",
      "date": "2025-05-28T08:27:14"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "I really like this aap.It learns you very quickly",
      "date": "2025-05-19T19:11:42"
    }
  ]
}