{
  "name": "Simpler: English learning app",
  "google_package": "ru.zengalt.simpler",
  "google": {
    "title": "Simpler: English learning app",
    "description": "Learning English is now easier than ever! Try Simpler now.\r\n\r\nSIMPLER APP is an effective and helpful tool for language learners of all levels.\r\n\r\n<b>SIMPLER ENGLISH COURSE FEATURES</b>\r\n★ GRAMMAR in the form of short and simple topics \r\n★ DETECTIVE STORIES: a fun new way to practice your English\r\n★ Free daily access to TREASURE CHESTS with useful new words\r\n★ Effective DRILLS for each grammar topic\r\n★ ASSOCIATIVE word learning\r\n★ Authentic LISTENING material\r\n\r\nLearn and master the English language FOR FREE with SIMPLER!\r\nSimpler English course includes grammar, vocabulary and speaking modules.\r\n\r\n<b>HOW DID WE DEVELOP SUCH A SIMPLE AND EFFICIENT TOOL FOR LEARNING ENGLISH FROM SCRATCH?</b>\r\n\r\n<b>1.</b> We've developed an accessible and effective <b><u>GRAMMAR COURSE</u></b> for all-level learners.  English grammar can be confusing and overwhelming. Good news: we've done all the hard work for you. We took the most essential and relevant grammar and broke it down into bite-sized topics complete with drills. Each topic is a simple rule or structure, which comes with an instant comprehension check. With this system you can learn English grammar from the basics, all by yourself.\r\n\r\n<b>2.</b>We've created an improved <b><u>FLASHCARD LIBRARY</u></b> for more effective word learning. Each flashcard has a sentence which helps memorize the word using associations. The app uses <b>spaced repetition</b> to help you remember every word. Expand your vocabulary fast with Simpler. \r\n\r\n<b>3.</b> At Simpler we know the importance of <b>listening skills</b> and learning the correct pronunciation from the very beginning. That's why every phrase in our exercises is voiced by a native speaker. And in our <b><u>PRACTICE</u></b> section you can put new grammar and vocabulary to use and role play one of the two speakers in a real-life dialogue.  \r\n\r\n<b>4.</b> <u><b>DRILLS</b></u> are one of the key elements of our course. These are grammar exercises, such as completing a sentence or typing in the translation of a phrase. The drills train you to formulate correct sentences and use new grammar without even thinking about it. Some of the previously learned grammar is regularly added to your drills to keep your memory strong. We use various types of exercises in our drills to maximize the efficiency and make them fun. \r\n\r\n<b>5.</b> <b>Practice makes perfect.</b> You can select <u><b>RAPID PACE</b></u> and set your DAILY GOAL for extra motivation. Practice regularly and see the effects within a week!  \r\n\r\n<b>7.</b> <u><b>A UNIQUE FEATURE</b></u>: Enjoy thrilling detective stories adapted for English learners! Learn new words and phrases and start thinking in English as you solve crimes and mysteries. \r\n\r\nWith Simpler you can learn English for free.\r\n\r\n📭  <b>CONTACT US</b>\r\nIf you have suggestions or comments on Simpler App, please, send them to: <u>help@simpler.link</u>. We appreciate your feedback.",
    "rating": 4.8201184,
    "rating_text": null,
    "ratings_total": 723285,
    "ratings_histogram": [
      6778,
      4204,
      12785,
      64185,
      635073
    ],
    "installs": "10,000,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 5,
      "review": "güzel sevdim 👍❤️👍",
      "date": "2025-09-13T21:16:58"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "The app is specifically available for Spanish Italian Turkish and other languages. Dutch or German aren't in the language options.",
      "date": "2025-04-03T12:53:11"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Even tho my mobile device uses Dutch as standard language when I open this app everything looks in the Brazillian language. It would be better that for example if Dutch is unsupported that we automatically get English instead.",
      "date": "2023-01-29T15:27:58"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Good Fine.",
      "date": "2022-04-23T20:27:31"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "I cannot access the english or turkish version .It always come out in another language.",
      "date": "2020-05-22T10:13:57"
    }
  ]
}