[{"source": "apple", "author": "Eline Sofia", "content": "Duo helpt me erg goed met leren en ik vind het fijn dat je meerdere lessen kan volgen en dat het gratis is voor niks noppes nada 😂\nIniedergeval een leuke app met leuke lessen \nGr duckiefan 🫡"},
{"source": "apple", "author": "bl17827", "content": "Kan alleen pools in het engels leren niet nederlands pools 😴"},
{"source": "apple", "author": "DuoLingO—0", "content": "Batterij te snel op en heel langzaam uploaden echt heel slecht"},
{"source": "apple", "author": "Layanah2009", "content": "Hele leuke app ik heb het maar een dag en 2 dagen en kan al heel goed Japans"},
{"source": "apple", "author": "De beste duo", "content": "Op duolingo leer je heel snel en duo helpt je en herhaald je foute dus dauwload het nu snel het is hele goede hulp."},
{"source": "apple", "author": "Nattetak", "content": "Cannot hear half of what they are saying further in the courses"},
{"source": "apple", "author": "Mai hooglugt", "content": "1 minpuntje , het is jammer dat bij de Duitse cursus niet goed genoeg uitleg is voor de naamgroepen . meest belangrijke onderdeel in de Duitse taal. ook de Der-Die-Das, wat eigenlijk de basis is wordt niet aangepakt."},
{"source": "apple", "author": "Kaasisboos", "content": "Het zijn echt heel veel reclames en een abonnement is duur maar voor de rest een top app"},
{"source": "apple", "author": "Robbiebor", "content": "Werkt erg goed"},
{"source": "apple", "author": "A.Habawal", "content": "Good app"},
{"source": "apple", "author": "Tayas0604", "content": "Leerzaam en leuk dus ik raad het echt aan het is geweldig ook voor kinderen is het makkelijker te begrijpen"},
{"source": "apple", "author": "S.schutingbuurt", "content": "Alles kan je doen"},
{"source": "apple", "author": "GojiZoro", "content": "Why did they add the energy thing without it I would give 5 stars."},
{"source": "apple", "author": "Lyam1234", "content": "Ik doe nu Frans en ik ben er echt al goed in en ik kan ook al goed Frans en het helpt me echt merci, au revoir"},
{"source": "apple", "author": "Juukko", "content": "Super! Duolingo je lessen zijn super interessant en leuk"},
{"source": "apple", "author": "VannelopevonSchweets", "content": "Ik kan heel goed leren met deze app, en het is goed op niveau. Ik vind alleen het energiebalkje een klein beetje irritant, maar als je wat goede antwoorden op rij hebt, krijg je weer wat meer energie. Ook heel fijn dat ze rekening houden met je niveau bij de taal die je leert; en je kan ook muziek en wiskunde leren, dat is ook handig."},
{"source": "apple", "author": "Nickel_123", "content": "Duolingo leert mijn goed ik heb Japans echt snel geleerd om dus echt veel anime te gaan kijken Dankje ik vind duo echt heel leuk"},
{"source": "apple", "author": "Julius Caesar 2.0", "content": "Ik ben echt super slecht maar ik leer steeds meer. Ik geloofde de app Als eerst niet maar het is echt geweldig. Het is zeker een aanrader"},
{"source": "apple", "author": "Sddahh", "content": "Eerst nog wel leerzaam. Nu alleen leerzaam als je ervoor betaald. De hartjes waren leuker."},
{"source": "apple", "author": "Louisepoesje99doggolover", "content": "Super helpend en motiverend dit was m’n tweede les en ik kende ze allemaal nog"},
{"source": "apple", "author": "K weet niks", "content": "Het is zooooo leuk het helpt je echt heel erg om een nieuwe taal te leren dus als je een nieuwe taal wilt leren dan moet je DUOLINGO DOWNLOADEN!!!!!"},
{"source": "apple", "author": ":) L :) Lana :)", "content": "Ik heb er echt heel veel van geleerd en weet nu bijna alles wat er in de Spaans les word gevraagd"},
{"source": "apple", "author": "drinkt geen code nog wee", "content": "De kinderen eten pasta de pasta eten het eten het eten de eten de kinderen de kinderen de kinderen de kinderen de eten het eten de eten de eten de kinderen de kinderen de kinderen de kinderen de eten het brood niet het kind eet brood het brood niet eten de brood het kind het kind"},
{"source": "apple", "author": "Winterdeathyt", "content": "Alleen jammer er is geen Arabisch"},
{"source": "apple", "author": "Julia paardenmeisje", "content": "Dit is de beste app om te leren wat je maar wilt\nAllen het is jammer als je energie op is want dan kan je geniet meer spelen maar het gaat niet zo snel op"},
{"source": "apple", "author": "Cahitgul", "content": "Süper daha iyisi yok"},
{"source": "apple", "author": "Facenone", "content": "Bring back the hearts"},
{"source": "apple", "author": "Superman1777", "content": "Ik ben al meer dan een jaar een betalende klant(familie abonnement). Sinds kort is er een wijziging geweest in hun beleid.een zeer negatieve wijziging.eerst kon je met behaalde lessen streak freeze verdienen.je kreeg die als beloning voor het voltooien van een les, maar nu kan dat dus niet meer.Ze dwingen je om streak freeze te kopen maar ik betaal al het maximale.ik ben dus een streak kwijtgeraakt van 562 dagen en dit omdat ik 1 dag geen les gedaan had.ik kon hem afkopen maar dat wil ik niet. Voorheen had je altijd de mogelijkheid om hem terug te verdienen door 6 lessen te volgen. Dit bieden ze niet meer aan. ZE WORDEN HEBBERIG!!\nIk ga opzoek voor mijn familie naar een andere taal app"},
{"source": "apple", "author": "Highlikeahelicopter", "content": "Gebruik al jaren deze app met veel plezier. Sinds kort draait deze app steeds meer om geld verdienen. Steeds meer pop-ups die niet kan verdienen door te leren maar alleen maar kan betalen met echt geld. Echter wel goede app. Want je leert echt iets. Ook jammer dat vooral Europese en Aziatische talen worden ontwikkeld. Nog steeds geen spraakfunctie in Afrikaanse en maar 2 Afrikaanse talen."},
{"source": "apple", "author": "Zoë692", "content": "Na de nieuwe update waarbij je energie bij elke opdracht naar beneden gaat maakt het lastig duolingo vrijblijvend te oefenen. Voorheen koste het je alleen als je een fout maakt. Nu wordt je half gedwongen premium te nemen…"},
{"source": "apple", "author": "Kuip66h666y", "content": "Ik leer Engels"},
{"source": "apple", "author": "Blij zo", "content": "Je kunt in zelf gekozen tijd leren en alle manieren komen aan de orde: luisteren, invullen, praten"},
{"source": "apple", "author": "Alex Khorus", "content": "Annoying adds for little value"},
{"source": "apple", "author": "Alex the Great the First", "content": "I tried to log a ticket with some concerns: 1. App indicates sometimes I did not do a lesson on a day while I am sure I did 2. The emails I am getting a really pushy and demotivate me more than motivate me 3 The feedback / support sections do not open so it is hard to ask questions or provide feedback about issues"},
{"source": "apple", "author": "Ange9419", "content": "Oppassen ! Ze smeren je een gratis proefperiode aan van een aantal dagen !  Doe dit absoluut niet ! Ze hebben zonder toestemming een jaarabonnement bij mij afgeschreven van € 104,99 . Zonder daar enige toestemming van te hebben!"},
{"source": "apple", "author": "M N=<3", "content": "Het is prima maar de meldingen zijn vervelend en de zinnetjes zijn bijna altijd het zelfde dus je leert het minder goed dan op school"},
{"source": "apple", "author": "NBvZ6", "content": "De nieuwste update is ronduit slecht. De energie is elke keer precies op halverwege de legendarische oefening. De hartjes werkten veel beter! Je krijgt bij het aanvullen van de energie tijdens de legendarische oefening alleen aangeboden om een abonnement af te sluiten, maar de optie om je diamanten te gebruiken laten ze niet zien. Dat is pech, Legendarische oefening weg. Ook zeggen ze je kan een week gratis “Super DuoLingo” gebruiken, en krijg je twee dagen alvorens het eindigt een melding om kosteloos te annuleren. Deze melding heb ik dus niet gekregen en er werd na 6 dagen al een bedrag van maar liefst 104,99€ afgeschreven (gelijk het jaarbedrag en niet eens de maandelijkse optie). Gelukkig heb ik dit via Apple wel snel terug gehad maar vanuit DuoLingo vond ik dit echt slecht! Tevens de AI service desk is echt om te janken, soms heb je gewoon echt een medewerker nodig. Ik hoop oprecht dat bovenstaande punten verbeterd gaan worden want het is een leuke en goede app om een taal te leren."},
{"source": "apple", "author": "Djtje", "content": "Om de beginselen van een taal te leren is het leuk. Het niveau blijft redelijk laag en uitleg is er bar weinig (vast beter als je betaalt). Raar: je hebt energie aan het begin van je les, maar ook als je goed antwoordt, loopt de energie terug. Duolingo zit duidelijk aan het stuur… net als in sommige teksten/dialogen waarbij duidelijk ideologische keuzes zijn gemaakt, waardoor Duolingo zich manifesteert als links liberaal. Dat verwacht ik niet van een taalapp."},
{"source": "apple", "author": "je mag niet weten wie ik ben", "content": "It’s the best game now I can talk Turkish"},
{"source": "apple", "author": "Van p drop", "content": "Duolingo heeft soms een\nBug maar toch is het een fijne app"},
{"source": "apple", "author": "Suze..", "content": "Het is een fijne app maar het is vervelend dat je hartjes of je batterij op kan waar door je moet stoppen. Als je een taal wil leren zou ik van af het begin beginnen als je er nog niet zo goed in ben want Duolingo laat je vaak met bestellen of zo iets beginnen. Maar voor de rest is het wel een fijne app. 👍👍"},
{"source": "apple", "author": "Roosssss2025", "content": "Het is een fijne app maar er zitten kleine foutjes in en soms loopt de app compleet vast."},
{"source": "apple", "author": "Dit spel is echt super leuk!", "content": "Door Frans te leren op Duolingo kon ik beter meedoen met de Frans lessen in de eerste, ik zit nu nog steeds in de eerste en het gaat best goed! Ik leer veel van Duolingo, ik zou het zeker proberen!"},
{"source": "apple", "author": "Süper ..", "content": "Güzel ıygulama fakat yeni ögrendigimden bazı yapıştırıcı gibi yapıştın 7 dakikada bitirdin gibi olumsuz motivasyona gerek yok çogu kezde üye olmadıgım için dersden çıkartılmam hoş degil be aynı şeyleri sık tekrar edilmesi"},
{"source": "apple", "author": "OilNurse", "content": "Ik gebruik duolingo elke dag en het maakt leren echt leuk. De korte oefeningen, speelse opzet en het gevoel van vooruitgang houden me gemotiveerd."},
{"source": "apple", "author": "25L4R5", "content": "Dikke 5 sterren, makkelijk om een taal op een leuke manier te leren en zeer educatief. Hartstikke bedankt voor deze geweldige app 🙏"},
{"source": "apple", "author": "Tess de bosbes tas", "content": "Echt geweldig, enige nadeel is is dat je energie heel snel op gaat."},
{"source": "apple", "author": "Henk69 67", "content": "Genoeg"},
{"source": "apple", "author": "Kris-67RR", "content": "Super leuke app om in mijn geval Spaans te leren!"},
{"source": "apple", "author": "Marina Ancher", "content": "Nice app to practice all languages:)"},
{"source": "apple", "author": "Nebilakkus", "content": "Goed spel"},
{"source": "apple", "author": "Ezie boy 313", "content": "Heel leuk om talen mee te leren alleen weet niet precies wat ik met de diamanten moet en die XP maar echt een aanrader"},
{"source": "apple", "author": "Blonde haren", "content": "Ik vind Duolingo super handig voor de kinderen die Engels lastig vind net zo als ik echt gewoon ZO GAAF!!!!"},
{"source": "apple", "author": "Snuf9", "content": "Ik vond het eerst best wel moeilijk maar het gaat nu een stuk beter dan eerst\nDankje wel"},
{"source": "apple", "author": "Mirtoesh", "content": "Sadly they have changed “hearts” (lives when you make mistakes) to a “battery” which runs out as time passes by. If you execute exercises correctly, the add some time to the battery. \nThis is making me hurry the exercises, I don’t have time anymore to read the sentences out loud. It leads to me learning less then before. Also, the battery seems to run out faster when you make mistakes - or at least no time is added - leading to less time to practice another exercise. It takes a lot of the fun out of Duolingo, making you learn less and its a bit demotivating."},
{"source": "apple", "author": "@TOMMYBOYY_", "content": "no russian supported??"},
{"source": "apple", "author": "Abuelalilly", "content": "Al een keer lid geweest voor een jaar. Het is verslavend en je leert super leuk. Het lukt mij alleen niet om een nieuw abonnement af te sluiten. Ga even uitzoeken wat ik verkeerd doe."},
{"source": "apple", "author": "Liss🤍🖤", "content": "Ik vindt het geweldig voor de monsieur die dit gemaakt heeft mijn Frans is echt opgestegen bedankt🤍🖤"},
{"source": "apple", "author": "Natalisa1208", "content": "Hele leuke manier om een taal te leren!!"},
{"source": "apple", "author": "Rebelket", "content": "All those maintenance breaks really suck."},
{"source": "apple", "author": "Kiraenboeska", "content": "Heel leerzaam en leuk om een vreemde taal te leren op deze manier. Het enige minpunt vind ik dat er geen uitleg over de grammatica is."},
{"source": "apple", "author": "p0stduif", "content": "The app itself is lovely, some inconsistencies here and there. But  let me start why two stars, if not one. The ads are attrocious, I am on a payment plan and yet I still get spammed for an upgrade. I payed to get rid of them and to support this app, but apparently they do not care about paying costumers. They only care about MORE money. It is an absolute disgrace, and do not even get me started about the constant lure to the app, easily 10 notifications on a day to start learning. You think only app notifications? Well think and look twice, they come in your mail too. An absolute disgrace and big disservice to the paying costumer."},
{"source": "apple", "author": "Job2367", "content": "Het is een geweldig spel en ik kan nu makkelijk mijn talen oefen voor school"},
{"source": "apple", "author": "lady Mat", "content": "Doe nu al een paar jaar duolingo om Frans te leren.\nVind de manier van les geven leuk, afwisselend en heel goed te doen.\nKrijg complimenten van de Fransen dus het werkt echt!"},
{"source": "apple", "author": "Noorabida", "content": "Leuk alleen ook stom over dat betalen Wrm niet gwn gratis leren nu moet ik wachten op me energie en met betalen niet ik wil gwn gratis goed kunnen leren"},
{"source": "apple", "author": "anoniem van tiktok", "content": "pleas Make the Hearts ggo back! Youre Quickly running out of energy and I can’t afford an subscription…"},
{"source": "apple", "author": "Flippppie", "content": "Je kan van alles en het is superleuk en leerzaam!"},
{"source": "apple", "author": "hoooooói", "content": "Soms dan komt er voor dat ik het moet inspreken  en dan klik ik er op dat ik dat wil doen en dan kan ik het alsnog niks inspreken"},
{"source": "apple", "author": "strebom", "content": "I reported a bug. A corrected mistake keeps coming back for the last 2 weeks. Also my XP number isn’t updated. I find it very weak that there is no helpdesk to talk to."},
{"source": "apple", "author": "Noud12345", "content": "Dit is echt de beste manier om talen te leren op een leuke en niet saaie manier"},
{"source": "apple", "author": "Nikita Mokum", "content": "Super leuk"},
{"source": "apple", "author": "Calle Terraza", "content": "Heel leerzaam en te begrijpen"},
{"source": "apple", "author": "Floepielala", "content": "Vind een taal leren best leuk doen ze ook best leuk. Maar ze proberen je constant geld af te troggelen. 😔"},
{"source": "apple", "author": "Gvihtrbvrfihbvihfe", "content": "I really liked Duolingo until today because I was on a perfect 3 week streak and I had not missed a day for 3 whole weeks and I had 150 days but today I don’t understand why but I have a 3 day streak"},
{"source": "apple", "author": "Uppie4", "content": "Waarom kan ik alleen maar  in het Engels Duits leren? Alles staat in gesteld op Nederlands. Ik wil van Nederlands naar Duits."},
{"source": "apple", "author": "sophia🐰🙈", "content": "leuk om nieuwe talen te leren"},
{"source": "apple", "author": "verordeel", "content": "Hi Duo, if the team sees this, could ya please suggest adding Papiamento and African to the app? I’d love to learn those languages!"},
{"source": "apple", "author": "Hans Moonen", "content": "Leuke en leerzame app duimpje omhoog 👍🙀 leer nu Frans 🇫🇷 en muziek"},
{"source": "apple", "author": "VisPo", "content": "Het is best snel en goed om te leren maar soms doen de spreek ‘kaarten’ doen een beetje irritant en energie is te snel op maar ik kan een maand zonder omdat de gratis proef dat is wel fijn maar uiteindelijk wel een beetje duur. Maar verder dus wel super leuk en snel ( ik leer Frans)"},
{"source": "apple", "author": "CathyM82", "content": "Super leuke manier om vreemde talen te leren"},
{"source": "apple", "author": "DeGeChallende", "content": "Gaat heel gemakkelijk"},
{"source": "apple", "author": "Yesjhwiwh", "content": "Ik leer Duits en dat vind ik leuk , bitte!"},
{"source": "apple", "author": "FrontmanVL16", "content": "Je begint met 25 en voor je het weet is die op 1 en dan moet je geld betalen"},
{"source": "apple", "author": "In0cencia", "content": "It works okay. But the prices are crazy. Also girlfriend got charged for a year without a warning! Scam, watch out!"},
{"source": "apple", "author": "Catha645/catha262", "content": "Ik vind het heel leuk en ik leer ook heel veel ervan! Ik vind het wel jammer dat ik het niet kon overzetten naar mijn nieuwe iPhone en ik mijn reeks van 220 (van Catha645 naar catha262) opnieuw moet doen."},
{"source": "apple", "author": "Hw 92", "content": "The energy system rendered it useless"},
{"source": "apple", "author": "Maffe donut", "content": "Het is irritant dat er nu batterijen zijn bijgekomen en als je op zijn kan je niet meer verder met leren dat is echt heel vervelend.dan zit je zo lekker spelen en dan is je batterij op van het spel dan kan je niet meer spelen en als je meer batterij wil dan moet je dat betalen"},
{"source": "apple", "author": "😀😃😀😃😀😃😁😃", "content": "Het helpt je enorm om een taal te leren, het heeft mij super goed Duits geleerd! Alleen is er na elke les reclame over steeds hetzelfde onderwerp."},
{"source": "apple", "author": "fub ganer", "content": "Better than i expected. Nice teaching technique that focuses on your mistakes until you get them right. Impressive…must try"},
{"source": "apple", "author": "Silvia Mèlange", "content": "It’s impossible to do even a single lesson without ads. Never in my life have I seen any app take points away when your answer is correct 🤯 Adding the many grammar errors in multiple languages, wrong robot pronunciations, and the fact that by the time the ads are done, I forget which language I was supposed to be learning, you won’t convince me to pay for the full version. You are however, strongly pushing me to uninstall this parody of a language learning platform after almost 2000 days.. Bye, lingo!"},
{"source": "apple", "author": "⏰🎚️⏳🧭", "content": "Dev if you see this thanks for helping me Japan"},
{"source": "apple", "author": "Gebruiker@22", "content": "I really like the app, because you can learn a language with small learning portions and varariety of reading, writeng and speaking. For me personally i would like less repetition.. or more personalised learning (many mistakes > more repetition , little miststakes> faster to the next level) and more positive caracters"},
{"source": "apple", "author": "Jdgdjdbdc", "content": "Ik vind het een leuke app en het is ook leuk om het te spelen en in 2 dagen weet ik al heel veel dus ik zou het downloaden!!!"},
{"source": "apple", "author": "Vfcbiu", "content": "Omdat het geld kost vind ik het 4 sterren"},
{"source": "apple", "author": "Katseye454", "content": "Ik ben 12 jaar en ik leer heel makkelijk Spaans echt een aanrader"},
{"source": "apple", "author": "Gigigigigigigokibdhicc", "content": "Hij is heel goed allen nu nog zorgen dat wat minder hoeft te betalen met diamanten die je verdiend voor de rest is het top"},
{"source": "apple", "author": "Marijke85", "content": "Ik vind Duolingo heel leuk maar je moet superduolingo doen als je het even 10 min wil doen daardoor krijgt het van mij 4 sterren"},
{"source": "apple", "author": "Sevhaa", "content": "De talen die je kunt leren vanuit Nederlands zijn vrij beperkt. Zouden jullie de taal Servisch kunnen toevoegen? Talen vanuit de Balkan."},
{"source": "apple", "author": "Lswsusan", "content": "These don’t work anymore. Also I would like to know when there is an update to German B3"},
{"source": "apple", "author": "Kees koen park", "content": "Super leuk"},
{"source": "apple", "author": "Trins19", "content": "Makkelijk leren en prima hulp"},
{"source": "apple", "author": "1234446454342556),)$:,?7:,)", "content": "Hele fijne app, koreaans leren is nooit makkelijker geweest"},
{"source": "apple", "author": "Yra456", "content": "Since the last updates the app got worse and worse. They keep rearranging everything;  Make it impossible to play for free;  and seem to have ditched some of their best features (like the one where you get dubbel XP in de evening if you’ve also played that morning, and dubbel XP in the morning when you’ve played the evening before)."},
{"source": "apple", "author": "Geweldig!! Site", "content": "Ik liep achter met rekenen maar door Duolingo niet meer \n\ngeweldig site."},
{"source": "apple", "author": "Duolingo !!!!", "content": "Het is echt geweldig nu kan ik heel goed Engels leren Duolingo echt 5 stèren"},
{"source": "apple", "author": "Siennasalamat88", "content": "Jullie helpen kinderen met lessen en helpen kinderen heel goed liefs siennasalamat88"},
{"source": "apple", "author": "Es te n", "content": "Het gaat mij niet om het schrijven, maar om het leren spreken. De schrijfoefeningen zijn een enorm struikelblok waar ik over blijf vallen. Het irriteert me en zorgt ervoor dat ik echt veel minder plezier heb in de oefeningen. Als ik zie wat er goedgekeurd en afgekeurd wordt dan denk ik soms echt: pfff waar gaat dit over. Echt een tegenvaller."},
{"source": "apple", "author": "RiksGewijs", "content": "Zit goed in elkaar. Jammer dat ik alleen in de late avond tijd heb en dus steeds meldingen heb dat ik mijn les moet doen om mijn reeks te houden."},
{"source": "apple", "author": "Hé hmm", "content": "DIT IS SUPER GOED IK KON HIERVOOR GEEN PORTUGEES MAAR NU WEL EN IK WIST NIKS VAN SCHAKEN EN NU KAN IK MIJN HELE VRIENDENGROEP VERSLAAN alleen is de energie niet goed doe weer die hartjes"},
{"source": "apple", "author": "Yusuf 234", "content": "De app is normaal goed maar de energie vind ik niet zo goed en al die dingen die ermee temaken hebben"},
{"source": "apple", "author": "67fan67", "content": "Ik ben nu veel beter in Engels door Duolingo"},
{"source": "apple", "author": "Tectonicfan", "content": "Het is leuk alleen hoef je geen reclames ook al heb je geen super of max alleen is je energie soms op als je nog maar 1 vraag hoeft en dat is niet keukenartikelen verder wel doei"},
{"source": "apple", "author": "Elskeblom", "content": "Opzich een leuke app. Ik kreeg de optie om een week gratis het abonnement uit te proberen. Er stond bij vermeld dat het abonnement automatisch zou stoppen en dat ik een melding zou krijgen wanneer de proefperiode voorbij was. Ik heb geen melding gehad en het abonnement is nu alsnog stilzwijgend verlengd waardoor ik ineens een rekening kreeg van €104?!?! Hopelijk krijg ik het geld terug van Apple, want Duolingo zelf is niet thuis aldus hun helpdesk."},
{"source": "apple", "author": "Tutfrut", "content": "De oefeningen zijn soms saai omdat ze te vaak worden herhaald. Het niveau van de gebruiker zou herkend kunnen worden waarna het niveau wordt aangepast of sneller wordt aangepast."},
{"source": "apple", "author": "Shin-Di", "content": "Ok so it was a great app but then my phone broke and it just automatically saves my password as “password” so now I can’t log in and my 300 streak is gone plus the new energy is literally the dumbest and most irritating thing they ever made like u can’t even finish a lesson before ur energy runs out and then their gonna be all “get super duolingo for more energy” like I ain’t gonna buy it if u act like that besides I don’t think anybody even likes this energy idea"},
{"source": "apple", "author": "Ik ben nisa", "content": "Best goed   Je leerd er van❤️"},
{"source": "apple", "author": "Sterre_eq", "content": "Ik kan deze app niet verwijdere"},
{"source": "apple", "author": "Tejuuuuu22", "content": "Echt super leerzaam en een leuke manier om talen te leren👍🏽"},
{"source": "apple", "author": "Welke bijnaam is al gekozen", "content": "Ik vind het wel een leuke app maar als je echt lang gaat leren verlies je batterij en moet je wachten tot de volgende dag. Daarnaast krijg je na elke les die je maakt een reclame spot. En ook een groot nadeel; je kan er niet offline mee leren. Ik vind het niet de moeite waard."},
{"source": "apple", "author": "Kiki😍😍😍😍", "content": "10"},
{"source": "apple", "author": "Hans Vermeer", "content": "I’m very glad I found this!"},
{"source": "apple", "author": "kxelly", "content": "."},
{"source": "apple", "author": "Luckyellio", "content": "Beter iets dan niets.\nMaar na elke opdracht dat verkoop praatje.\nEen week gratis.\nEigenlijk zou alles gratis moeten zijn dan snappen de mensen die het willen elkaar beter op de wereld"},
{"source": "apple", "author": "deannacho", "content": "They continually update the app and it rearranges the menus every time so every week you’re trying to find the same things again. It’s superbly annoying and pointless. It forces you to spend more time in the app but not actually using any of it so it just makes it a frustrating experience\n\nAlso they like to update the language paths, which would be fine but instead of adding in the info you’re now past, based on the new levels, they just throw things in as if you learned them 10 lessons ago when they’re totally new, and teach things you previously learned and used for 20 lessons as if it’s a new word"},
{"source": "apple", "author": "Hooijtjes", "content": "Waarom diamanten. XP , superduolingo etc. Ik wil gewoon oefenen en doorgaan"},
{"source": "apple", "author": "Makkelijke app om te gebruiken", "content": "Leuke makkelijke manier om een andere taal te leren"},
{"source": "apple", "author": "Zaza is cool", "content": "Het is best leuk maar je xp is soms te laag en dan kan je niet spelen"},
{"source": "apple", "author": "chantal sietsma", "content": "De vele herhalingen zijn fijn!"},
{"source": "apple", "author": "DexterMorgan00", "content": "Very nice, I’m learning more and better Spanish via Duo than I did back in high school. \n\nJust wish they’d have a different system with the energy/battery bar to learn. Sure, watching an ad for 5 energy is doable, but it kinda ruins the fun having to watch 5 ads (for the full 25 energy bar) every time, just to do a lesson without having to be worried about having 0 energy left mid-lesson (without paying for super). \n\nWould definitely recommend it though. Give it a try."},
{"source": "apple", "author": "I bc hsonceohcos", "content": "Ik vind het op zich wel leuk maar, als je moet praten het woord inspreken dan telt die het soms fout."},
{"source": "apple", "author": "BakedBeatle", "content": "It used to be a great app, but ever since the update that introduced energy instead of hearts, it’s been increasingly irritating. Sometimes I can’t even finish a “legendary” lesson because I run out of energy and lose all the XP I’ve earned. It’s a shame that, sooner or later, all companies seem to care less about their original purpose and more about monetizing their business."},
{"source": "apple", "author": "Koekieroekie", "content": "Het is een leuke en handige app om talen te leren, en je kan ook muziek, wiskunde of schaken doen, maar soms heb je een storing en dan zegt de app dat je offline bent. Er stond toen ook “try a lesson on your home screen” maar dat werkte ook niet. Toen heb ik het in de browser geprobeerd maar dat werkte niet heel goed. Laatst had ik een perfecte reeks van twee maanden, maar toen kreeg ik een storing waardoor ik geen les kon doen en was m’n perfecte reeks weg. Ik heb natuurlijk nog wel m’n echte reeks door reeksbevriezingen maar mijn perfecte reeks is nu weg."},
{"source": "apple", "author": "Le669", "content": "It is good that it challenges to keep learning, but I hate how much it manipulates, sometimes being flawed, like stating you missed a day when it is not true, messing up your score of giving wrong tips. I have a paid version and still it pressures for other additions."},
{"source": "apple", "author": "Daan 🤩🤗", "content": "Het is een erg handige en leuke app, het nadeel is dat Duolingo je heel veel berichtjes stuurt en je herinnert dat je het nog moet doen op die dag."},
{"source": "apple", "author": "followmeontiktoklexiestocax", "content": "Het is wel prima, ik vindt vooral de spreek dingen leuk !!🙃"},
{"source": "apple", "author": "Kira_737", "content": "I learn alot of things on Duolingo but it has Some bugs and now i cant keep my Duolingo streak alive😔"},
{"source": "apple", "author": "BerendsAdventure", "content": "I love Duolingo but over the past year the quality has gone down a lot. I get exercises that I’ve already done and sentences seem odd."},
{"source": "apple", "author": "Felien6", "content": "Ik vind het wel leuk om te doen, maar ik zou het leuk vinden als het iets meer een game wordt, want soms heb ik daar zin in"},
{"source": "apple", "author": "Cemulders", "content": "Het is een erg goede app, maar misschien moet er net iets meer grammatica in staan, bijvoorbeeld met als de past simple of the present simple."},
{"source": "apple", "author": "Finn Schill", "content": "Heel leuk voor mijn spel om Engels te leren"},
{"source": "apple", "author": "Laberto1998", "content": "Ik kan de app niet meer gebruiken vanwege onderhoudspauze. Hoewel ik online ben moet ik online gaan vanwege onderhouds pauze"},
{"source": "apple", "author": "Schakimon", "content": "Is the app down today?"},
{"source": "apple", "author": "daan merle florian jasmijn", "content": "Goed maar niet altijd betrouwbaar en niet altijd echte worden"},
{"source": "apple", "author": "Jettinda", "content": "Ik ging het een leuke app maar soms loopt ie een beetje vast kan ook aan me telefoon liggen hoor zeker downloaden!!"},
{"source": "apple", "author": "Creachickfann", "content": "Je kan snel leren en het is leuk!"},
{"source": "apple", "author": "daddy_devito_", "content": "not only the many bugs (feels like they rely on AI lately) but also since the switch to “energy” battery thing its demotivating to keep learning. ive heard many people about this, many have deleted the app due to this and im considering the same because of this stupid idea. how am i supposed to learn when i barely have the energy lvl for 1 or 2 lessons????"},
{"source": "apple", "author": "jllbrmn9320", "content": "Hele leuke manieren om een nieuwe taal te leren. Je wilt er aan blijven werken. Aan iedereen aan te raden"},
{"source": "apple", "author": "Cajoule", "content": "Sommige figuren hebben een heel irritante stem, of hoog en vlug sprekend, of alsof alles even vervelend is."},
{"source": "apple", "author": "Mabje55", "content": "Ik vind het erg leuk, om op deze manier in mijn eigen tempo een andere taal te leren!"},
{"source": "apple", "author": "Viper lexus", "content": "Vanalles geprobeerd: schriftelijk, klassikaal. Maar dit werkt voor mij het best en is gewoon verslavend. Ben echt benieuwd of C2 haalbaar is. Geadviseerd wotdt om ook podcasts, boeken etc te combineren"},
{"source": "apple", "author": "DhdihFiducie", "content": "Mijn taal is Arabisch, ik wil Nederlands leren, maar er is geen Arabische vertaling"},
{"source": "apple", "author": "-merijn", "content": "Vanmorgen een update gedaan, maar nu werkt de app niet meer. De app geeft aan ‘maintenance break’. Wat is er aan de hand? Op de site staat er niets over."},
{"source": "apple", "author": "Ggfcsygduhdnjsjks", "content": "Geen betrouwbare app ik werd vaak gehackt. Maar verder wel een fijne manier op te leren"},
{"source": "apple", "author": "sheeane", "content": "Jammer genoeg mis ik een Spaans-Nederlandse versie. In de Mexicaans-Amerikaanse versie zijn toch veel Engels/Amerikaanse uitdrukkingen niet duidelijk voor mij."},
{"source": "apple", "author": "Djéla", "content": "Super leuk om te oefenen voor kids/ volwassenen"},
{"source": "apple", "author": "Noah Iedema2000", "content": "Teveel filmpjes en figuurtjes die na het voltooien van elke les opduiken. Vind dit erg storend en afleiden van de lessen zelf. \nVerder is het een fijne app om talen te leren!"},
{"source": "apple", "author": "Soofje_2013", "content": "Echt super app je moet niet te veel op een dag oefenen want dan moet je bij betalen maar verder is het echt een geweldige app ⭐️⭐️⭐️⭐️"},
{"source": "apple", "author": "Imitatie", "content": "Ik vind het echt heel goed \nIk kan er heel veel mee doen het is leerzaam"},
{"source": "apple", "author": "Hala11223", "content": "It becomes very annoying recently with all the advertising after every lesson and you lose power immediately so you cant learn anymore. I am using Duolingo for more than 6 years. It was beter than now."},
{"source": "apple", "author": "Janniene88", "content": "Ontzettend leuke manier om kennis te maken met een andere taal!"},
{"source": "apple", "author": "Grote teen op mijn bord", "content": "Poepspel"},
{"source": "apple", "author": "#iloveyouduolingoooo!❤️❤️‍🔥🩷", "content": "Ik hou zo veel van deze geweldige leerzame app ik kan door een reeks aan te maken zien of ik elke dag genoeg oefen en dan word ik tenminste op een leukere manier slim dan op school😝🤭😘🥰❤️❤️‍🔥😊🫠☺️"},
{"source": "apple", "author": "Wouterrr123", "content": "Exercise where you have to speak words is super frustrating as you can not continue if you do not know"},
{"source": "apple", "author": "Je expertise", "content": "Je kan er goed mee leren maar het is stom dat je moet betalen voor hartjes en als je een fout maakt verlies je een hartje, maar als je hartjes op zijn moet je er hartjes bij”kopen” en als je daarvoor niet genoeg juwelen hebt dan kan je niet meer verder leren, pas over 6 uur ofzo zegt hij dan"},
{"source": "apple", "author": "rainbowsnuffie354", "content": "Het is 1. Leerzaam 2. Leuk om mee te leren 3. Gewoon super super leuk😚😄"},
{"source": "apple", "author": "Artemis 70", "content": "I have been using Duolingo for a long time now to maintain some level in several languages. It used to be that I could use both the website and the app. In recent years, the focus has been on the app completely. Duolingo provides many games that incentivize. These only work in the app, unfortunately.\n\nBy now I have a streak of over 2000 days and have been in the top league for almost three years. According to Duolingo, one can learn to speak a language within a couple of months. I am not sure how much time I would need to spend to make that happen. I speak 5 languages already, and working on number 6 and 7 for years hasn’t gotten me to the level that I would have expected given the advertisements. Still, Duolingo does help and is fun.\n\nThe app does have issues that sometimes bug me. For example, I had completed one language 100%, including Legendary. A few weeks back, Duolingo set me back to 2/3s of the complete lessons. Support couldn’t help me with this.\n\nRecently, Duolingo introduced MAX, which allows you to interact with an AI in a conversational mode. This is really really bad. I have been forced multiple times now by Duolingo to get MAX for free, forcing me to actually try conversations with the AI. If Duolingo continues to force this on me, I am going to quit Duolingo. MAX is really really bad and I don’t want to use it at all!"},
{"source": "apple", "author": "Road767676", "content": "I have a paid subscription and it’s truely annoying that Duo Lingo comes up with a free trial for 7 days on Duo Lingo Family. You can’t click it away. The free trial stops without a payment. \n\nIt is soooooo annoying and just stop with this. I don’t have a family amd i dont need a family subscription. Thanks"},
{"source": "apple", "author": "Casper is losoe", "content": "Sometimes I get confused, but that’s ok it’s still super fun!"},
{"source": "apple", "author": "ybakun", "content": "At first that was fun to learn with Duo but then this energy update made me delete the app in a couple of weeks.\nThey say they care of users as you won’t loose energy when making a mistake. But actually energy allows to do way less lessons than hearts and honestly feels just like a try to aggressively push people to buy subscription with infecting the app with ads on every possible step. \nThe last straw were legendary lessons though. To answer one question you need to spend 2 points of energy. It just makes no sense"},
{"source": "apple", "author": "Hoihoi:-)", "content": "Ik leer heel veel nu doe ik Engels en ik weel ook nog Spaans en Frans leren dus super top ❤️🥰"},
{"source": "apple", "author": "plakselplak", "content": "After selecting first questions it cant connect to duolingo. Can’t use app. It’s broken"},
{"source": "apple", "author": "Esmee🪩", "content": "Ik gebruik al 350 dagen Duolingo en het is echt een hele goede app\nHet is alleen wel jammer dat je veel reclames krijgt maar ja \ndat hoort er bij\nAls je geen super of Max abonnement hebt \nDus conclusie \nHele goede app ik blijf er mee doorgaan \nBye bye!"},
{"source": "apple", "author": "ZOMER SUMMER", "content": "Er zijn de hele tijd reclames met een overduidelijke AI stem"},
{"source": "apple", "author": "Jazzyjoanna", "content": "Very easy to use"},
{"source": "apple", "author": "Duo downloaden", "content": "Het is een leuke manier om een taal te leren en ik doe het met mijn hele gezin"},
{"source": "apple", "author": "Panterlovereef", "content": "Ik vond Japan al super leuk en ik was er fan van en ik wou deze app zo graag en nu spreek ik al een beetje Japans!❤️🥳🥰😍😘"},
{"source": "apple", "author": "Eli angelova", "content": "Çok güzel çünkü İngilizce öğreniyorsun"},
{"source": "apple", "author": "Koeki 299", "content": "Duolingo helpt met engel bijvoorbeeld en is ook heel leuk probeer het maar op Duolingo"},
{"source": "apple", "author": "_0rnahh", "content": "Was very excited to start with Duolingo again but the new energy function makes it so demotivating 😕"},
{"source": "apple", "author": "BATUFLEX NEDERLAND", "content": "roblox 99 nights in the forest is beter nep ga nooit met die domme duo weer terug!"},
{"source": "apple", "author": "Lqek", "content": "Can’t even complete a legendary lesson with how fast the energy drains… the app is completely unbalanced now"},
{"source": "apple", "author": "Leuk en bizar", "content": "Zooooo leuk"},
{"source": "apple", "author": "Hein van Gemert", "content": "super leuk om te doen"},
{"source": "apple", "author": "Gchgjyfhjurf", "content": "Door Duolingo mag ik naar Spanje \nIk"},
{"source": "apple", "author": "Lize952", "content": "Het is alleen vervelend dat ik zo kort kan oefen"},
{"source": "apple", "author": "bvgj8kjgfrevgj", "content": "Wil graag tsjechies leren? \nHelaas staat deze taal er nu net weer niet bij"},
{"source": "apple", "author": "Kljhvgbmi", "content": "Why this energy bs? It's no fun anymore like this. Even when not making any mistakes it forces you to quit practicing. Super annoying and demotivating."},
{"source": "apple", "author": "Stadler and waldorf", "content": "Heel erg jammer dat de litouwse taal er niet bij staat. Ik zou het graag willen leren via Duolingo aangezien het heel erg leuk is, en andere apps, niet handig alles uitleggen zoals Duolingo dit doet, voeg het a.u.b. toe!"},
{"source": "apple", "author": "Hoi chris", "content": "Het is een heel leuk leerzaam spel, maar wel jammer dat super Duolingo zo duur is, dus ik doe nu de normale variant maar had graag de super Duolingo gedaan. Maar verder een super de bom leuk spel en ook heel leerzaam en wel fijn dat je de normale variant gratis kan doen."},
{"source": "apple", "author": "“””””””””””””””7439742963", "content": "Het geeft je dwang als je het niet doet en het is onmogelijk om het te verwijderen, NIET DOWNLOADEN BEHALVE ALS JE VAN DWANG IN JE LEVEN HOUDT :- |"},
{"source": "apple", "author": "Vincervi", "content": "It’s a good learning app I learnt how to speak Japanese with this app and you can learn more languages"},
{"source": "apple", "author": "Creachickfan2013", "content": "Getild een prachtige app ik leer er in supersnel tempo Spaans en Engels ook herinnert de app me goed om te oefenen alleen ik krijg wel veel berichtjes"},
{"source": "apple", "author": "Mr.Fred Genoeg", "content": "If you could chose what you would learn it would be much more practical"},
{"source": "apple", "author": "Plantje1985", "content": "Het is super leuk om leerzame leuke dingen te kunnen doen.Zeker een aanrader"},
{"source": "apple", "author": "Zwenprooooooooooooooo", "content": "Super leuk en speels op deze manier ! M’n kinderen leren ook Frans . Ze zijn 10 en 7 . We gaan van de zomer naar Frankrijk ."},
{"source": "apple", "author": "anonymous_—", "content": "Breng hartjes terug... energie voelt voor een beperking dat alleen mensen die betalen hun missies mogen halen en mensen die gewoon een nieuwe taal willen leren zonder te betalen 1 les per dag kunnen doen sorry hoor maar ik leer echt geen japans door 1 les per dag te doen"},
{"source": "apple", "author": "Korea lovers😝😝", "content": "Het is super fijn om mee te leren je leert er veel meer van de meeste apps hebben vaak reclame maar duo niet BESTE APP  TER WERELD"},
{"source": "apple", "author": "Babiaan", "content": "Onvoldoende voor geschiedenis maar men Duolingo streak is er wel"},
{"source": "apple", "author": "Dantndhdmsksuxdjdhdhh", "content": "I found it very fun to lay in bed with him and we watched porn every day"},
{"source": "apple", "author": "NonGurlyGamer", "content": "This app keeps getting worse and worse for the free to play people. It is supposed to be a fun way to learn some basics, but since the new updates you’re getting punished for normally doing a lesson. Back in the old days, you could just play and some stuff would be behind a paywall. This was okay, since you would be fine with the things that are available. Then the heart system arrived, making it so that you could just fail 5 times and had to wait to recharge. A mistake equalled a penalty. Now, you get penalized for literally *every* answer, good or wrong. Your battery drains with every question, and the legendary ones even take up your entire battery. You have to make sure you watch all their carefully aligned ads so that your bar is full and you can use all of it at once and empty it all out again. It’s crazy that just one or two lessons is all you’re allowed to do. \nI can’t wrap my head around how a game that’s supposed to be a fun way to learn some words and sentences can be so cruel in terms of their paywall. If they would actually explain the grammar, and have pieces of information to read in between on how to apply certain rules in the language, then you would be allowed to call it a learning app. \nThis app keeps blowing the community’s mind, like when you thought Duolingo couldn’t sink any lower, it definitely can. If you’re still thinking about getting Duolingo, just go to r/duolingo on Reddit and be amazed by the sneaky tactics of the developers."},
{"source": "apple", "author": "68remm", "content": "Een leuke manier om een taal te leren\nZonder dat er druk op staat.\nDit is wel de voornaamste reden dat voor deze app gekozen heb .ik kan overal leren\nAls ik even tijd over heb. Thuis of op het werk"},
{"source": "apple", "author": "Lotje 🎀", "content": "Het is heel leerzaam maar ik vind die reclames van super Duolingo wel Weerd en die AI stemmen vind ik ook heel raar maar verder ⭐️⭐️⭐️⭐️⭐️"},
{"source": "apple", "author": "SFDCyclist", "content": "I miss the old Duolingo, where you were not incessantly bombarded with offers to subscribe for premium. I guess that’s what you get with a public traded company though."},
{"source": "apple", "author": "Manu pluis", "content": "Ik kan zo vloeiend mijn talen leren en op Juliana’s school leer ik ook makkelijker"},
{"source": "apple", "author": "Levens duolingo", "content": "Ik geef het 3 sterren omdat ik het leuk vind maar ik vind dat de energie weg mag dat is gewoon niet leuk je kan dan maar ongeveer 1 les per dag doen"},
{"source": "apple", "author": "Eva.Kromkamp", "content": "Je leert het snel,en ik het vind vogeltje het lief kijken.ik leer Spaans aqua,water en zo kan ik maar door gaan.en alles binnen 4dagen."},
{"source": "apple", "author": "WoefWoef345", "content": "Er is een nieuwe update met dat je nu energie hebt in plaats van hartjes. Door die energie kan ik maar maximaal 3-4 lessen doen. Soms wil ik wel wat meer leren, maar dat kan dan weer niet omdat ik dan te weinig energie heb. Met die hartjes van vroeger kon je veel meer lessen doen en ik wil ook Duolingo graag blijven doen, maar ik wil dan niet geld uitgeven aan Super bijvoorbeeld om gewoon meer energie te hebben. Ik wil dan niet alleen Super kopen om alleen de meer energie te hebben. Dan wilt Duolingo dat we zijn app gebruiken, maar geeft ons minder de mogelijkheid om het te gebruiken. Haalt de lol er wel van af. Jammer."},
{"source": "apple", "author": "Bartur_fishing", "content": ":)"},
{"source": "apple", "author": "J.K.S.P.M.L", "content": "Leuke app, maar soms moet je zelf dingen typen zoals namen van mensen. Daar leer je natuurlijk niks van."},
{"source": "apple", "author": "Dyuekwbdicke surlebswoleuapekw", "content": "Het is heel erg leuk Duolingo maar soms moet je wachten voordat je weer kan spelen en dat is jammer en de abonnementen zijn hier best dief voor een jaar dus dat is mij tip de abonnementen goedkoper maken maar jullie zijn. Ook een bedrijf en jullie moeten ook gwn geld verdienen maar dat is mijn enige tip die ik heb voor de rest is Duolingo heel handig heel mitigerend en heel leuk."},
{"source": "apple", "author": "Pizza AC", "content": "Te vaak slechte vertalingen en advertenties die niet weggaan!"},
{"source": "apple", "author": "THOMAS123-", "content": "I got a one week free trail I Only accepted because i would be notified. But I didnt got notified. And then they took money of for the whole year. So I texted Duolingo and then the AI assistent replied with the problem and the Only solution was to connect with Apple so I did that, and I got my money back right away. But I would maybe get that you would take money of for a month but not for a whole year… So be aware when taking a free trial."},
{"source": "apple", "author": "Wies2504", "content": "Heerlijk om bijna elke dag weer wat te leren. Eigen tempo is erg fijn. Pushen wel erg om over te gaan op betaalde versie. Dat is jammer."},
{"source": "apple", "author": "Alex bezakt", "content": "Я хочу изучать Нидерланды язык на Русском , когда я смогу это сделать ?"},
{"source": "apple", "author": "Duolingo fan 2025", "content": "Ik ben begonnen 2 augustus met Spaans en nu is het 13 oktober en ik kan al vloeiend Spaans dit is de beste taal app als je een taal wilt leren in raad het echt aan!!!!!!!!!!!❤️"},
{"source": "apple", "author": "Xantippe75", "content": "Dat er steeds meer irritante reclame komt is één ding maar keer op keer dezelfde reclame is tenenkrommend😡"},
{"source": "apple", "author": "André Bonkie", "content": "Duolingo heel erg leuk en leerzaam om te spelen , talen - rekenen - muziek je kan er je lol mee op, ik geniet er dagelijks van."},
{"source": "apple", "author": "Tippie lees het", "content": "Ik vind dat je op Duolingo snep en makkelijk leert allen is er een probleem je weet niet of je nu super Duolingo hebt ik wil het niet maar zo gedraagt Duolingo zich wel maar ik wil geen geld eraan uitgeven dus let goed op of je we of geen geld uit wil genen (tip het zit voor album de reclame) 🤨"},
{"source": "apple", "author": "Jeadyelle11", "content": "Je leert echt elke taal je wilt ik ben bezig met Spaans en ik kan nu al bestellen in een koffie bedrijf dus por favor download het nu en por favor zoek op wat het in het Spaans betekent chao"},
{"source": "apple", "author": "Wassie3", "content": "Since the energy function the app is really bad You sometimes can’t even do a single lesson making a fault is not allowed then you need to wait till your energy level is back up and try again a few hours later. It’s so bad for learning the function totally killed app."},
{"source": "apple", "author": "Cococoocococck", "content": "Het is best leuk en je leert de taal snel"},
{"source": "apple", "author": "Braaapaaap", "content": "Al die nutteloze animaties van die luister oefeningen, die kosten me hele veel tijd. Je wacht een derde van je leven. Op stoplichten, anderen. Ik wil die stomme herhalende animaties kunnen skippen als ik betaal. Only fair."},
{"source": "apple", "author": "Ghdvjyc", "content": "This app does nothing for people with repetitive strain injury to ease the use: there is no way to give an answer by speech, each individual word has to be selected manually, resulting in lots of clicks. Then there are all the screens that get shown to you after each lesson, which you have to wait for and click through, even if you have plus membership like I do. This is super annoying as I’m not interested in all the points and challenges they bombard you with. I was hoping for an option to skip all that nonsense, but alas even with a paid membership I get so much spam. Then there is the lessons themselves, they are extremely repetitive, even if you find the patience to get into the higher levels and even if you consistently score an average of 99% correct: the app doesn’t recognise its too easy for you so you’re stuck learning at a level which is way too easy (and repetitive)."},
{"source": "apple", "author": "Cato de poepan", "content": "Sorry hoor maar die energie die hartjes vervangt slaat nergens op ik wil de hartjes terug. En ik denk dat de app oprecht beter wordt als ze gramma uitleggen zoals bijvoorbeeld bij duits naamvallen enzo"},
{"source": "apple", "author": "The Stump Jump", "content": "Everyday I enjoy Duo for learning French. Allready for 1275 days now. Thank you!"},
{"source": "apple", "author": "Bugs1986", "content": "Erg leuk en leerzaam Spaans leren. Iedere dag zo'n 10-15 min"},
{"source": "apple", "author": "Je@moeder", "content": "Heel leuk en handig voor wiskunde en talen"},
{"source": "apple", "author": "gewoon een man", "content": "En heel tof…. Hopelijk kan ik binnenkort echt gaan schaken!"},
{"source": "apple", "author": "Sarckwolf17", "content": "Het is erg leerzaam en ook nog leuk erg goet"},
{"source": "apple", "author": "berninl", "content": "Ik leer de taal maar dat drammen - neem Max, Neem familie, nodig je vrienden uit - is echt irritant."},
{"source": "apple", "author": "Lillylove335", "content": "Ik vind het een erg leuke app, maar ze vragen echt om de 5 opdrachten om duolingo super te kopen"},
{"source": "apple", "author": "LaPeeBetooo", "content": "Duolingo heeft me echt geholpen mijn frans te verbeteren! Au revoir ❤️"},
{"source": "apple", "author": "Ikerbetgi", "content": "Beeeeeesssssttttttt game ever"},
{"source": "apple", "author": "Het is mij die zegt:", "content": "Het is echt een spelletje. Je moet echt heel lang spelen, voordat je iets geleerd heb. Wat mij betreft zit er veel te veel herhaling in. Het programma heeft niet door als je iets heel makkelijk vind"},
{"source": "apple", "author": "Heoeienneleosocoxkh", "content": "marketing is getting obnoxious. no one needs or cares about the “lore” of the bird. the new energy update is one of the worst updates every produced by duolingo including the learning paths update a while ago. this is just a cash grab it disincentivizes free users from making progress and encourages them to pay. duolingo is no longer on the “mission” to make language learning free. plus the lessons aren’t applicable. random words and sentences do not help to learn a language. go to a different app. there are more effective ones"},
{"source": "apple", "author": "ikke johnny", "content": "Is leuk om te doen"},
{"source": "apple", "author": "imoan2001", "content": "Ik had graag als nederlands sprekende ook grieks willen leren helaas kan ik deze optie niet vinden vanuit het nederlands?"},
{"source": "apple", "author": "Denenes2005", "content": "Jammer dat het niet in het Nederlands is"},
{"source": "apple", "author": "Ekasuisthebest", "content": "Wow I never had a app better then this for learning,keep the work duo"},
{"source": "apple", "author": "Arwen Hardeman", "content": "Ik speel het elke dag het super leuk!"},
{"source": "apple", "author": "WaldaG", "content": "Heel irritant dat de hartjes zijn vervangen door energy’s en deze ook aftellen wanneer je geen fouten maakt. Ik overweeg te stoppen met Duolingo."},
{"source": "apple", "author": "YourLocalAdam", "content": "I really like this app because it’s designed very good and it’s so easy to learn languages definitely get this"},
{"source": "apple", "author": "Noedinoblox", "content": "Ik vind het wel fijn als ik net wakker ben dat ik even Engels ga leren ook al leer ik in groep 5 al Engels maar die weet ik allemaal al! 🫠"},
{"source": "apple", "author": "12@#hfxvbuyigsuggdkg2", "content": "I like this app but the energy is just annoying."},
{"source": "apple", "author": "Lot Vanthoor", "content": "Je kan het heel makkelijk leren"},
{"source": "apple", "author": "MONSTIEZ4EVER!💜", "content": "Ik dacht dat je geen advertenties zou krijgen. Dus wel! En dwing me alsjeblieft niet om dat gratis super voorproefje waar je uiteindelijk toch voor moet betalen"},
{"source": "apple", "author": "Leukste Berner", "content": "Heel leuk voeg evenementen toe"},
{"source": "apple", "author": "Mspaansv", "content": "Perfect vooral omdat ik graag deze talen wil leren en later in Spanje wil gaan wonen"},
{"source": "apple", "author": "67    .", "content": "Ik krijg in één n dag 11 pushberichten"},
{"source": "apple", "author": "Oliver4fannnnnnnn", "content": "Ik kon echt geen Frans maar nu ben ik echt goed Duolingo heeft me fantastisch geholpen en ik zal het zeker aanraden aan mensen die een taal willen leren spreken"},
{"source": "apple", "author": "snoek58", "content": "Het is plezierig om te doen en je gaat goed vooruit."},
{"source": "apple", "author": "evnevnevnevnevn", "content": "What started as an amazing app for learning new languages for free (with advertisements) has fallen down to an AI-generated app, that is only playable with a subscription. Instead of connecting people through languages, it separates them through the use of AI and money. Shame."},
{"source": "apple", "author": "Mimi2010:)", "content": "Perfect om te downloaden het leert je ook echt goed het helpt je heel goed ook zonder te betalen"},
{"source": "apple", "author": "Micuitalmere", "content": "Het is een prachtige app, maar het is zo jammer dat je na het betalen van de Pro-versie (107 euro per jaar) toch nog steeds wordt geconfronteerd met pogingen om extra geld uit je te halen. Wees vanaf het begin gewoon duidelijk over alle kosten. Het is frustrerend wanneer een les halverwege wordt afgebroken omdat je niet wilt betalen voor extra punten.\n\nIk neem mijn lessen serieus en wil me kunnen concentreren op leren, niet op reclame of slimme trucs om me meer te laten betalen. Als jullie meteen duidelijk hadden aangegeven wat het maximale pakket inhoudt, had ik dat waarschijnlijk direct genomen. Maar nu heb ik het gevoel dat zelfs bij een upgrade er weer nieuwe banners en betaalopties opduiken.\n\nNogmaals: een prachtige app — maar het voortdurende gevoel dat er telkens iets extra’s uit je wordt getrokken, is echt jammer."},
{"source": "apple", "author": "Paulus_chabo", "content": "Best leuk appje jammer alleen dat sommige zinnen letterlijk vertaald zijn uit het Engels waardoor het raar klinkt"},
{"source": "apple", "author": "Beebee Dapperen", "content": "Alles!\nDe opbouw en presentatie.\nHet leert heel makkelijk!\n\nZoals op tijd even een paar herhalingen. Ik vermaak me kostelijk met de leraren/leraressen. Mijn favoriet is het uiltje.\nOok de uitdagingen die je krijgt. En de variatie. Van schrijven, tot uitspraak en paren combineren etc…\n\nMijn complimenten voor het programma! Het technische gebeuren, software.\n\nMile grazie!"},
{"source": "apple", "author": "ertgdjfnfubrtrtrtyydhgjfo", "content": "Je krijgt wel steeds reclame"},
{"source": "apple", "author": "Damarlboroman", "content": "The app went from 5 star language tool to some cash grab, wannabe premium service that no longer serves the original purpose, but nowadays fully entertains corporate greed. Feels like the average pay-to-win platform that has no principles or the old “pro bono publico” mission. Either go fully paid or remove the new energy system. As a long term user, I am deleting it and wish you luck."},
{"source": "apple", "author": "Peter Paul L", "content": "Ook met een betaalde account blijft de app storend veel reclame pop-ups sturen."},
{"source": "apple", "author": "Tkelapdoap", "content": "Amazing app! I love starting the day with Duolingo!"},
{"source": "apple", "author": "Cas Freeze", "content": "Duolingo is compleet verpest door de komst van energy. Je wordt bijna gedwongen om Duolingo plus te halen want anders kun je Max 2 lessen per dag volgen. Maximaal soms kun je ook maar 1 les maken en dan moet je weer 24 uur wachten. Duolingo is dus eigenlijk een app geworden waar je moet voor betalen. Doe hier alsjeblieft iets aan."},
{"source": "apple", "author": "joey111111119", "content": "Prima app om te leren, alleen veel te duur en gratis versie werkt ook niet omdat je na een paar oefenen niet meer verder kan dan moet je betalen"},
{"source": "apple", "author": "Ikplayergg", "content": "Fun! I only use is for chess lessons, but its useful for languages to! Pro is quite cheap, cus you can add 5 peaple"},
{"source": "apple", "author": "Airfighte900", "content": "KAPOT GOEIE"},
{"source": "apple", "author": "Speedsters 350", "content": "Superleuk je kunt er heel veel taken op leren! Tipje: eerst was er nog geen Nederlands dus je moest een cursus in het Engels doen"},
{"source": "apple", "author": "🍟🧈🥘🧈🌮🍟🍔🍳🍳", "content": "Ik vind Duolingo leuk want ik leer Engels en het is heel leerzaam en ja ook leuk met vrienden en met die widgets echt super leuk!!!!!!!!"},
{"source": "apple", "author": "gandjkfydb vidudfyhxhdhxgfj", "content": "engels leren is leuk voor kinderen maar ook heel goed"},
{"source": "apple", "author": "🦇✨🌟", "content": "Ik vind het zelf heel fijn om er Engels mee te leren"},
{"source": "apple", "author": "Corretje54", "content": "Why with energy instead of hearts? It’s not fun anymore. You only want to earn money I think. Your energy is gone fast even if you don’t make mistakes.  If you want to learn some extra, your energy is already gone. With the hearts you could play and practice a little every day. I quit."},
{"source": "apple", "author": "🥰Sarah🥰", "content": "Het is fijn om te leren jammer dat de batterij snel op is verder is alles goed 🥰"},
{"source": "apple", "author": "Xmerelxoxo", "content": "Replaces its employee with AI and made the choice to go \"AI-first\". Shameful."},
{"source": "apple", "author": "Es Sie", "content": "Je had altijd 5 hartjes in Duolingo. 5 fouten mocht je maken. Dat is nu vervangen door een batterij. Ook al zijn je antwoorden goed, de batterij loopt snel leeg. Dit haalt het plezier helemaal weg!\nHet is wel een leuke app om met een taal bezig te zijn. Maar met deze update weet ik t niet meer"},
{"source": "apple", "author": "Hallo 10198", "content": "Dit is echt geweldig en een leuke manier van leren"},
{"source": "apple", "author": "WayTwo", "content": "Serious daily user here since 2019, My motivation to continue my streak just dropped from 100 to 0 after Duolingo decided to replace the heart system for something more aweful. Even if I complete 2 perfect lessons, I don‘t have enough energy to complete lesson 3. what were they thinking?"},
{"source": "apple", "author": "Peter de vis", "content": "Could not even do one legendary lesson with full energy. Not worth it anymore after the update"},
{"source": "apple", "author": "Mars Rob", "content": "Not sure the reason why but I noticed more and more mistakes and errors in the content: very loose translations, missing hints, grammar mistakes…"},
{"source": "apple", "author": "malpwjfijw", "content": "I used to truly enjoy this app and spend a lot of time on it. Now after the latest update it’s sadly not the case anymore, they really ruined the experience."},
{"source": "apple", "author": "Rik Slenders", "content": "Na de meest recente update is het minder geworden, verder is het een super goede app en heel leerzaam"},
{"source": "apple", "author": "Femketh", "content": "Er verandert steeds iets waardoor DuoLingo hoopt dat je aan het betaalde abonnement gaat, zo is de uitleg helemaal weg. Ook is het hartje verandert in energie waardoor je nog maar 2-3 lessen per keer kunt doen, terwijl ik eerder oneindig veel lessen op een dag deed.\nDe volgorde van wat je leert is ook niet de meest logisch, als je bedenkt wat je in praktijk zou willen kunnen zeggen.\nDaarnaast zijn de Nederlandse vertalingen duidelijk niet door een (Nederlands) persoon gemaakt. El abrigo negro = de zwarte jas, maar wordt vertaald als ‘de negerjas’, echt belachelijk.\nAls je Spaans wilt leren om echt in de praktijk te gebruiken, zou ik voor een andere app gaan. Dat ga ik ook doen."},
{"source": "apple", "author": "All do CJ kennen", "content": "The sentence you learn are useless. Please make real useful everyday communication sentences"},
{"source": "apple", "author": "M.Prins", "content": "Hartjes terug"},
{"source": "apple", "author": "Goed😁😍😍😍😆😍😍😁", "content": "Duolingo is een goede app"},
{"source": "apple", "author": "HermanGüring", "content": "Its a shame they went from hearts to energy, just another etep to make you watch adds so they can profit"},
{"source": "apple", "author": "Anne &arco", "content": "Leuk en leerzaam"},
{"source": "apple", "author": "Wak6817", "content": "I am doing Duolingo math course and I LOVE it because it has math puzzles"},
{"source": "apple", "author": "Luuureesduufhr", "content": "Ik kan geen Engels en nu wel super fijn alleen de reclames voor super zijn irritant"},
{"source": "apple", "author": "Harrie vanhet Hof", "content": "Je leert op een leuke manier een vreemde taal. Duolingo motiveert maar is ook vaak ongeduldig"},
{"source": "apple", "author": "Jasmijn321!", "content": "Ik kan nu al een beetje Engels voor de mensen die twijfelen je moet het gewoon doen want het is een app die in verschillende manieren je verschillende soorten taal kan leren deze app ik een aanrader nee je moet het gewoon nemen het is een geweldige app"},
{"source": "apple", "author": "ijsklomp", "content": "Ik geef maar 1 ster, wat is dit voor iets vreselijks. 7 jaar leer ik al maar dit is vreselijk ik kan 1 les doen en dan energie op. Heb je genoeg energie is de tijd alweer om dubbel of driedubbel te spelen. Zo slecht !!!! Bestaat alleen nog uit lange reclame"},
{"source": "apple", "author": "Saarelaar", "content": "Ik vind het heel leerzaam en leuk alleen vind ik het jammer dat je energie naar een les al op gaat ik wil gewoon altijd verder."},
{"source": "apple", "author": "frle10", "content": "The app is clearly being updated and taken care of. I like it and it’s fun and the family plan is affordable and great to use. I do think they are supposed to focus on languages more than math, music and chess. However, those seem to be getting them money right now as people seem to really like chess on Duolingo. I just think they should innovate in language learning."},
{"source": "apple", "author": "Kwallmark", "content": "Erg leuk en doeltreffend. Maar zeker voor de onbetaalde versie niet super veel variatie en geen grammatica…"},
{"source": "apple", "author": "Disaappointed, not surprised", "content": "Despite showering you while playing with claims about users starting to speak quickly or performing great, they respond in the end that it was only meant to give people confidence that they can learn a language, and not that they teach a language. Which it does not do. Just a game."},
{"source": "apple", "author": "???[", "content": "Duolingo is heel goed in taalessen je leert bijvoorbeeld Italiaans en zelfs Chinees en je kunt ook muziekles en wiskunde leren"},
{"source": "apple", "author": "Kareltje1993", "content": "Gebruik het nu duidelijk minder"},
{"source": "apple", "author": "Loraine cool", "content": "Heellllll leukkkkkkkkk en leerzaam"},
{"source": "apple", "author": "Kürt oğlu Kürt", "content": "Türkçe- Hollandaca ve Kürtçe neden yok?"},
{"source": "apple", "author": "Gnjoooo", "content": "Geweldig ik kan veel beter Italiaans"},
{"source": "apple", "author": "Єва баришевска", "content": "You see, l like Duolingo and learning but I only got Emails about Duolingo and it has adds every time you complete a lesson. But I still like it because it’s not that bad. I don’t want to o  pay for better learning on a phone.                                WHAT i LIKE i like that you still can learn a language and you have also learning games. And off course I can learn a language one or two or even three different languages :₴@()₴!?)?;₴”;:?)& rhsbdnenenenenenenenenenenenenenenenenenenenenrnrnrnrnendndjdjf( just doing something weird) : and also you have energy and you can do only 4-5 lessons"},
{"source": "apple", "author": "PsgDaani", "content": "4"},
{"source": "apple", "author": "Cocoa52NL", "content": "Erg leuk, je wilt blijven oefenen als je fouten maakt doe je die opnieuw en als het makkelijk is krijg je moeilijkere oefeningen! Echt leuk leren"},
{"source": "apple", "author": "PolitieMaxim", "content": "Leuke app om Engels te leren of andere talen, mijn opa gebruikt het ook."},
{"source": "apple", "author": "Wwwwwwwwwwoooooooooow", "content": "Het is een super educatieve en entertaining app. Je leert een hoop in een korte tijd en het plezier gaat er niet af! Zeker een aanrader!"},
{"source": "apple", "author": "Willem1998-", "content": "Enorme woke propaganda geworden. Zonde.. ik wil een taal leren en geen politieke agenda opgedrongen krijgen."},
{"source": "apple", "author": "Gautam K", "content": "Ads have gotten out of hand. It used to be fun but it’s unusable now."},
{"source": "apple", "author": "Jk😌", "content": "Ik vindt dit een fijne leerzame app ik leer Spaans zonder basis met deze app wordt ik er steeds beter in!"},
{"source": "apple", "author": "Anniek_75", "content": "De vertaling heeft vaak fouten en er is geen uitleg van de grammatica"},
{"source": "apple", "author": "Elliffokin", "content": "Çok teşekkür ederim ☺️ okulda senin sayende her şeyi hallettim💗"},
{"source": "apple", "author": "Brokpok", "content": "Goeeeeeeeeeeeeeeeed"},
{"source": "apple", "author": "Mysterieuze panda", "content": "Het is zo leuk ik keer maar tegelijk zit ik ook te genieten!"},
{"source": "apple", "author": "Floormaes", "content": "Echt heel fijn ik liep heel erg achter op school maar nu loop ik op het goede niveau"},
{"source": "apple", "author": "Kensitje", "content": "Je leert zonder geld kan je je eigen taal leren en muziek en wiskunde zonder geld alleen heel veel reclame over super Duolingo"},
{"source": "apple", "author": "Het beste spel!!!!!!!!", "content": "Dit spel is perfect voor als je een nieuwe taal wil leren ik oefen nu al 2 dagen en ik begin er nu al goed in te worden!."},
{"source": "apple", "author": "Mik ka do", "content": "Wat een vreselijke depressieve Lisa !!!!!"},
{"source": "apple", "author": "Rubinvh", "content": "No Persian while it’s one of the oldest languages around plus more than 300milion are speaking it around the world."},
{"source": "apple", "author": "Ghaasjes", "content": "Goede app die je helpt met consequent doorleren. Duolingo vogeltje kan nogal dwingend en agressief worden als je niet op tijd oefent. Is wel grappig en irritant."},
{"source": "apple", "author": "Tyanna van Damme", "content": "Ik kan hier door bijna Duits praten"},
{"source": "apple", "author": "willy de crocodil", "content": "Ik geef 3 sterren want ik word steeds geappt door due lingo en dat is irritant"},
{"source": "apple", "author": "Duits2", "content": "Jammer dat er geen grammatica is."},
{"source": "apple", "author": "WeedForSleep", "content": "My sister already has access few months ago, when can I find chess in my Duolingo???"},
{"source": "apple", "author": "Wordterblijvan.nl", "content": "Leuke en simpele manier om een taal te leren alleen wel duur als je meer dan 3 keer per dag wilt leren"},
{"source": "apple", "author": "Secret Cinema", "content": "Feels like playing a game, keeps you interested and helps your learning process. Not sure how they will implement the writing process, but so far it’s been great."},
{"source": "apple", "author": "yassqueeneeeeee", "content": "So i downloaded this app to learn chess and an very good language je mama doma. Its sooooo good especially chess ! YASS QUEEN. so i recommend this app very much. QUEEN OUT."},
{"source": "apple", "author": "Bramhut", "content": "Unfortunately Duolingo recently introduced the energy system, making it impossible to do more than 1 or 2 lessons a day (<10min of learning) without paying\nReally sad to see this change…"},
{"source": "apple", "author": "Myra_oiia", "content": "Ik vind duolingo een goede manier om te oefenen op Frans, Duits, Spaans en wiskunde maar het is moeilijk om de energie niet kwijt te raken.\nOok snapte ik niets van wiskunde…"},
{"source": "apple", "author": "joja59", "content": "Ik vind de prijs voor Max erg hoog"},
{"source": "apple", "author": "Hrokok", "content": "Ik geef Duolingo vijf sterren omdat je er van leert en het is leuk dus als je een taal wil leren of op vakantie gaat naar buitenland speel dan vooral Duolingo"},
{"source": "apple", "author": "Dancing conga", "content": "I want to learn Turkish so I downloaded duo now he’s trying to get me cus I didn’t do my lesson"},
{"source": "apple", "author": "Bex Chaveiro", "content": "Can you maybe change that we don’t use energy cus then I can just keep going. Thank you"},
{"source": "apple", "author": "Ani tchintcharauli", "content": "Duo lingo is amazing! It can learn you every language you want! Im am learning french now and i learn like je voudrais un croissant. That means i would like a croissant thats why you need to downoad duo lino"},
{"source": "apple", "author": "IDKANONIEMGUY", "content": "我是荷蘭人。我正在寫這！謝謝， Duolingo！"},
{"source": "apple", "author": "🦞🦣🐊🐅🦞🐊🐬🐅🦕🐬🐅", "content": "Echt heel leerzaam"},
{"source": "apple", "author": "WendyVliegt", "content": "In het verleden had je bij Duolingo hartjes. Elke fout was een hartje minder. Nu heb je energie. Die je ook kwijt raakt als je alles goed hebt! Nu kun je dus alleen meerdere lessen op een dag volgen als je Super aanschaft. Echt irritant. Ik begreep dat het een test was, nou bij deze: test NIET succesvol. Terug naar de hartjes graag!"},
{"source": "apple", "author": "-=dzdz=-", "content": "They fixed dictionary and now I can study mote thn 5 same words. Bt now it is super haaaaaarrrrd to close commercials"},
{"source": "apple", "author": "Aroz Messi", "content": "You learn so good"},
{"source": "apple", "author": "Eerlijk zeggen", "content": "Sinds het nieuwe systeem met de energie meter ipv de hartjes is het gebruik van de app zeer demotiverend. Van 5 sterren naar 1 ster maximaal."},
{"source": "apple", "author": "Jeynep 15", "content": "Cok güzel ama tek sorun bu uygulama çok güzel \nOlmuş benlik"},
{"source": "apple", "author": "1,2,3,4,5,6,7,8,910", "content": "Het helpt je extra met alle talen beter kan niet! Maar misschien moet je soms een beetje betalen als je een abonnement hebt!"},
{"source": "apple", "author": "Hmgrgmjugfdgnmmjhbcserujj", "content": "Ik heb Engels super snel geleerd maar dan ook super snel dus ja dat is goed maar het svhtijven van Engels is nog een beetje moeilijk maar ik durf Engels te spreken maar het enige nadeel is dat er na elke les die ik doe krijg ik een super abonnement reclame en ik word er geïrriteerd van!"},
{"source": "apple", "author": "Neymarlocoloco", "content": "Ik kan nu beter Frans door Duolingo"},
{"source": "apple", "author": "Kleinerat40", "content": "Leuke app met makkelijke oefeningen in het spaans. Alleen irritant dat je altijd meldingen krijgt voor het oefenen. Voor de rest, top app!!"},
{"source": "apple", "author": "Fauve pel", "content": "Het is super leuk je kan er op een leuke manier taal leren en ik vind het super leuk daarom ga ik misschien ook wel super duo Lingo doen alleen ik vind die batterij een beetje onhandig want dan kan je in een keer niet meer doorspelen maat nog steeds is het super leuk"},
{"source": "apple", "author": "Balotte12345", "content": "Duolingo is heel leuk en leerzaam en het helpt me ook met Engels op school, want dat vind ik heel lastig.👍🥳❤️🥰😙"},
{"source": "apple", "author": "Geen score", "content": "Ik vind het te volgepropt met score punten, ik wil de taal beter leren en ben niet geïnteresseerd in punten."},
{"source": "apple", "author": "mrm81", "content": "Even if i don’t make any mistakes i can do a max of three lessons with the new energy system. Bring back the hearts system."},
{"source": "apple", "author": "Kolotshjrjwjwjevrhw", "content": "The energy system is the most in motivating system I know, even worse than the hearts!"},
{"source": "apple", "author": "unicorn 911", "content": "De app is goed voor vakantie woorden maar niet als je de taal wil spreken als je daar gaat werken"},
{"source": "apple", "author": "two_legs", "content": "With every update it forces you to buy/get Super- or Max account. It’s getting harder and harder to practice with a free account, especially the last update with energy instead of hearts. Sucks!"},
{"source": "apple", "author": "it removed automatic idiots", "content": "Die energie rotzooi is echt niet goed kan niet eens 1,5 les maken omdat je meer energie nodig hebt het is op die manier toch geen leren"},
{"source": "apple", "author": "JHMPS", "content": "Handige App om tussendoor (als beginner) enig Spaans te leren. Jammer dat de App niet (gratis) continu kan worden gebruikt !"},
{"source": "apple", "author": "Jerrydekat5", "content": "Leuke manier om te leren"},
{"source": "apple", "author": "architecturian", "content": "I feel it tricked me into allowing them to take €100 out of my account, first of all. I thought they would send a reminder when the trial period would end, but I misunderstood.\nI miss structure and grammar. I also tried to repeat the first lessons but it doesn’t let me choose what to repeat. And talking to a robot just doesn’t really teach you to speak in the end, I’m afraid."},
{"source": "apple", "author": "witjanait", "content": "Bugs in speaking exercises. Words turn blue after speaking but later on in the sentence they turn grey again as if they were never spoken. Introducing new grammar concepts without any explanation, or just for a couple of exercises to never see them again. Learned vocabulary from one exercise does not come back in other exercises even though those words are relevant. Like in the section “describing belongings” the adjectives “red” and “white” are used hundreds of times, but never the words “big” and “small” from a previous section. Also the vocabulary is too limited for any real conversation. When introducing colours, why stick to only two?\nIt’s a fun way to pass the time but not to learn a new language."},
{"source": "apple", "author": "Cswdeperretjes", "content": "De app zelf is leuk en het leren maar dat je zo weinig maar kan leren op een dag als je Duolingo gratis leert. Je kan maar 25 woordjes herhalen op 1 dag en dan als het weer opgevuld wordt Ben je een hele lange tijd verder. Erg jammer ik kan zo niet goed leren voor de toetsen."},
{"source": "apple", "author": "스펜서 σπενσερ", "content": "This application can be really helpful with getting more familiar with the different writing systems and languages around the world. Also useful for expanding your vocabulary. You can practice reading, listening, speaking and typing/ drawing( e.g. for the Japanese writing systems). It helped me to get a lot of comprehensible input and build a basic understanding relatively fast and it’s quite motivating to do the daily tasks to keep your learning streak going."},
{"source": "apple", "author": "Worst update hearts vs energy", "content": "I usually am fan of Duolingo, but since they changed to energy instead of hearts I am forced to end my session mid lesson even though I made no mistakes. Worst update so far"},
{"source": "apple", "author": "Lijn2132", "content": "Zo leuk om zo een nieuwe taal te kunnen leren."},
{"source": "apple", "author": "Hebhvtyvhj", "content": "Het is leuk en heel leerzaam"},
{"source": "apple", "author": "Vinnypro16", "content": "Goed en best ik leer duits heel snel en ik Ben 8"},
{"source": "apple", "author": "Mb521996", "content": "Je mag hooguit 1 fout maken of geen wil je deze xp’s halen. De batterij wordt namelijk niet of nauwelijks aangevuld. Helaas moest ik de les afbreken, terwijl ik mega goed bezig was"},
{"source": "apple", "author": "DavissLR", "content": "Are  ai apps not better to use now"},
{"source": "apple", "author": "CP276", "content": "Quite a few of the German to Dutch translations are incorrect in Dutch"},
{"source": "apple", "author": "Blielieeeee", "content": "Super leuk,maar de reclame is super irritant en ook dat je energie steeds op is waardoor je steeds een dag moet wachten. Dat werkt niet motiverend."},
{"source": "apple", "author": "Stijn Maarten", "content": "Het is een heel goed idee om te gaan kijken naar een les en je kunt het altijd doen en je kunt ook nog een lidmaatschap afsluiten."},
{"source": "apple", "author": "daveViet", "content": "Great app for straying your Spanish. I am now almost fluent. Onto the next one! 🇦🇪"},
{"source": "apple", "author": "Kroketjes", "content": "Echt goed ,maar de energie is soms wel heel snel op en dan moet je je les stoppen dat is heel irritant.\n\nJe kan ook verschillende talen leren."},
{"source": "apple", "author": "Xftjbde", "content": "Het gaat heel langzaam omdat er zo veel herhaling is. Je batterij is ook snel leeg waardoor je niet lang kunt oefenen, alleen als je ervoor betaalt."},
{"source": "apple", "author": "Vvoidx", "content": "In chess its stupid that the things says ‘get closer to checkmate’ because you cant try other things then.Before the update is was better"},
{"source": "apple", "author": "@@@@/&:€;7:!;!:&,€!::", "content": "Ik vind Duolingo leuk maar door de energie kan je echt haast niet meer oefenen. 😭😭😭😭 De hartjes moeten weer terug komen of je moet kunnen oefenen of ads kijken voor energie want ander is het niet te doen."},
{"source": "apple", "author": "Mniedsw", "content": "The new energy update is such a downgrade. Progress is painfully slow unless you pay for Duo unlimited or watch ads that only give a tiny 3% recharge. At this point, it feels like Duolingo cares more about pushing subscriptions than helping people actually learn. I’m seriously considering moving to a proper language learning app."},
{"source": "apple", "author": "Stroop in het kanneke", "content": "Super goed"},
{"source": "apple", "author": "Puckflo", "content": "Alleen jammer dar er best veel mexiaanse woorden gebruikt worden"},
{"source": "apple", "author": "Jaap Bremer", "content": "Duolingo is an awesome app, but the new energy thingy really sucks.\nEven if you get lessons perfectly right your energy still decreases.\nI think they are doing this to basically force us to buy super Duolingo.\nPlease bring back hearts."},
{"source": "apple", "author": "Queen13BM", "content": "Y’know, this app really helped, and i had super duolingo for a long time, but that ended and i’m not buying it again for personal reasons. This new way with energy sucks, cuz you can barely do anything now. Please bring back the hearts method"},
{"source": "apple", "author": "likeToca", "content": "echt niet tof meer met al die reclame games!! niet iedereen heeft zomaar 130 euro liggen hoor!"},
{"source": "apple", "author": "Mr Qs", "content": "Je leert er echt iets van zonder uitleg"},
{"source": "apple", "author": "Ik ben een meisje ❤️", "content": "G"},
{"source": "apple", "author": "Martjuhhh", "content": "Please duolingo, i want my family back"},
{"source": "apple", "author": "Tobi V.G.", "content": "A green bird kidnapped my family after skipping one lesson."},
{"source": "apple", "author": "Beer janzen", "content": "Het help echt voor school"},
{"source": "apple", "author": "Ja 5 stèren", "content": "Het is een soort spel maar je woord niet domer"},
{"source": "apple", "author": "Player12632", "content": "Ik heb er heel goed mee kunnen mee leren voor mijn Duits maar nu er energy is maak het nog langzamer dan eerst"},
{"source": "apple", "author": "Hendrik Wn", "content": "Tip"},
{"source": "apple", "author": "Fortnite pro Sem", "content": "Ik leer heel veel Frans danks door Duolingo👍🏻"},
{"source": "apple", "author": "Bi jnaam", "content": "Je energie is te snel op waardoor je niet lang kunt leren. Zo proberen ze je over te halen om super Duolingo te kopen."},
{"source": "apple", "author": "Jules0396", "content": "Sinds dat ze geen ‘levens’ meer hebben maar een soort batterij kan je veel minder oefeningen doen. Jammer van deze ontwikkeling."},
{"source": "apple", "author": "Lotteae", "content": "Ik vond duolingo een geweldige app, deed echt super veel lessen elke dag. Nu hebben ze mijn geliefde hartjes vervangen door een beetje energie. Ik kan nu maar 3 lessen op een dag doen. Bij friend quests moet je soms een bepaald aantal lessen doen, maar met de hoeveelheid energie die ik krijg haal ik ze bijna niet, terwijl ik een friend quests streak heb van boven de 75. De nieuwe energie is niet bepaald motiverend om veel duolingo te spelen, dus niet bepaald een goede update :( jammer."},
{"source": "apple", "author": "Moe ilijk", "content": "Veel dingen zijn veel te moeilijk"},
{"source": "apple", "author": "lá best girl", "content": "I’m upset that they removed the hearts and added batteries because I am a really quick learner and I just want to continue learning more and more on 1 day but now you have to pay to do as many lessons as you want so PLEASE bring the hearts back."},
{"source": "apple", "author": "recensie 123", "content": "Horrible app. It’s impossible to use the app for more than 3 minutes without being bombarded with horrible unskippable adds. Additionally, the energy system prohibits free users from doing more than 2 lessons a day. Don’t download doulingo!!!"},
{"source": "apple", "author": "bert.smulders", "content": "De stemmen zijn blijkbaar overgenomen door AI, wat ze onecht maakt en daardoor zijn de oefeningen veel minder leuk om te doen."},
{"source": "apple", "author": "nadirbm113", "content": "I do like this app, it helped me learn Spanish a lot! But I do wanna suggest you remove the adds because they are just AI's begging you for a subscription and it really disorients me\n\nSincerely, Sam"},
{"source": "apple", "author": "Rachel woodland", "content": "Super! Bardzo polecam"},
{"source": "apple", "author": "Jssienbsjdjbd", "content": "Ik vind het zo leuk want je kunt allemaal verschillende talen leren maar soms moet je er ook voor betalen met verschillende abonnementen maar het is wel heel erg leuk!!"},
{"source": "apple", "author": "Run San Run", "content": "Spelenderwijs leren."},
{"source": "apple", "author": "Suzanneb639", "content": "Wat super is van Duo Lingo is dat je spelenderwijs een taal leert. Ze hebben het leren heel leuk gemaakt. Dat houd je gemotiveerd om het te blijven doen. Ik had niet verwacht dat ik na een lange werkdag gewoon nog zin zou hebben om een half uur te leren. Maar met Duolingo kan ik dat altijd makkelijk opbrengen. Dus dat is top. Je leert het zoals een kind het ook leert. Door veel te doen en veel te herhalen. Wel heb ik wat puntjes van feedback die het nog beter zouden maken. In de laatste versie hebben ze nog meer toeters en bellen toegevoegd. Dan komen er allerlei geluiden en aanmoedigingen dwars door je beeld heen. Dat leidt heel erg af van de mentale ruimte die je nodig hebt om te leren. Ze hadden daar altijd een leuke balans in. Maar nu is het te veel doorgeslagen, waardoor het teveel gaat afleiden. Dit vind ik echt vervelend. Tweede puntje van feedback is dat het verzamelen van punten te belangrijk wordt gemaakt. Als je echt goed wilt leren en bijvoorbeeld vaak herhaaloefeningen doet, scoor je weinig punten en dan ga je naar de demotiezone. Daarom heb je de neiging om te gaan ‘puntenjagen’. Maar daar leer je het eigenlijk niet beter van. \nOok werkt de spraakherkenning niet meer zo goed als voorheen. \nEn als laatste: je krijgt geen uitleg erbij, waardoor je sommige constructies niet snapt en echt heel vaak moet herhalen. Wat toelichting of het hele rijtje werkwoorden achter elkaar zou je begrip verhogen. Hopelijk doen ze iets met deze feedback, want de kern van Duo Lingo is heel goed."},
{"source": "apple", "author": "Lexittttrttt", "content": "Ik vind het zo leuk maar het idee van het je kan het niet echt speelen"},
{"source": "apple", "author": "timodewimo", "content": "Heel leuk hielp mij voor mijn duits"},
{"source": "apple", "author": "marit goede", "content": "Ik vind het Spaans leren wel leuk alleen je kan niet kiezen tussen om de dag dus ja ik heb niet altijd tijd"},
{"source": "apple", "author": "Kiel4207", "content": ".ik heb een proef abonnement en ga over een paar dagen over naar de betaalde versie. Ik zou nu, n et als in de betaalde versie, geen reclame meer te zien krijgen maar die zie ik helaas nog steeds (reclame voor duurdere abonnementen van Duolingo). Dit ka zomaar een reden zijn voor mij om toch niet over te gaan op de betaalde versie. Ook is het heel irritant dat ik steeds oudere van eerdere hoofdstukken te zien krijg als ik in de oefening waar ik mee bezig ben een herhaling wil doen. Moet nog maar eens goed nadenken wat ik ga doen er het abonnement.\nEen paar dagen later heb ik mijn abonnement niet in laten gaan. Naast eerder genoemde zaken kreeg ik ook nog eens niet de beloofde tijdige waarschuwing dat mijn proefabonnement af zou lopen. Het lijkt echt alleen maar om geld verdienen te gaan en niet zo zeer over service en een goed product."},
{"source": "apple", "author": "69liz", "content": "Als je binnen een bepaalde tijd woorden moet typen, dan is dat niet te doen op een telefoon. Kans dat je ernaast zit en daarmee een spelfout maakt is heel groot en dan red je het nooit binnen de tijd. Zeer frustrerend!"},
{"source": "apple", "author": "501sLegion", "content": "Ik zou graag Turks leren maar het zijn alleen de voor de hand liggen talen en geen andere keuzes, de wereld is wat groter dan alleen deze beperkte keuzes.\nIk ga nu een andere app downloaden succes met deze ik ga hem niet nog eens proberen!"},
{"source": "apple", "author": "MaikoCat", "content": "Leuke introductie,  maar een beetje lang. Het is ook geweldig vanwege de verschillende manieren om het te leren. Spreken, luisteren en vertalen. Alleen jammer dat je aan het einde van elke les een advertentie krijgt van super duolingo. Als je daar tegen kan, zeker weten downloaden"},
{"source": "apple", "author": "blabla528", "content": "Duolingo used to be a great app to gamify language learning. With the new energy system, it is however impossible to use it for more than 5 minutes at a time as a free learner."},
{"source": "apple", "author": "Stephandehaas", "content": "I can’t play chess"},
{"source": "apple", "author": "Kilometervreter2.0", "content": "Ik heb nu al meerdere lessen  gevolgd waarbij het optellen van de verdiende punten niet werkt. Als je dan een ronde kan doen om extra zo te verdienen wordt dit kansloos, omdat je nooit uitkomt. Er zijn nu al zoveel klachten. Er is een bugfix geweest, maar deze heeft helemaal niets gedaan. Dit demotiveert zo erg!"},
{"source": "apple", "author": "Black uhuru", "content": "Ik volg Italiaans! Dat gaat me redelijk goed  af! Veel herhalen om de taal te leren!"},
{"source": "apple", "author": "Signed.nl", "content": "My child was learning English untill the chess game was introduced. Screentime is enabled for games, not for learning English. Which now results in a child that chooses the game over learning English. Please remove chess from de duolingo app and make a seperate app of it. That way my kid can keep using Duolingo."},
{"source": "apple", "author": "Geen reclames meer", "content": "Erg leerzaam alleen irritante reclames"},
{"source": "apple", "author": "Adam Akani", "content": "I was playing Duolingo the I saw the energy and every chances if I had it good or wrong the energy is going down the hearts were so good please change this"},
{"source": "apple", "author": "lalalalala😘😘😘", "content": "Het is zo leuk en je kan plezier maken en ja dat is gewoon zo leuk doei"},
{"source": "apple", "author": "Geen energie balk", "content": "Het is een goede app om te leren maar 1 groot probleem is dat je energie hebt en dat je maar 2 oefeningen kan doen dit werkt natuurlijk ook niet echt in je motivatie"},
{"source": "apple", "author": "agdnn", "content": "Jammer dat het abonnement in een jaar tijd met €16 (!) is verhoogd. De gratis versie is ook niet meer wat het geweest is: je hebt nu een batterij die belachelijk snel leegloopt en daarna kun je niets meer, tenzij je een duur abonnement neemt. Heel jammer dit, het is dus totaal niet meer toegankelijk voor iedereen"},
{"source": "apple", "author": "Duo!!!!!!!!!!!!!!!!!!", "content": "Erg leerzaam! Kan het al iets beter!!"},
{"source": "apple", "author": "No longer a Duolingo fan", "content": "Atrocious junky app full of ads…lost focus on learning/education. So many bells and whistles like a pokie machine - terrible!"},
{"source": "apple", "author": "Life of Kenza", "content": "Ik vind het jammer dat je sommige dingen moet kopen en er veel reclames komen maar voor de rest is het fantastisch"},
{"source": "apple", "author": "Anoniempje1223", "content": "Met duo Lingo kan je goed andere talen leren!"},
{"source": "apple", "author": "Marbu12345", "content": "Ik heb Duolingo nu 4 dagen om Italiaans te leren. Op basis van een kleine toets werd vastgesteld dat ik in sectie 2 kon beginnen. Ging allemaal hartstikke goed, maar ik kom niet verder zonder vrienden uit te nodigen, het proefabonnement af te nemen of gewonnen ‘juwelen’ te betalen. Erg jammer want ik zit dus al 2 dagen vast in het laatste deel van sectie 2, hoofdstuk 1. Ik heb even moeten zoeken in de appstore, en uiteindelijk uitgevonden dat er verschillende versies van Duolingo zijn die vanaf €10 verkocht worden. Leer gratis een nieuwe taal gaat dus helaas niet op."},
{"source": "apple", "author": "The sprunki animator", "content": "It really helps you lurn a leaguenge"},
{"source": "apple", "author": "HvdZ", "content": "De vertaling van Frans naar Nederlands is slecht er zitten regelmatig spel- en grammaticafouten in. Dat is jammer. Ook komt het voor dat van Nederlands naar Frans niet helemaal logisch is."},
{"source": "apple", "author": "MekkieP", "content": "What a great way to learn a language!"},
{"source": "apple", "author": "Fynn love brotato", "content": "DUOLINGO IS ZO GOED VOOR LEREN JE KRIJGT MUZIEK LESSEN WISKUNDE LESSEN TAAL LESSEN EN SCHAAK LESSEN?!? 10/10 DOWNLOAD HET NUUUU!!!!"},
{"source": "apple", "author": "cigaM treB", "content": "Een leuk makkelijke manier om via kleine stapjes Italiaans te leren."},
{"source": "apple", "author": "Dutchiethebiker", "content": "Het komt regelmatig voor dat de goede antwoorden niet te kiezen zijn en er alleen fouten antwoorden als optie zijn. Wat erg jammer is is dat er geen aadacht voor de gramatica is. Terwijl juist de gramatica nodig is om het te leren en te begrijpen. Met alleen woordjes leren kom je er niet. Zonde van het geld"},
{"source": "apple", "author": "Lovelygirl🐼", "content": "Zo leuk en goedddddd"},
{"source": "apple", "author": "Roblox is erg leuk", "content": "Lilly moet weg ze demotiveert mijn lieve dochtertje ze lachte haar uit voor een spel fout Lilly is heel gemeen,boos en ze zou niet bij een app voor kleine kindertjes moeten zijn.EN DE HARTJES MOETEN TERUG (boze moeder)"},
{"source": "apple", "author": "J.oxox", "content": "Ik vind het geweldig"},
{"source": "apple", "author": "Djessle", "content": "Duo ik vind je heel leuk ik leer zo veel talen van je dank je Well"},
{"source": "apple", "author": "Pleun💗💗🫶🏻🫶🏻", "content": "Het is een super app!!!!"},
{"source": "apple", "author": "kailynnbordeaux", "content": "Het is super leuk en veel taalen opties voor kinderen ik ben zelf ook een kind en het is echt perfect goede quialiteit!"},
{"source": "apple", "author": "Wakwaka444", "content": "Ik vind het leuk"},
{"source": "apple", "author": "Bailey🤍🇧🇷", "content": "I use Duolingo to talk Brazil but also to learn math 🤍"},
{"source": "apple", "author": "\\t8yo", "content": "De leermanier is leuk maar de laatste update haat ik Ik kan maar een les je per dag doen en ik moet ok een business Reid dus het schiet nie op"},
{"source": "apple", "author": "MReij", "content": "I like Duolingo a lot, but since a few days there’s a very annoying button you have to press before starting to reply to Lily and again to send your message. It completely takes me out of the conversation and hampers my efforts to speak French. Please remove this asap as it’s really awful!"},
{"source": "apple", "author": "Lynnnnnn33", "content": "Veel reclames bij de gratis variant"},
{"source": "apple", "author": "kennapa", "content": "So much has improved in LLM and Duo’s voice is still way behind accurate pronunciation like for example Dutch. I literally picked up the wrong pronunciation after learning. \nAnd also, stop that sad face on the icon, it’s encouraging me to delete it"},
{"source": "apple", "author": "Tibmun", "content": "I sometimes cant learn 2 languages a day because of the energy battery. Please undo the update."},
{"source": "apple", "author": "acontreras13464356;)8$", "content": "I’ve used Duolingo on and off for many years now to learn a couple different languages. Decided to give it a try once more after hearing of updates… it’s never been better designed. I’m going through my hardest learning challenge now (learning Dutch as a native Spanish speaker) and actually learning  and retaining things I need to communicate in everyday settings. Kudos to the developers and linguists!!!"},
{"source": "apple", "author": "ElisaLiz0780", "content": "Make a football course to understand football 👍"},
{"source": "apple", "author": "Cathalijne de jong", "content": "Binnen een korte tijd heb je zo een vreemde taal geleerd \nDuolingo is echt een aanrader"},
{"source": "apple", "author": "Spel zooo leuk", "content": "Ik krijg elke 30 minuten een berichtje zoals ben je helemaal klaar met Engels leren  en dat vind ik zo vervelend dus ik heb het verwijderd"},
{"source": "apple", "author": "DonCorle0ne", "content": "Because you cant foresee how much energy you need for a specific lesson, you find yourself stuck right before the end without energy. It’s ludicrous and frustrating. Then just dont offer a free version, that would be more honest and transparent."},
{"source": "apple", "author": "😻✌️😁🎶🎶🎶🙈👀💁", "content": "Duolingo is super leuk omdat je ervan kunt leren"},
{"source": "apple", "author": "Iemand anders 🧐😩👩👩👩🏽", "content": "Het werkt heel goed je kan zelf je niveau kiezen en dan verder werken bij jou niveau heel erg fijn"},
{"source": "apple", "author": "Mies 26", "content": "Heel leuk om op deze manier talen te leren!"},
{"source": "apple", "author": "Geen clan", "content": "Ik heb 4 lessen Noors gedaan en ik kan nu al met mensen communiceren"},
{"source": "apple", "author": "Pazijar", "content": "Ik heb veel van geleerd"},
{"source": "apple", "author": "Vateomolíes", "content": "Batterij bij de update als je die niet hebt voltooid dan moet je iets kopen. BRENG DE OUDE TERUG"},
{"source": "apple", "author": "@niet", "content": "Wel leuk, maar jammer dat het zo drammerig gaat qua herinneringen."},
{"source": "apple", "author": "Trisch***", "content": "Weg hartjes welkom energiebar. Maar na een paar oefeningen is je energie 0. Maakt niet uit of de oefening goed of fout is. Het volledig laden duurt 24  nou bye bye Duolingo"},
{"source": "apple", "author": "Rootj24", "content": "Waarom de energie update? Is dit zodat meer mensen super willen?"},
{"source": "apple", "author": "NaëlFriekandel", "content": "Ja wel leuk soms niet zo goed aangeven"},
{"source": "apple", "author": "Djojo99", "content": "Breng alstjebliefd de hartjes/ levens weer terug, want wat is die energiebalk demotiverend zeg. Het is dat ik een ster moet geven…."},
{"source": "apple", "author": "Sonic dash is the goat", "content": "Love it it’s helping me learn italian"},
{"source": "apple", "author": "Afke123", "content": "Kan het icoontje aub weer teruggezet worden naar een neutraal of vrolijk gezicht. Wat willen jullie bereiken met een huilend icoontje?"},
{"source": "apple", "author": "Joywak1978", "content": "Ik kan nu Duits super makkelijk zoals kaffee oder tee?  Top spel"},
{"source": "apple", "author": "Bijenkorf123", "content": "Echt een super leuke app om een taal spelenderwijs te leren voor alle leeftijden geschikt wel jammer dat er na elke oefening een advertentie is maar dat drukt de pret niet!!!"},
{"source": "apple", "author": "Soundmac", "content": "After the iOS 26 upgrade the app is responding so slow that it is impossible to work with."},
{"source": "apple", "author": "Amusante 🤗", "content": "De lessen zijn zo duidelijk en leuk om te doen. Ik doe het met plezier!"},
{"source": "apple", "author": "DwtdSomebody", "content": "The new energy update is just horrible"},
{"source": "apple", "author": "Lizzy van brain", "content": "Ik vind diet een goede app, want ik vind jet some lasting en dit helpt me GOEDE APP!!!"},
{"source": "apple", "author": "Tiemezzz", "content": "Goed om een taal te leren. Ik ken al 20 nieuwe woorden op dag 1!"},
{"source": "apple", "author": "Gozer2", "content": "Kun je me alsjeblieft is een advertentie laten kijken om die batterijen te herladen anders kan ik bijna niks op Duolingo doen saaie app daardoor verander dit alsjeblieft"},
{"source": "apple", "author": "charmi3", "content": "I’ve been using Duolingo every day for more than 800 days, hoping to improve, but lately the app feels less like a learning tool and more like a money-grab.\nBefore, with the 5-heart system, if you made too many mistakes, you could practice to refill hearts and keep learning. Then they switched to watching ads to refill. Now there’s this “boost” or “energy” system: your energy decreases even when you give correct answers, and once it runs out, you either watch ads or pay—either individually for energy boosts or via subscription.\nThis doesn’t motivate me to practice or improve. It just makes using the app a hassle. I plan to keep going until 1,000 days, but after that … I’m seriously considering deleting it."},
{"source": "apple", "author": "Born in 1971", "content": "Wat een fijne app"},
{"source": "apple", "author": "Sawako<3", "content": "ITS SO LEGIT IM LEARNING KOREAN AND JAPANESEEE I love duo sm>3"},
{"source": "apple", "author": "Legendagro", "content": "Will delete the app just because if this crying icon! Do something, take it out, really, 700 days + and I am seriously thinking of quitting this app"},
{"source": "apple", "author": "Kinglion Owusu", "content": "The best language learning app"},
{"source": "apple", "author": "Liemarel", "content": "Leuke manier om een taal te leren"},
{"source": "apple", "author": "Binkiehappy", "content": "Goed"},
{"source": "apple", "author": "Smexiepexie", "content": "Als ik probeer een nieuw account te maken komt hij niet verder dan welk taal wil je oefenen echt irritant"},
{"source": "apple", "author": "Oudduo", "content": "The energy goes down randomly and wrongly all the time and is really frustrating. It feels like Duo is stealing my energy for no reasons! And the energy rewarding was also not accurately added, the actual refill of energy is also not the same as it says. Maths course is ridiculously simple, not sure if it is for adults though. Now the courses also not sharing energy. The bar changes when switching courses. All in all, the updates from hearts to energy bar is full of problems."},
{"source": "apple", "author": "Relja 2015", "content": "I can’t Erase it and I don’t want to learn anymore"},
{"source": "apple", "author": "waterinfra", "content": "Met deze app leer je echt de taal!\nSuper leuk en je kunt je zelf doelen stellen, waardoor je elke dag moet oefenen. Dikke 10 voor deze App"},
{"source": "apple", "author": "Abi Jacox", "content": "It is the best I’m learning French and nearly speak it\nBes ever!!'!!!!!!'!!!!!!!'!!!!!!!'!!!!!'!!!!!!!!!!!"},
{"source": "apple", "author": "Goed en goed koop", "content": "Wat een handige manier om een taal te leren"},
{"source": "apple", "author": "Julia schobre", "content": "Het is een leuke App, werkt goed en is heel leer zaam.Ben nNU al beter geworden👍🏻👍🏻😎"},
{"source": "apple", "author": "Geen plezier meer", "content": "Door het nieuwe systeem van het verdwijnen van energie ook al worden er geen fouten gemaakt verdwijnt bij mij alle plezier in het gebruik van Duolingo. Geef mij het systeem van de hartjes aub terug!"},
{"source": "apple", "author": "lilith1979", "content": "The app is great but the sad face logo throws me off every time!!  The sad face needs to GO!"},
{"source": "apple", "author": "ivaneekelen", "content": "Ik probeer vanaf mijn telefoon die Nederlandstalig is de Engelse versie van de Spaanse lessen te starten, maar ik kom in een loop terecht waar ik Spaans selecteer, op continue klik en dan weer Spaans moet selecteren"},
{"source": "apple", "author": "Jeffry83", "content": "Sinds de update naar energie ipv hartjes echt waardeloos. Continue bugs met het aanvullen van energie, wel diamanten inleveren maar na een vraag al weer terug naar oude aantal. Ook triple punten verlengen na behalen missie doet het iedere keer niet."},
{"source": "apple", "author": "Grumble!", "content": "I have been doing the chess course for a while. I do like it, but some of the moves made by the bot (?) are weird. I have played chess since I was a kid (not saying I am any good), but I would not have made many of the moves the bot makes."},
{"source": "apple", "author": "Betalen maar geen WiFi", "content": "Zie titel. Daarnaast mis ik grammaticale uitleg."},
{"source": "apple", "author": "😚😘🤪", "content": "Fantastisch"},
{"source": "apple", "author": "Ik wil Spaans spreken", "content": "Ik heb Spaans op school Duolingo helpt me met dingen die ik niet op school leer"},
{"source": "apple", "author": "mvg mireille", "content": "je leert snel"},
{"source": "apple", "author": "MarianArt51", "content": "Ik heb de tijd zelf opgenomen, maar jullie minuten gaan veel te snel, handige manier  om mensen te pushen toch te gaan betalen voor lessen…. Want 2 lessen per dag lukt dan vaak net niet!\nOok irritant dat ik voor de 2e keer,  als single,  erin getrapt ben, dus weer mijn (per ongeluk) aangeklikte familie abonnement op moet gaan zeggen!"},
{"source": "apple", "author": "Damian_H12345", "content": "Its very nice to learn with duolingo because you can learn with games and lessons thats why i gave it 5★"},
{"source": "apple", "author": "Zwarte druifje", "content": "Het is de beste leerzame game voor mij en mijn vrienden ⭐️⭐️⭐️⭐️⭐️✨"},
{"source": "apple", "author": "Duolingos wife꧂", "content": "Duolingo is super leuk! Ik betaal niet en toch is het fantastisch"},
{"source": "apple", "author": "AnonymousAmsterdam", "content": "I have to say I’m a big Duolingo fan but now they have removed hearts and replaced them with energy that disappears even if you get the answers correct, I won’t be using the app anymore."},
{"source": "apple", "author": "vghhccc BV bij VVD fok uvgy", "content": "Het is een goeie app. Het is wel het geeft advertenties had je niet betaald, maar dat zijn wel hun eigen advertenties en die van andere bedrijven. Maar ik vind die accu die is vervangen door de hartjes vind ik niks."},
{"source": "apple", "author": "Kookmetmij", "content": "Als je geen tijd hebt en je krijgt gelijk tranende poppetje"},
{"source": "apple", "author": "Nico19777", "content": "Since hearts were replaced by energy it’s not possible anymore to use the app seriously for people that can’t afford the paid version. Even with zero mistakes you can’t finish more than two lessons a day. Really a shame…"},
{"source": "apple", "author": "Jolly Jumper15", "content": "Dat maakt het niet leuk!"},
{"source": "apple", "author": "NinkeRoblox", "content": "Hoi, ik doe Duolingo nu al bijna een jaar en ik ben er aan verslaafd🫣 ik heb nu al een streek van 133 dagen. Duolingo is echt een aanrader als je een taal wilt leren😃. Je kan sinds kort ook muziek🎶, wiskunde📚 en schaken♟️ op Duolingo, dus er is altijd wat de doen👍🏻. Veel plezier als je het gaat downloaden 🤗👋🏻"},
{"source": "apple", "author": "Ryanvgn", "content": "Without the premium function you can barely do three lessons. Very unfortunate. Also, Chinese is very buggy and unplayable."},
{"source": "apple", "author": "hout ben", "content": "Duolingo is erg leerzaam en erg makkelijk.   \n\nPs: verander het icoon van de app het is nogal zielig"},
{"source": "apple", "author": "CuLb03", "content": "This app is the best. I have so much fun learning languages with duolingo!"},
{"source": "apple", "author": "Maud en rio zijn verliefd", "content": "Ik ga verhuizen naar sweden"},
{"source": "google", "author": "Gera de Graaf", "content": "Tot voor kort was het een fijne app. Misschien wat veel herhaling maar verder wel goed. Nu is er een nieuw systeem met 'energie' waardoor je maar beperkte tijd hebt om te leren. Hoe goed je een les ook doet. Nruim 3 jaar bijna elke dag gebruiken hou ik er nu mee op. Waardeloos systeem."},
{"source": "google", "author": "Steffanie van Herten", "content": "het is heel leuk en leerzaam ik ben nu heel goet in Duits 🇩🇪 duolingo is heel goed! zeker een dikke vette aanrader! 5 🌟"},
{"source": "google", "author": "Ward Engelen", "content": "algemeen een goede app om van alles te leren. het energie systeem is wel stom"},
{"source": "google", "author": "Hii. po", "content": "why can i see random people in my feed? i dont want to see them, only my friends. And i dont want others to see my stuff. please change if back otherwise i will cancel my subscription."},
{"source": "google", "author": "Gwoon Jelte!", "content": "I used to love Duolingo - I have a 1300 day streak - but this recent 'energy' update just sucks man. Losing 7-8 energy per lesson while only gaining 5 by watching an ad is awful. It feels like I'm getting discouraged from learning a language. On a language learning app. Sure. Point is, this sucks. Unless Duolingo either reverts the recent changes or improves the energy system (full energy when watching a video, less energy used per lesson?), I will begrudgingly keep going, but only for my streak"},
{"source": "google", "author": "Irene Victoria Pleiter", "content": "Ik had het niet perse verwacht, maar door dit elke dag te doen de afgelopen 65 dagen, leer ik hetgeen me eerder niet lukte te leren, (vooral omdat ik de aandacht er niet bij kon houden) en dat is het toepassen van de juiste werkwoordsvormen in het Spaans. En tegelijk leer ik langzaam de basis van het opbouwen van zinnen. ik merk dat het steeds een stukje meer vanuit mezelf komt. Door heel veel herhaling en goede opbouw van kleine beetjes bijleren. Laagdrempelig in spreektaal. ❤️"},
{"source": "google", "author": "Naol Nao", "content": "ik leer echt veel"},
{"source": "google", "author": "Lef van der Burg", "content": "heel leuk echt toppie"},
{"source": "google", "author": "antoinette lazova", "content": "I miss the grammar, sometimes the sentences you have to translate are quite weird, but if you practice daily you can still learn a lot."},
{"source": "google", "author": "Yana Wyckers", "content": "normaal vind ik talen leren stom maar met Duolingo maakt het alles leuker en gemakkelijker en ik leer ook meer Groeten, Lysander552"},
{"source": "google", "author": "Peter Tuytschaever", "content": "prachtige manier om een nieuwe taal te leren."},
{"source": "google", "author": "Olivier Vervaet", "content": "heel leuke oefeningen om te beginnen met Spaans. Helaas veel te veel herhalingen met steeds dezelfde woorden."},
{"source": "google", "author": "Laia Ruitenberg", "content": "leuke app ik speel piano en dat is echt een aanrader het is snel leuk en makkelijk"},
{"source": "google", "author": "Remco Willemse", "content": "très amusante"},
{"source": "google", "author": "Melissa Carton", "content": "dit is super"},
{"source": "google", "author": "Dream Max", "content": "je kan echt goed leren"},
{"source": "google", "author": "Kelsey", "content": "super goed en je leert er heel goed van"},
{"source": "google", "author": "T. Fisher", "content": "since there are no hearts, but \"energy\" it's not fun to learn anymore.... The energy drains waaaay to fast. Therefore it's not rewarding to learn anymore... Very disappointing"},
{"source": "google", "author": "Frederic V", "content": "Motivating!"},
{"source": "google", "author": "Bianca vdM", "content": "helaas werkt de NED-ITA niet goed. bijvoorbeeld met de woorden cornetto-croissant en gelato-ijs. Verder leuke app en goed te leren"},
{"source": "google", "author": "Evie", "content": "It has too many ads."},
{"source": "google", "author": "Anita Vos", "content": "heel goed"},
{"source": "google", "author": "Debbie Isendoorn", "content": "Het spel is te leuk!en je leert er veel van bijvoorbeeld:je leert er verschillende talen van!"},
{"source": "google", "author": "jay lin", "content": "het is echt leuk"},
{"source": "google", "author": "Sharon Bakker", "content": "je kan bijna niet stoppen met leren"},
{"source": "google", "author": "Stijn Otten - Van Beest", "content": "it is amising"},
{"source": "google", "author": "Lenne Luyten", "content": "heel goed, maar levens graken op bij moeilijke talen."},
{"source": "google", "author": "Ella Peijnenborg", "content": "bedankt voor wiskunde je hebt mijn leven gered."},
{"source": "google", "author": "Brenda Schröder", "content": "prima app hoe wel ik soms namen moet ttpen van het frans naar het nederlands"},
{"source": "google", "author": "Bloem Pje", "content": "waardeloos nieuw energy systeem. sterk demotiverend terwijl het zo'n unieke app was. Ik heb er meerdere talen mee onder knie gekregen, met de gratis versie, dus wel veel advertenties kijken. Erg zonde. Het uitgangspunt van de bedenkers van duolingo was zo mooi en idealistisch, iedereen ter wereld rijk of arm zou toegang moeten hebben tot onderwijs en het leren van talen. Dat hebben met deze nieuwe versie te niet gedaan. Jammer!"},
{"source": "google", "author": "Silvia Pilzecker", "content": "Un tè uitspraak is steeds verkeerd Ik heb zelfs het origineel opgenomen en afgespeeld maar hij rekent het niet goed Italiaanse les nu 2maanden later geen antwoord en het gaat nog steeds niet goed erg slecht dit!!!!!"},
{"source": "google", "author": "Miranda Heus", "content": "het is leuk en leerzaam, het liefste leer je lekker door, alleen jammer dat dat vrij duur is en niet per maand betaald kan worden"},
{"source": "google", "author": "Paul Wolf", "content": "Ik ga op zoek naar een andere app om mijn Spaans verder te leren. Met de hartjes was het leuk om de taal te leren, nu met de energie moet ik na 1 les al stoppen ook al maakte ik geen fouten. Heel jammer !!"},
{"source": "google", "author": "Sofie Van Elewyck", "content": "love the learning hate the energy bar"},
{"source": "google", "author": "marianne van bijnen", "content": "de lessen zijn heel fijn"},
{"source": "google", "author": "Rudy Veirman", "content": "Fijne app die je motiveert om elke dag bij te leren."},
{"source": "google", "author": "Jacqueline Blom", "content": "leuke app maar met veel fouten. geluid is slecht en als je iets inspreekt rekent de app het fout. terwijl het antwoord wel goed is hartjes zijn weg nu energie, vind het geen vooruitgang . kan nu maar 1 les maken en dan weer wachten tot de energie vol is. echt irritant."},
{"source": "google", "author": "Caroline", "content": "sinds AI zitten er wel heel veel fouten in de (Nederlandse spelling) ,ook de energie ipv 5 fouten is waardeloos"},
{"source": "google", "author": "Wim Noorlander", "content": "super werkt verslavend en erg leerzaam"},
{"source": "google", "author": "Teuna de Jong", "content": "leerzaam"},
{"source": "google", "author": "FJ Strad", "content": "was okay with the hearts, energy is just terrible"},
{"source": "google", "author": "Wendy", "content": "Ik wil eigenlijk 3 of 4 doen vanwege 't nieuwe systeem maar ik doe toch 1 ster. Daar waar je eerst met de hartjes gewoon door kon spelen zoveel lessen je wilde (zonder fouten of max 5) kan je nu amper 3 foutloze lessen doen zonder verder te kunnen.... Verschrikkelijk!! Deze manier met energy ipv hartjes is echt geen goede keuze geweest en dwingt tot een dure abbonement! Het weerhoud mij juist om met de app verder te gaan terwijl ik het juist altijd met veel plezier \"leerde\"."},
{"source": "google", "author": "Huggy Wuggy", "content": "Echt goed hoor je kan alle talen leeren wel jammer dat het best moeilijk is om hartjes te krijgen 500 diamanden of 1 hele les voor 1 hartje of 1 uur wachten"},
{"source": "google", "author": "Florijn Nonnekes", "content": "leuk maar irritant"},
{"source": "google", "author": "Djilano Klooster", "content": "hele leuke taal Leerweg"},
{"source": "google", "author": "Mariella Lammerse", "content": "een erg leuke en leerzame app om aan je taal te werken, je kan het overal doen."},
{"source": "google", "author": "Angelique Ter Smitten", "content": "mijn turks is stukken beter geworden door mijn dagelijkse lessen"},
{"source": "google", "author": "Tom Spanjaard", "content": "since the new update with the energy bar instead of the hearts, its pretty annoying to use and finish classes... for the rest is build up of the app great to learn a new language"},
{"source": "google", "author": "Luuk Domhof", "content": "The interactions, animation and polish in this app are amazing. Some translations seem questionable, but it's definitely the most engaging way to learn a new language I've found!"},
{"source": "google", "author": "Olwin Schrauwen", "content": "The new energy system is ridiculous and extremely frustrating."},
{"source": "google", "author": "ishere isgone", "content": "the energy system is ruining the whole app"},
{"source": "google", "author": "J. V", "content": "Energy system is trash. Very demotivating. Can do 3 lessons tops👎"},
{"source": "google", "author": "Inge Duyx", "content": "De energiepunten zijn waardeloos. zelfs zonder fouten kan je geen twee lessen achter elkaar meer spelen. Kan zo de prullenbak in, de app."},
{"source": "google", "author": "Clara S", "content": "The new changes are very annoying. I can barely do any exercises without having to watch way too much publicity. Dissapointing."},
{"source": "google", "author": "Joyce van Berkel", "content": "Leuke en speelse manier om een taal te leren."},
{"source": "google", "author": "Cécile De Smaele", "content": "Leuke manier om een taal te leren of op te frissen!"},
{"source": "google", "author": "Bernard Gelden", "content": "Leuk en simpel"},
{"source": "google", "author": "Mark", "content": "De nieuwe manier van leren is echt waardeloos. Je bent snel \"op\", ook al heb je alles goed. Je kunt niet meer dan 1 tot 2 lessen per dag doen. Geef me de hartjes terug. Ondertussen heb ik de app al verwijderd en zal mijn tijd niet langer verspillen aan een ineffectieve en inefficiënte manier om een taal te leren."},
{"source": "google", "author": "Lis Braak- van Scheppingen", "content": "De aflopende energiepunten zijn wel erg vervelend, hoe lekker het ook gaat je bent gewoon af. Okan mijn dochter oefenen met schaken maar ik heb daar geen keuze toe... jammer"},
{"source": "google", "author": "Bram Van Gompel", "content": "Zeer leuke manier om een vreemde taal onder de knie te krijgen! Door je reeks in stand te houden, ben je erg committed om elke dag minstens 1 les te doen."},
{"source": "google", "author": "ruudvanvoorbergen Van Voorbergen", "content": "je doet spelende wijs de taal leren."},
{"source": "google", "author": "Cloe", "content": "heel goed."},
{"source": "google", "author": "anisz anisz", "content": "het lukt niet eens meer om 2 lessen te halen. ik ben een trage antwoorder en met de hartjes kon ik veel meer lessen doen. je leert via deze app ook niet genoeg nieuwe woorden meer na een tijdje, dus wat voor zin heeft het dan"},
{"source": "google", "author": "Jacoline Slagboom", "content": "Heel fijn om op een simpele manier je nieuwe taal te leren met korte lessen per dag."},
{"source": "google", "author": "Nienke Borgman", "content": "unusable with free version. Can only use it for a few minutes a day after which you're not allowed to continue bevause you don't have enough 'energy points'."},
{"source": "google", "author": "Miranda Zwarts", "content": "werkt perfect en herinnerd je als je moet spelen in 2 dagen weet ik al 8 zinnen in de taal die ik wil kennen zonder dualingo plus dankjewel!"},
{"source": "google", "author": "Vera Gerrits", "content": "Waardeloos sinds het niet meer met hartjes(levens) werkt maar met een snel leeglopende batterij is het niet meer motiverend om door te gaan met je lessen!!!!"},
{"source": "google", "author": "Wilma Smeets - van den Ent", "content": "Energie ipv hartjes is waardeloos. Onoverzichtelijk en niet leuk meer."},
{"source": "google", "author": "R. Dirne", "content": "Ik ben al ver in mijn lessen en vond het oefenen leuk, maar wat vervelend die energie balk ook al heb je de les goed, je bent energie kwijt! Ik krijg steeds meer een hekel aan het oefenen! Geef mij de hartjes maar terug, dan blijf je tenminste vol als je foutloos werkt. En dat er vanuit Duolingo geen reactie komt op al deze negatieve reviews, nog een minpunt erbij!"},
{"source": "google", "author": "Gerben Vierwind", "content": "ik heb veel ziektes en daarom kan ik niet goed leren dat ik heel moeilijk voor mij een ziekte is het prikkelbaar darmsyndroom"},
{"source": "google", "author": "andré deboeure", "content": "de relefoonoproepen registreren niet alles volledig. sommige vertalingen in het Nederkands worden afgekeurd wegens foute volgorde al zijn ze taalkundig juist. ik mis nu vooral grammatica overzichten"},
{"source": "google", "author": "Francisco Den boer", "content": "deze app helpt echt om een taal te leren"},
{"source": "google", "author": "Bram", "content": "The energy system ruined the experience for me. Bring back the hearts!"},
{"source": "google", "author": "R Hollander", "content": "prima te volgen deze lessen leuk om te doen"},
{"source": "google", "author": "Olaf smale", "content": "gezellig een leuk om een nieuwe taal te leren 🤗"},
{"source": "google", "author": "Engelien Stofregen-Benjaminse", "content": "leuke manier om een andere taal te leren. ."},
{"source": "google", "author": "N DW", "content": "super!"},
{"source": "google", "author": "Marwa Alaboud", "content": "ik Lierde Spaans snel zonde dat ik het wist ik raad het aan wie een nieuwe taal wiel lieren. het is perfect."},
{"source": "google", "author": "Phylicia Rokx", "content": "ik ben heel tevreden maar de batterij moet weg en dat je gewoon kan spelen"},
{"source": "google", "author": "Mustafa Yildirim", "content": "het is echt een leuke ap. En je kan ook meerdere talen leren"},
{"source": "google", "author": "Stijn Denoulet", "content": "Since Duolingo changed Hearts to Energy, the app became wortless as free language learning app. You can do max 2 to 3 lessons a day. That's not how you can learn a language. They force you to pay to unlock unlimited lessons. I really regret their decision. Once you pay, it's a great app. All kind of challenges and leagues motivate you to do lessons. However, after years of streaks in the highest league, I (have to) quit Duolingo, as it simply isn't working anymore. Bye."},
{"source": "google", "author": "Nienke Janssen", "content": "Klopt het dat er nu hele kleine hoofdstukken zijn met heel veel precies dezelfde vragen en dat de triple xp boost die beloofd wordt bij het behalen van de 3 doelen niet meer werkt?"},
{"source": "google", "author": "Quincy O", "content": "wat een leuke manier om te oefenen en leren, iets dat nog bij blijft ook."},
{"source": "google", "author": "Caitlin", "content": "Het zou 5 sterren zijn geweest als het niet was voor de opdringerige advertenties na elke les om Super Duolingo te nemen. Het feit dat het harten systeem is vervangen door een of andere energie meter is belachelijk. Geforceerd worden om extra bij te kopen anders kun je niet nog een les afmaken is ronduit schandalig. Als je harten op waren was het jouw eigen schuld, omdat je te veel fouten maakt. Maar gestraft worden omdat je te lang doorgaat is zo idioot."},
{"source": "google", "author": "Acom Dijk", "content": "After introducing energie. Making progress is halted. Speaking exercises are there but no way of using the mic trough a bug. After 1000 day streak i quit. What a shame."},
{"source": "google", "author": "Roger Hendriks", "content": "heel leuk leerzaam alleen stopt het af en toe hangt dan vast"},
{"source": "google", "author": "Chantal Smit", "content": "Heb de app verwijderd na jaren gebruikt te hebben. Echt heel erg jammer dat nu òòk Duolingo vervelende reclames inzet om je te laten betalen voor een premium abbonement. Om de les krijg ik weer een opdringerige Duolingo reclame te zien waarbij ze een premium abbonement willen aansmeren. En dan nu ook ineens een ander systeem met energie ipv hartjes, waardoor je helemaal niet meer vooruit komt zonder abbonement. Deze app is echt helemaal verpest door de financiele hebzucht v/d makers."},
{"source": "google", "author": "Alex W", "content": "The current energy system is fundamentally flawed and lacks logical consistency. While it would have been more intuitive if the user gained energy upon answering a question correctly, the current implementation forces users to abandon lessons prematurely due to depleted energy bars. This design choice appears to be intentional, as it hinders the learning experience of free users. To add more on this, false messages are send saying I've full 25 energy again, while in the app it's still at 7."},
{"source": "google", "author": "Hessel Van der noord", "content": "leuk om te oefenen"},
{"source": "google", "author": "Jackie X", "content": "Since the war started in Ukraine I've been studying Ukrainian. I have finished that course in one year. And afterwards have been practising what I already know. Lately I see other people getting a level mark on the language. Why don't I? And why does it stay at this very basic level?"},
{"source": "google", "author": "farank faranki", "content": "verygood"},
{"source": "google", "author": "yusuf ziya", "content": "leuk om te leren"},
{"source": "google", "author": "Marlies Botermans", "content": "Het nieuwe systeem dwingt je tot een abonnement. De app is echter niet goed genoeg om 100 euro aan te besteden. Ik stop en verwijder de app."},
{"source": "google", "author": "Sheila Sumbu", "content": "ik vindt het leuk dat duo mij Spaans leert😊"},
{"source": "google", "author": "Jasper Biesemans", "content": "Op zich is het een app waar je een basis mee kan leren, maar er is wel een grote maar. Ik vind het niet nodig dat een app mij forceert om dingen te doen en om ranglijsten te gaan halen. Het neemt het leuke van de app weg. Bij het leren van een taal moet je je tijd kunnen nemen en niet op tijd, volgens wedstrijden en dergelijke gaan werken. Maak een apart onderdeel dat je competities en toetsen kunt afleggen. Fouten qua vertaling zijn ook schandalig vaak aanwezig en dit voor een TAAL app 🫩."},
{"source": "google", "author": "b Xqv", "content": "Super manier om een taal te leren"},
{"source": "google", "author": "Chermain Salon", "content": "te veel onnodige advertenties maar derest is perfect"},
{"source": "google", "author": "Nico S.", "content": "Deze app maakt een goede sprong naar een interactieve zelfstudie omgeving... zou dit aan iedereen aanraden die met verveling te kampen heeft... enige opmerking die ik geef is dat ook kleinere kinderen met deze app proberen te leren. Jonge kinderen hebben een minder stabiel zelfbeeld. Ze zijn constant bezig met de indrukken vanuit de omgeving betekenis te geven. voor die reden zou het beter zijn dat visuele uitdrukkingen die de app geeft bij afwezigheid van de student leeftijdsadequaat zijn."},
{"source": "google", "author": "Elise Boode", "content": "sinds de energie update is het leuk leren vrij snel naar bendenen gegaan, waar je eerst werd geprezen om je fouten moet je nu dokken voor energie verlies, ook als je een vraag goed hebt gaat je energie eraan. dit is zo jammer. wat ik niet snap is de energie bijtelling als je aantal vragen goed hebt, ene keer krijg je 5 energie en dan weer 1 punt erbij wat eigenlijk niks oplevert omdat je je punt al gelijk inlevert voor de volgende vraag. heel erg jammer dit van duo."},
{"source": "google", "author": "sander", "content": "jammer dat sinds de invoering van energie in plaats van hartjes je nog maar 2 oefeningen kan doen. ook als je weinig fouten maakt. Los daarvan blijven de oefeningen leuk. maar beperkt sinds kort"},
{"source": "google", "author": "Gina Gruntje.", "content": "Heel leerzaam. Alleen jammer, dat je meteen je prestatie verliest als je 1 dag niet speelt. Ook is de app soms ingewikkeld voor kinderen."},
{"source": "google", "author": "Marga Baselmans", "content": "duidelijk, leerzaam, werkt prettig, oefent met het verstaan, lezen, schrijven en spreken van een taal. TOP!"},
{"source": "google", "author": "Jacco Blank", "content": "leuke manier om een taal te leren, wel een beetje gek kwa worden in het begin maakt het extra leuk"},
{"source": "google", "author": "Gea Nijenhuis", "content": "Ik heb nu een proefabonnement en was van plan om door te gaan met een jaarabonnement. Maar dat ga ik toch niet doen. Heb het jaarabonnement al opgezegd. In één van de lessen staat een fout in de zin. Vervelend maar kan gebeuren. Maar probeer dan maar eens hulp te krijgen. Via email krijg je een chatbot. Die mij uiteindelijk niet echt kan helpen. Heb het probleem al 3x doorgegeven via de app. 'Bedankt voor de feedback' en daar blijft het dan bij. Vind het echt jammer want heb al veel geleerd."},
{"source": "google", "author": "Jos", "content": "This energy system is terrible. Really discouraging to keep learning. Youre being punished for doing well.... plus when youre almost done finishing a course, and didnt make a mistake, youre out of energy and cant finish it. what a shame....."},
{"source": "google", "author": "Eric Kuenen", "content": "leuk om te doen"},
{"source": "google", "author": "Ben L", "content": "Supergoede personages, geen scheldwoorden, en je kunt er goed talen van leren"},
{"source": "google", "author": "Frits Peeters", "content": "op een leuke speelse manier een nieuwe taal leren."},
{"source": "google", "author": "Daniel B", "content": "Echt wel leuk om zo talen te leren in je vrije tijd 😆"},
{"source": "google", "author": "Bintou diakite", "content": "leuk en ik kan nu leren hoe ik piano 🎹 speelt"},
{"source": "google", "author": "Pientje Meijer", "content": "apart from the.. ai stuff, i do enjoy this app."},
{"source": "google", "author": "Maaike Hermens", "content": "toffe app. zo zit ik toch elke dag wel aan een lesje Frans. Mijn 3 sterren is omdat ik soms fouten maak die ik dan wel snap. Maar soms maak ik fouten, en krijg je niet de uitleg waarom, bv le vieux chapeau ipv la chapeau vieux. Of bv dat bij landen en en au te maken hebben met mannelijk en vrouwelijke landen namen."},
{"source": "google", "author": "Cindy Bastianen", "content": "top"},
{"source": "google", "author": "Newton Van Schoor", "content": "zo leer zaam dit moet je hebben dit heeft geen nadelen"},
{"source": "google", "author": "Romy Schasfoort", "content": "als ik een reeks van 7 dagen aan klik en ik ben klaar dan zecht tie dat ik nog 7 dagen moet"},
{"source": "google", "author": "Yousra El Mrabt", "content": "het is geweldig en leerzaam ik kan nu al goed Koreaans en het uiltje is heel schattig ik ben nu al klaar om daar te gaan woonen en ik leer elke dag maar 3 minuten per les"},
{"source": "google", "author": "Esther Huijbers", "content": "het nieuwe systeem van 'energie' maakt dat je ongeacht je antwoord goed of fout is energie verliest en zo dus na 2 levels al uitgeoefend bent per dag. Het is geen verbetering,maar een verkapte manier om meer super duolingo te laten kopen."},
{"source": "google", "author": "Sasha Viktorova", "content": "The new energy system makes the free version of the app completely unusable. Even if you answer everything correctly you won't be able to do more than a couple lessons (and you won't know if you have enough energy to finish the lesson)"},
{"source": "google", "author": "Geer en Anoes Verburg", "content": "heel leuk en leerzaam"},
{"source": "google", "author": "VeenEde", "content": "Disappointing new feature (energy points instead of hearts): now you don't get the motivation of doing things right ... and sometimes energy points don't add up to the total (eg when achieved through the treasury). Q Why can't I drag the words when filling them in? For a short period of time this was possible ..."},
{"source": "google", "author": "Ap Joja", "content": "goede app"},
{"source": "google", "author": "Chayenna", "content": "Het is leuk en je kan der heel veel van leren"},
{"source": "google", "author": "Lieke Olfers", "content": "Door die energie kun je ondanks dat je een les goed doet gewoon afgaan als je de les daarvoor fouten hebt gemaakt. Dit is belachelijk. Puur een manier om meer geld te verdienen, zodat mensen sneller diamenten gaan kopen. Mooi niet."},
{"source": "google", "author": "junior1460", "content": "Op zich is zijn de taak lessen prima, maar ik vind dat voor een duur betaalde app er veel te veel storingen zijn. Hierdoor kun je niet je behaalde bonussen gebruiken."},
{"source": "google", "author": "Maxime Struyf", "content": "Never liked this app, the moment I tried to like this app and start learning they updated it. They put energy bars in it and even when I nailed every single word and no mistakes, can't even succeed my quest because of low energy. Thanks."},
{"source": "google", "author": "Sophie Teske", "content": "it's a fun and great way to learn different languages 😊"},
{"source": "google", "author": "don meester zwanenburg", "content": "Leuk dat jullie op energie zijn overgegaan ipv hartjes, maar die reclames werken voor geen meter. Zijn jullie op deze manier op abonnementen uit? Ook het extra oefenen om hartjes te verdienen is al afgeschaft, heel jammer. Het wordt steeds lastiger om gratis te spelen."},
{"source": "google", "author": "Ananda", "content": "het is leuk, maar ik vind een abonnement best duur. zeker omdat je geen garantie hebt of het geleerde echt blijft hangen."},
{"source": "google", "author": "Thuan Nguyen (Apocralyph)", "content": "I normally do not post any reviews, except when it is either great or horrible and with the new update where the hearts mechanic is replaced for the energy mechanic it is really demotivating to use this app to learn a language. I fully understand that progressing through the courses is a positive thing but when you do not have premium and you want to redo a course it doesn't feel rewarding at all and you get out of energy quickly. Both should feel rewarding."},
{"source": "google", "author": "Patty Wijnants", "content": "I loved it, but with the energy instead of hearts, it's way less fun. Now, even when you make no mistakes, you can only play 2 or 3 levels before you run out."},
{"source": "google", "author": "Gilles VR", "content": "Nieuwe batterij functie is garbage 0/10 voor free users maar wel altijd reclame in uw strot geduwd krijgen"},
{"source": "google", "author": "Taede Smedes", "content": "No longer possible to do more than two lessons without charging energy by watching stupid ads. Duolingo has become extremely frustrating."},
{"source": "google", "author": "Annet Werlemann", "content": "Zeer torgankelijke manier om een vreemde taal te leren!"},
{"source": "google", "author": "Michelle", "content": "ik speel het met veel plezier. leer veel. maar de energie balk vind ik niets. zelfs als ik geen fouten maak ben ik af. jammer. zo kan ik mijn doelen niet halen. ik vind nu niet veel meer aan. het stimuleert niet"},
{"source": "google", "author": "Rien van den Haak", "content": "Mega veel reclame die lang duurt. En ook om Duolingo maar aan te schaffen. Continu irritante geluidjes en trillingen. Je bent 70% van de tijd kwijt aan reclame en overbodige meldingen."},
{"source": "google", "author": "G. van der Wal", "content": "Sinds je levens zijn vervangen door energiepunten kun je eigenlijk maar drie lessen per dag doen."},
{"source": "google", "author": "Natascha van Gils", "content": "sinds het energiesysteem ben ik minder blij. ik kan maar 3 lesjes per dag doen, maar dat is met het energiesysteem vaak niet haalbaar. halverwege de 3e les wordt ik eruit gegooid. jammer!!"},
{"source": "google", "author": "Albert Scholten", "content": "After the recent update to \"battery lives\" it has taken all the fun and has made the learning unplayable. Even if you don't make any mistake, you still need to view very annoying commercials, often 10 times the same one! This to force you to purchase Duolingo Super. Also if you earned 2× or 3× points time for 10 minutes, you are spending at least half that time watching commercials. This is no fun anymore and I will delete the app."},
{"source": "google", "author": "Kim Van Gestel", "content": "je kan heel snel een tal leeren en is heel luek"},
{"source": "google", "author": "Nino Hilgerson", "content": "i kan nu spaans leren en ik doe een wetsrijd met mijn moeder Wie als eerst zijn streek verliest en het is heel leuk"},
{"source": "google", "author": "Monique Van der Harst", "content": "Hele gebruiksvriendelijke app"},
{"source": "google", "author": "Simone maatje", "content": "Het energie is zo op en je kan nog geen 3 lessen maken op een dag. En dan duurt het ook nog bijna een dag dat de energie weer vol is. Ik vind het ook stom dat als mijn antwoord goed is dat er ook energie vanaf gaat. Verander het maar weer terug of doe wat aan de energie."},
{"source": "google", "author": "Jirka De Saedeleir", "content": "met de nieuwe energie balk kan je amper 2 lessen doen. breng de hartjes terug (al waren die ook vervelend maar je kon wel meer lessen maken). nu gaat het puur om geld. de mensen dwingen te kopen. mijn motivatie bijna kwijt nu."},
{"source": "google", "author": "Martin", "content": "easy learning Mandarin"},
{"source": "google", "author": "knetterijsjuh", "content": "alleen jammer van de vele reclames. snap dat het nodig is maar iets minder mag wel. zeker als je reclamevrij 80 euro maakt"},
{"source": "google", "author": "Irma Breewel", "content": "de nieuwe manier van punten is waardeloos. loopt ook af als je alles goed hebt. midden in een les ben je dan af terwijl je niets fout doet. telt de tijd ook mee?"},
{"source": "google", "author": "Benjamin Koops", "content": "it was a reasonable system of learning words, but now they replaced the hearts system with energy, that will go down, even if you answer right."},
{"source": "google", "author": "YamiYuseiGG", "content": "Yeah after 900 days of having a streak I just deleted the app and freeing myself from the owl. It's just annoying that, for a language like Japanese, Duolingo doesn't show enough of *why* things are as they are. And when I make mistakes I need a subscription to get it explained! Ridiculous. How am I supposed to learn that way???"},
{"source": "google", "author": "Nick ter Beek", "content": "The app was fun until they implemented the new energy system forcing you to either pay or watch adds in order to be able to do more than 3 lessons."},
{"source": "google", "author": "Levi vanE", "content": "goed om te leren"},
{"source": "google", "author": "Wytze Smits", "content": "Leuke app om de basis van een taal in je eigen tempo te leren. Gratis met niet al te veel irritante reclame."},
{"source": "google", "author": "A pendic", "content": "je leert ervan maar het zou beter zijn als het soort teksten waren nu is het beetje lukraak woorden/zinnen."},
{"source": "google", "author": "Joke", "content": "Na de update is het een vervelend programna geworden. Energie verbruik je nu nml ook zonder fouten. Nu kan je net 2 trainingen doen, tijdens de 3e training is de energie op en stopt het.... Bij de levens moest je stoppen als je teveel fouten had gemaakt. En als het goed ging werd je beloond doordat je meerdere trainingen kon maken, wat een stimulans was om het goed te doen. Dit leer programma is nu echt niet leuk meer. Dag duolingo 👋"},
{"source": "google", "author": "Daniella D-signs", "content": "super leuke app, alleen vind ik de prijs best duur en die energie ipv de hartjes maken het helaas minder leuk! Ik speel het al minder, voorheen als je hartjes op waren dan kon je ook nieuwe krijgen door te oefenen waardoor je automatisch toch nog extra leerde! Of zorg dat je de energie kan aanvullen met oefeningen!"},
{"source": "google", "author": "Elisabeth van der Lans", "content": "Starting with the energy is the worst change ever. It takes all the fun and motivation away."},
{"source": "google", "author": "Jeffrey Van Suntenmaartensdijk", "content": "top"},
{"source": "google", "author": "Emmy van Breenen", "content": "op zich fantastidch, maar dat de hartjes gewijzigd zijn naar een energiemeter vind ik waardeloos. Zelfs als ik mijn lessen foutloos doe, haal ik mijn dagelijkse missie niet. Daarom geen 5 sterren!"},
{"source": "google", "author": "Paul de Groot", "content": "beetje jammer dat de app ineens over gegaan is naar energie in plaats van fouten. je kunt de app nu minder lang gebruiken. Balen, je kunt zo minder lang een taal leren."},
{"source": "google", "author": "françois ryckaerts", "content": "DE BESTE MANIER OM EEN TAAL TE LEREN!!! 5 STERRENNNN 🌟"},
{"source": "google", "author": "Gina Lelyveld", "content": "Leuk, handig. Neemt weinig tijd in beslag!"},
{"source": "google", "author": "René S.", "content": "App doesn't start up anymore. I only see a green screen with the text Duolingo. First I got the same lesson every time. I installed the app again several times. Also removed the cache etcetera. And now I only see the green screen. And now the browser version is also not working anymore... Error 500. I can only start an old lesson. More than a month later: still not working. I sent a message to the helpdesk... they did not reply..."},
{"source": "google", "author": "Christien", "content": "ik denk er ook sterk over de app te verwijderen na de vervanging van de hartjes door veel te snel afnemende energie"},
{"source": "google", "author": "S oag", "content": "I like the app, am paying for it. Not so happy with the last update. Exercises keep repeating over and over again, now that they've shortened the units. (I'm near the end of the Spanish course Duolingo, if that helps)"},
{"source": "google", "author": "Ton van Esch", "content": "mooie opbouw"},
{"source": "google", "author": "Marco Oggel", "content": "een goed leersysteem, maar die boze uil kan echt niet"},
{"source": "google", "author": "imani gosiau", "content": "super leuk!!!"},
{"source": "google", "author": "Debby Schurink", "content": "Zelfs de gratis versie is top!"},
{"source": "google", "author": "Melanie De Pauw", "content": "super goed voor lessen te doen je moet het uitproberen"},
{"source": "google", "author": "Elias Bosmans", "content": "i love duolingo,i am studying Spanish for two years now and i love it"},
{"source": "google", "author": "Miquel Rolefes", "content": "love this app for school"},
{"source": "google", "author": "Nick De Rammelaere", "content": "Het is super leerrijk! Dit is de beste optie om een taal te oefenen."},
{"source": "google", "author": "H S", "content": "het is goede app waar je goed op kunt leren, maar de energie die verpest het een beetje omdat, je met energie maar 2 tot 3 lessen kan doen terwijl je er misschien veel meer wilt doen. Maar verder wel heel goed om een nieuwe taal te leren."},
{"source": "google", "author": "Yves Van hoyweghen", "content": "sinds de laatste update is het niet zo leuk meer om te spelen met hun energie boost"},
{"source": "google", "author": "Eva Van Soest", "content": "The new system with energy instead of hearts sucks"},
{"source": "google", "author": "Bike Loonatic", "content": "men zegt geen goed spaans maar om je verstaanbaar te maken meer dan ok. leraren willen zelf verdienen haha. minpunt is dat start te lang soort zeurt over eten drinken en appels.... je kan in begin best wat stappen overslaan. vanaf level naar restaurant en hotel wordt t leuker en vanaf kopen kleding etc ook grammatica. toch wel top hoor en gewoon spreken met anderen zo leer je het beste je geoefende lessen van duo"},
{"source": "google", "author": "Christina Van Asch", "content": "hele fijne app"},
{"source": "google", "author": "Ingrid Nelson", "content": "Op een eenvoudige manier leren! Je kan het eenvoudig en kort per dag doen, of een hogere moeilijkheidsgraad kiezen. Ik deed eerst alleen Frans, maar nu ook wiskunde en muziek. Gewoon leuk."},
{"source": "google", "author": "Caroline Sparenburg", "content": "Heel leuk om een taal op deze manier te oefenen."},
{"source": "google", "author": "Wesley Eijkenboom", "content": "die nieuwe update waarin de hartjes zijn vervangen door energie is bs. je kunt niet meer dan twee lessen doen voordat je energie op is en je een abbonement voor Super moet kopen. zelf al kies je \"oefen voor meer energie\", krijg je niet genoeg om een les af te maken, en moet je weer opnieuw beginnen en je energie is weg. geen aanrader."},
{"source": "google", "author": "Kafong Cheung", "content": "heerlijke app om chinees te leren"},
{"source": "google", "author": "Marja Bosman", "content": "fijn om elke dag de Spaanse taal te oefenen. relevante woordkennis."},
{"source": "google", "author": "Jacky Mestrom", "content": "De nieuwe methode met de batterij is niet fijn. De hartjes methode was veel fijner waardoor ik meer deed op duo lingo"},
{"source": "google", "author": "Barry Schaekens", "content": "super aanrader"},
{"source": "google", "author": "Maria Intven", "content": "leuk en toegankelijk"},
{"source": "google", "author": "Wilhelmina Arvanitakis-Basart", "content": "I love it!"},
{"source": "google", "author": "Cady De Bruin", "content": "i dont quite like the energy bar because it will only let me do 2 lessons before the energy is completely depleted, i prefer the hearts"},
{"source": "google", "author": "Bert Van Brabant", "content": "de betaalde versie is top, maar duur..."},
{"source": "google", "author": "T Tlemcani", "content": "change to energy system. more ads"},
{"source": "google", "author": "Rukiye Selcuk", "content": "het is heel leuk en voor kinderen die engels moeilijk vinden kunnen ze dit oefenen"},
{"source": "google", "author": "Siegbert Verhulst", "content": "Nice app to learn words in a foreign language. Sadly they changed the app and you can only exercise a limited time. (your energy decreases). In the previous version you were more motivated to make no errors so you could keep going."},
{"source": "google", "author": "Wouter Van Dam", "content": "This new energy system is the worst. I could tolerate the incessant stream of ads, but this energy nonsense will probably make me stop using Duolingo."},
{"source": "google", "author": "Liese Vandersmissen", "content": "Zeggen zelf dat je een taal kan leren met 15min oefenen per dag, maar geven dan niet eens genoeg energie om 15min te oefenen... hopelijk krijgen we snel de hartjes terug."},
{"source": "google", "author": "E H", "content": "Door de nieuwe energie heb je weinig kansen om het leuk en goed te leren. Hopelijk komen de oude hartjes terug of iets anders."},
{"source": "google", "author": "Anton Nolte", "content": "I don't like the new energy meter, the hearts were much better and if it's not going to change back, I consider finding another app to learn languages."},
{"source": "google", "author": "Peter Ten hoorn", "content": "ik ben al 300 dagen bezig met Engels. erg leuk en leerzaam. jammer alleen dat we geen hartjes meer krijgen maar energie, ik kom nu met veel moeite vooruit. graag wat hulp. ä ü ɓ!"},
{"source": "google", "author": "Abdullahi Mohamed", "content": "coool"},
{"source": "google", "author": "Sam Burgers", "content": "its super chill and clean"},
{"source": "google", "author": "Jack Willeboordse", "content": "Goede app voor talen, je traint vooral lezen en luisteren."},
{"source": "google", "author": "M A", "content": "leuke app, maar de verandering van energie is echt niet leuk. Gebruik van hartjes was veel fijner. Nu voelt het of ze je willen dwingen tot een aankoop."},
{"source": "google", "author": "Dylan Christiaans", "content": "als je bij de batterijen komt in plaats van de hartjes wordt beetje zuur omdat je maar 1 soms net aan twee lessen kan doen"},
{"source": "google", "author": "Een Google-gebruiker", "content": "als je moeite hebt met engels zoals mij is dit de perfecte app je krijgt opdrachten dat je het moet vertalen maar ook zoek de paren mijn engels is in ieder geval een stuk beter geworden ps mijn eerst cijfer voor engels was een 3 nu is het een 7.4 ik hoop dat je deze app download"},
{"source": "google", "author": "Rayan Oussaid", "content": "Ik hou van het"},
{"source": "google", "author": "Angela Van Den Elshout", "content": "het is zo leuke manier om nieuwen talen te leren"},
{"source": "google", "author": "Yves Opstaele", "content": "Best way to learn"},
{"source": "google", "author": "Dennis brightburn", "content": "changed the hearts system to an energy system that makes sure you can't do as many lessons as before. was thinking about paying for duolingo. now i might be switching to competitors."},
{"source": "google", "author": "Hanneke Brouwer-Veen", "content": "je bouwt echt een woordenschat op door het vele herhalen en ook de grammatica beklijft daardoor. Maar, alles valt of staat met elke dag een paar lesjes en met praten en fouten maken en oefenen. Goede ondersteuning."},
{"source": "google", "author": "Tessa Prins", "content": "Wil toegang tot mijn contacten, ik haak af."},
{"source": "google", "author": "Ellen Merckx", "content": "Er wordt geen uitleg gegeven en dat mis ik soms, maar verder bevalt het me heel goed. Mijn Frans is al veel verbeterd, wat mij motiveert om verder te doen."},
{"source": "google", "author": "Nele Serneels", "content": "het nieuwe systeem met energie winnen of verliezen werkt ontmoedigend, zelfs wanneer je geen fouten maakt geraak je niet door 1 opdracht. Het is meer stimulerend om een hart af te geven per fout in plaats van energie af te geven bij een juist antwoord. Ik vind de update zo teleurstellend dat ik niet weet hoelang ik nog ga blijven oefenen, jammer."},
{"source": "google", "author": "Joeri Marcelis", "content": "the new energy update is the absolute worst money grabbing scheme. legendary lessons take 2 energy per question, so you can't even complete a lesson on a full charge. this is ridiculous, this app isn't about teaching a language any more."},
{"source": "google", "author": "J. V.H.", "content": "ik vind de nieuwe optie met Energie/de batterij geen meerwaarde"},
{"source": "google", "author": "Alex Kooijman", "content": "Veel reclame en maar proberen om over te gaan naar Super Premium"},
{"source": "google", "author": "Julietta Mulders", "content": "perfect om beter te worden in een taal!! :D"},
{"source": "google", "author": "Stef Mink", "content": "het is gratis en het werkt"},
{"source": "google", "author": "Veerle van der Ham", "content": "Duolingo was met hartjes een stuk leuker! Met de batterijen kan je nauwelijks lessen doen. teleurstellend..."},
{"source": "google", "author": "Imkerij D'n Angel", "content": "super leuke app, werkt heel motiverend"},
{"source": "google", "author": "Get lost on Earth", "content": "kan me geen leven voorstellen zonder een lesje per dag van duo"},
{"source": "google", "author": "Sipke Evenhuis", "content": "Duolingo keeps me engaged every single day. Duolingo is really great at learning the vocabulary of different languages, but I do think it could work on how it teaches grammar. Given the variety of sentences per language, learners should pick up on it naturally. I would prefer some more explicit instruction on the grammar of different languages. Still, the social aspects of Duolingo do keep you engaged. Ranked play can be awful due to power users though."},
{"source": "google", "author": "Natascha de Valk", "content": "prima voor de basis."},
{"source": "google", "author": "Debora Anson", "content": "wel jammer dat het zo duur is"},
{"source": "google", "author": "Karen van Ingen", "content": "va bene"},
{"source": "google", "author": "L", "content": "The new energy update sucks and it's unfair compared to the hearts!"},
{"source": "google", "author": "A Haan", "content": "Zelfs al doe alles goed, meer dan twee taken kun je niet doen. Stom hoor!"},
{"source": "google", "author": "d", "content": "Erg leuk, ben ook al lang bezig, maar sinds kort gaat je energie op tijdens het oefenen; ook bij perfecte lessen loopt dit terug. Erg jammer dat je dan opeens niet verder kan of moet gaan betalen. Daarom geen 5 sterren, maar zelfs maar 3 na deze recente aanpassing."},
{"source": "google", "author": "Iljo Meijer", "content": "het is heel leuk maar soms denk je van ahhhhhh, maar het is fijn dat je meer cursussen er bij kan doen als je meer dingen moeilijk vindt wel jammer dat ze je soort duwen om dingen te kopen"},
{"source": "google", "author": "Marije De Groot", "content": "Ik vind het zoo leuk dat je nu ook kunt schaken bij Duo Lingo!♡"},
{"source": "google", "author": "Kevin Kieckens", "content": "met hartjes veel leuker dan nu met baterij echt frustrerend dat je na 2 spelletjes reclame moet bekijken"},
{"source": "google", "author": "Jerilva Rudge", "content": "goed"},
{"source": "google", "author": "Maartje van den Brink", "content": "top 👍"},
{"source": "google", "author": "moses van brugge", "content": "Good"},
{"source": "google", "author": "Rastawoefie", "content": "Wat een domme keuze zeg: werken met energie. Je moet dagelijks een les doen, maar als je een les doet, verlies je energie. Je krijgt alleen energie terug als je het koopt of advertenties kijkt, maar dat js BOVENOP de advertentie die je na iedere twee minuut-les geforceerd krijgt. Die 5 hartjes waren al slecht maar dit is nog veel slechter!"},
{"source": "google", "author": "Sander van de Corput", "content": "I was always happy with duolingo. but this changed with the removal of the heart system. the current energy system is barely enough to do 2 lessons a day."},
{"source": "google", "author": "Konstantin Voronetskii", "content": "Безобразная система с энергией на день делает занятия ужасно неудобными. Пользуюсь программой почти шесть лет и не хотелось бы прекращать это делать."},
{"source": "google", "author": "Shayenne Kukler", "content": "amazing"},
{"source": "google", "author": "Evin Badur", "content": "echt leuk! ik heb Spaans gelered voor 30 dagen en ik woon nu in Spaans en ik heb voor de eerste keer bananas gekocht zonder translate te gebruiken 😅"},
{"source": "google", "author": "s f", "content": "helaas nogal veel fouten in de app, zolang die er niet uit zijn gebruik ik enkel de gratis versie onlangs de wijziging van hartjes naar energie waardoor je maar een beperkt aantal lessen kan doen. ze proberen af te dwingen dat je er geld aan uitgeeft. aangezien er nog veel fouten inzitten ook geef ik maar 1 ster meer"},
{"source": "google", "author": "Thomas Eelen", "content": "top"},
{"source": "google", "author": "michel b", "content": "ik vind het top zo kan ik gratis Engels leren!"},
{"source": "google", "author": "Christiaan Peeters", "content": "best app for learning other languages, when does slovenia get added to the languages? Sometimes you have triple or double XP and somehow it just dissapear, you complete all tasks day before so you have triple XP next day and than it doesn't work, have it at least ones a week, pretty anoying also if you complete one of the tasks it should give you x1.5/2 XP and it just doesn't work and now energy in place of hearts 😮‍💨 Bring hearts back .. think it's time to stop duolingo"},
{"source": "google", "author": "Peter Arisz", "content": "why this change from hearts to energy, and how it works i do not understand."},
{"source": "google", "author": "Mo Mo", "content": "Na ongeveer 1400 dagen heb ik deze app vandaag uiteindelijk verwijderd. Met het nieuwe energiesysteem kun je als gratis gebruiker niet meer dan 2-3 lessen per dag doen zonder reclame te kijken. Spijtig dat de app door de jaren zo achteruit is gegaan..."},
{"source": "google", "author": "Leon van Huisstede", "content": "ik vind het jammer dat je bij de gratis versie je maar 1 les kan doen Voor de rest een prima app"},
{"source": "google", "author": "Sheetal Sheombarsing", "content": "it's a good learning app"},
{"source": "google", "author": "D B", "content": "It used to be a nice app. The new 'energy system' has definitely changed that. It makes it a lot harder to get in lessons and finish quests. Definitely not happy about that. And the adds are very weird."},
{"source": "google", "author": "C. Chris", "content": "There's a glitch with the Chinese course at the moment, it's impossible to go to the next level. It stays at the same score even after finishing the level with good results."},
{"source": "google", "author": "Angelique Berendse", "content": "Werkt heel fijn, alleen jammer dat er geen lijst met de vocabulaire is om op terug te vallen, en zelf apart te kunnen leren. Verder vind ik het vrij duur, zeker omdat je het in een keer moet betalen."},
{"source": "google", "author": "Bart Grammet", "content": "goeie app om lessen mee te leren"},
{"source": "google", "author": "Mona Van Beneden", "content": "it's such as lovely app to learn languages but there was An update that i don't like first we had hearts and per mistake we make we had one heart less and now we have a battery and per mistake you lose battery but if you make NO mistakes you still lose battery and that's not good than we learn less and i don't want that so duolingo i hope you read this and please change it back to hearts 🩷"},
{"source": "google", "author": "Dennis Moes", "content": "ik snap dat Duolingo geld wilt verdienen, maar deze nieuwe energie level methode ipv Hartjes methode zorgt ervoor dat ik de app heel snel ga verwijderen"},
{"source": "google", "author": "Wim Loderus", "content": "het is leuk en je leert 😃😃"},
{"source": "google", "author": "Dennis Westerhout", "content": "Echt heel leuk en leerzaam."},
{"source": "google", "author": "Een Google-gebruiker", "content": "jammer dat je zonder abonnement niet lang kunt oefenen per dag"},
{"source": "google", "author": "Anita Meijer", "content": "Ik vond de app altijd erg fijn. Heb er beter duits door geleerd. top! Maar waarom nu ineens over op energie punten ipv levens? Je kan hooguit, 1,5 les doen en dan kun je niet meer verder. Erg jammer."},
{"source": "google", "author": "Nathalie Oreel", "content": "je kan zelf je nieuwe taal kiezen.🥰🥰"},
{"source": "google", "author": "Valerie Rampaart", "content": "de aanpassing van hartjes naar energie is niet begrijpelijk en ik kan regelmatig niet de lessen afmaken ondanks ik geen fouten heb gemaakt (daarmee verloor je hartjes). soms gaat het heel snel achteruit en soms haal je en les wel. laatst 100 diamantjes betaalt om een 'gouden'- les (expert) te kunnen doen; nul fouten en toch de les niet kunnen afmaken?! En net begonnen met 25 energie(helemaal vol) 100 diamantjes betaald, 2 fouten gemaakt en je kan m niet afmaken zonder er nog eens 450 te betalen"},
{"source": "google", "author": "Mandy de Mooy", "content": "bereken geen dagen meer dat is stressend"},
{"source": "google", "author": "Martijn Wessels", "content": "nieuwe update met energie balkjes is ontzettend slecht."},
{"source": "google", "author": "Pawel Skierkowski", "content": "het helpt me met niewe binnen te leren"},
{"source": "google", "author": "Melissa Van Dams", "content": "het is mooi"},
{"source": "google", "author": "Remi Boon", "content": "ik vind het heeeeeeeel leerzaam en je kan ook wiskunde doen en je kan een instrument spelen dus maakt dat het geweldige en je elke taal leren je kan Portugees leren en Engels en je kan je eigen niveau"},
{"source": "google", "author": "Aaron Vos", "content": "Het mag wel goed zijn maar er is de hele tijd een foutmelding bij een les"},
{"source": "google", "author": "Caylen Lont", "content": "zo handig deze app je kan schrijven lezen en praten als u op vakantie gaat of naar uw studie in dat land(den) is dit zoooo handig"},
{"source": "google", "author": "Liane De blaauw", "content": "enorme leuke app..( zinvol ) heel duidelijk en heb elke dag plezier in het leren van de Arabic language!"},
{"source": "google", "author": "Chairengeley Pieter", "content": "heel leuk"},
{"source": "google", "author": "Jacqueline Nieboer", "content": "zo jammer dat ze u ipv 5 hartjes (levens) hebt nu die energie balk. zelfs als je alles goed hebt kost het je energie waardoor je niet lang kan oefenen. erg jammer deze 'verbetering' 😕"},
{"source": "google", "author": "Lily M", "content": "Het is handig om te gebruiken als je al een taal bent aan het leren, een handige speelse manier om je taal te herhalen. Ik vind het gewoon niet handig dat je nu met energie moet leren in plaats van de hartjes, want nu als je 3 lessen compleet juist heb kan je niet eens verder terwijl je met de hartjes 10 lessen kan maken en nog altijd verder kon."},
{"source": "google", "author": "Kayleigh van den Dries-Timmer", "content": "ik vond het heel leuk om mijn Engels bij te leren maar sinds het energie is geworden kan je maar beperkt leren met hartjes was het veel beter ik vind dit zo teleurstelling Duolingo ik wil de hartjes terug ik kijk liever advertenties voor hartjes dan energie is niet leuk als je iets goed raad en de energie af dat is niet leuk #hartjesterug"},
{"source": "google", "author": "Nynke Beekman", "content": "i am a fan of the app honestly but WHY change the hearts system i have a streak of 444 and seriously thinking of quitting just because of the new energy system."},
{"source": "google", "author": "Tamara van Batenburg", "content": "Leuk en leerzaam. Al gaat het wel langzaam zonder Super."},
{"source": "google", "author": "Daisy Rigter", "content": "Iedere dag even Frans leren."},
{"source": "google", "author": "Bert", "content": "Great app to revise or learn some basics. The new system with pink batteries ruined my experience though, a real shame."},
{"source": "google", "author": "Twan Kloosterman", "content": "Of course the way to get more money is to further monetize the hearts system. The fact that you can never get far with a free plan because of the energy, is insane. You've lost me."},
{"source": "google", "author": "Constance Kort", "content": "ik kan in ene niet meer mijn eigen partner kiezen voor de week opdracht. ook zijn mijn sterren verdwenen en moet ik het doen met energie waarbij je niet eens in 1x je opdracht kan vervullen. helaas is niet elke verandering een verbetering 😭"},
{"source": "google", "author": "Annelies Vandewiele", "content": "Super leuk en niet al te veel fouten in de vertalingen. Sinds de laatste update en wijziging in energie is er niets meer aan. Na 3 lesjes ben je al je energie kwijt, ookal maakte je geen enkele fout, en moet je verplicht reclames bekijken indien je wilt verder leren. Je triple puntenwaarde (gedurende 20 minuten verdien je 3x zoveel XP als beloning omdat je de dag ervoor goed geleerd hebt) loopt natuurlijk gewoon door tijdens het bekijken van die reclames, je geniet niet van je beloning!"},
{"source": "google", "author": "Ingrid van Leeuwen-Smit", "content": "Het nieuwe systeem van energie in plaats van hartjes is vreselijk. Het is moeilijk om snelle voortgang te boeken. na 2 lessen moet je alweer advertenties bekijken om op een acceptabel energieniveau te komen. Waarschijnlijk hoopt men dat veel mensen overstappen naar een abonnement."},
{"source": "google", "author": "Radvin Rahimian", "content": "irritant maar leuk"},
{"source": "google", "author": "edgar rikkert", "content": "nadat ze zijn gewisseld van een levens systeem naar een batterij die leeg gaat als je opdrachten doet is voor mij het einde bereikt. Naast dat je eigenlijk geen taal leert maar gewoon patronen moet opmerken zal ik toch maar Duolingo verwijderen. Verspeeld niet je tijd en ga op zoek naar een andere taal app."},
{"source": "google", "author": "G. Lesire", "content": "I was very satisfied, until the recent change (energylevel instead of lives). I'm gonna quit."},
{"source": "google", "author": "Arvidicus Jongsma", "content": "supergoed door duo kan ik over 3 maanden al Frans spreken 😁"},
{"source": "google", "author": "Sylvie De Koker", "content": "TOP!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"},
{"source": "google", "author": "Yana Van der Linden", "content": "het is leuk en best grappig"},
{"source": "google", "author": "Hannah van Tongeren", "content": "Giving up my streak of exactly 3 years and never returning. This app used be alright. It never was a good app for learning a language but at least it was fun. Now with the ai ruining the quality and the added ads.... There literally used to be no ads, the only ads would be to promote the super duolingo programme. Now super duolingo adds are only about a third of the adds you get. Sad to lose such a fun thing to ai and the owners wallet wanting to be fuller."},
{"source": "google", "author": "Cathy Vandergucht", "content": "leuk tot nu met die energiepunten valt het erg tegen! zeer demotiverend"},
{"source": "google", "author": "Petra Van den Broeck", "content": "Leuke bezigheid en al heel wat opgepikt."},
{"source": "google", "author": "Nathalie S", "content": "New energy system sucks, at best I can do 3 lessons, unless I watch ads for more energy. As if I didn't have to watch enough ads already. On top of that the math lessons are completely americanized. Please keep in mind that people all over the world use (probably less in the future with the energy system) this app and don't use ft, inch and other weird measurements. I can't do those lessons, we use liters, meters, etc."},
{"source": "google", "author": "Nea Wolfs", "content": "ik ben niet goed in talen, maar duolingo helpt me hier super goed bij"},
{"source": "google", "author": "Ellen G", "content": "ik vind duolingo een hele leuke en leerzamen app en je kan leuke oefeningen er mee oevenen"},
{"source": "google", "author": "Eric Delaet", "content": "An annoying put up your volume bar covers the content and now another option \"energy\" keeps you from learning :( Support even doesn't react. Cannot recommend this app anymore, check Busuu or LingoDeer!"},
{"source": "google", "author": "Guido Crijns", "content": "Energy makes me play less. Even paying for the app doesn't remove the energy system. Time for a new app?"},
{"source": "google", "author": "Lukasz Kaczmarek", "content": "het heeft geen reclames en het is heel leerzaam"},
{"source": "google", "author": "Dave De kruijf", "content": "goed"},
{"source": "google", "author": "Simone Adema", "content": "Ik vond het erg leuk, maar nu de hartjes energie zijn geworden, je midden in de les moet afsluiten en niks aan de verdiende xp bonus hebt, is de lol er af helaas. Hopelijk wordt dit snel terug gedraaid.."},
{"source": "google", "author": "Jelle", "content": "echt die energie trekt op niets ik had liever die hartjes"},
{"source": "google", "author": "no", "content": "gewoon een top app je leert vijna alle talen niet precies maar je leert het wel"},
{"source": "google", "author": "Maikel G", "content": "0 sterren! Het nieuwe energie systeem heeft de app onbruikbaar gemaakt. Krijg je een 2x verdubbelaar waardoor je normaal nog even door zou spelen (en dus reclames zou kijken!), nu kan ik gewoon niet verder zonder te betalen met 'juwelen'. Dus sluit ik de app na 1 les. Duolingo killt zijn eigen app. Hebberigheid van Duolingo -> wegwezen met deze app! Ook al zat ik nu op een reeks van 450 dagen, hij gaat er NU vanaf. Bye bye Duolingo! 😣"},
{"source": "google", "author": "Stijn Jans", "content": "erg leuk en mooi gemaakt, proficiat!"},
{"source": "google", "author": "Richard Veltman", "content": "Wat is dat met die accu ipv de hartjes? Dit is voor mij echt een achteruitgang van deze app. Echt zonde."},
{"source": "google", "author": "Vato Loco", "content": "Good app to learn another language"},
{"source": "google", "author": "Hans Choinowski", "content": "prima cursus , jammer dat het brasiliaans portugees is"},
{"source": "google", "author": "Pim Köther", "content": "ik vindt het een hele leuke manier van leren voor de taal die jij wilt"},
{"source": "google", "author": "maarten c de groot", "content": "reclame dwang geld dwang constant"},
{"source": "google", "author": "Peter Koehorst", "content": "Het nieuwe energie systeem in plaats van hartjes maakt gratis gebruik ontzettend beperkt. Maximaal 2 lessen mogelijk achter elkaar. En de app is echt niet goed en gevarieerd genoeg om een duur abonnement te nemen."},
{"source": "google", "author": "Nicole Bohmermann", "content": "het is geweldig ik gebruik het voor school en het is handig als je ergens naartoe gaat en je dan die taal kan leren echt geweldig dit 😍🤩"},
{"source": "google", "author": "Petra Noordzij", "content": "Irritant dat de app in een verhaal blijft hangen een niet meer verder gaat"},
{"source": "google", "author": "Naoufal Boughlala", "content": "is super"},
{"source": "google", "author": "RJ D", "content": "The new energy system sucks hard bring back the hearts please. I can't make progress like i did before the change. It takes the fun out of learning if you can't finish a lesson. It is too much pay to play now."},
{"source": "google", "author": "Sander Siebel", "content": "Duolingo heeft zichzelf de das omgedaan met de introductie van de energiebooster. 2 lessen per dag is ongeveer de max, of de app kopen. Leuk leren is voorbij. Deze app daarom verwijderd!"},
{"source": "google", "author": "Erik Wolfs", "content": "leuk"},
{"source": "google", "author": "sandra laroy", "content": "het is leuk voor the leere als je in het 3de leerjaar zit"},
{"source": "google", "author": "Mabel Dekker", "content": "The energy thing sucks. It makes it impossible te learn."},
{"source": "google", "author": "Robert Lemmen", "content": "het nieuwe energie systeem is bagger"},
{"source": "google", "author": "Wieke", "content": "Leuke app, je kan er heel goed een nieuwe taal mee leren. Sinds kort gaat je energie op als je wat langer wilt oefenen. Jammer dat ze op deze manier proberen een premium account af te dwingen."},
{"source": "google", "author": "Lars Folkertsma", "content": "De nieuwe energy-methode is zeer vervelend. Duolingo is bedoeld voor educatie, maar als het aantal lessen beperkt is wordt je educatieniveau toch niet beter?"},
{"source": "google", "author": "Sacha Mulder", "content": "Leerzame app, wel dwingend als je een dag niet oefent."},
{"source": "google", "author": "Mirjam Gerritsen", "content": "leuke manier om engels te leren, je wordt beloond en enthousiast gemaakt."},
{"source": "google", "author": "Mark Musters", "content": "The focus on collecting more add revenue trough the energy update is holding me back learning. I don't want to waste time on ads."},
{"source": "google", "author": "erwt222", "content": "dit nieuwe systeem met energie werkt echt niet ik denk dat ik het ga verwijderen"},
{"source": "google", "author": "Kinderboerderij De Heul", "content": "heel erg leuk!"},
{"source": "google", "author": "Annick Mahieu", "content": "ik krijg geen toegang tot super, raakt niet geactiveerd"},
{"source": "google", "author": "Ellen Meersman", "content": "Leuke speelse manier om een nieuwe taal te leren."},
{"source": "google", "author": "Gujuman Ion", "content": "beste app om talen te leren👍👍👍"},
{"source": "google", "author": "jardy dewerchin", "content": "in het begin dat ik het installeerde was dit zeer goed je had 5 hartjes dus kon je 5 fouten maken maar nu is dit veranderd naar 25 energie maar per oefening juist of fout verdwijnt er energie en kan je dus niet veel lessen meer doen per dag zeer jammer"},
{"source": "google", "author": "TOM Vroomen", "content": "ik leer Duits heel goed"},
{"source": "google", "author": "Givana Jellema", "content": "Dit is leuk ik kon geen engels nu wel! Byeee gurliess"},
{"source": "google", "author": "Bas Fine", "content": "De gemaakte veranderen zijn alles behalve positief... energie ipv hartjes... is dat een hint om de betaalde versie te activeren ? Dacht het niet. zorg eerst maar dat de app goed draait en de hartjes terugkomen. Anders ga ik, ondanks mn 924 dagen, gewoon wat anders zoeken en is het bye bye Duolingo 👋"},
{"source": "google", "author": "Okpako de Schepper", "content": "terrible new system with energy like every other ad-filled game. hearts were fair, energy is enough for not even 2 lessons. even if you do well, you're punished and can't make your daily quests anymore. this is slowly gonna make duolingo bleed out of playtime. I'm not paying. education should not be a micro transaction."},
{"source": "google", "author": "Julian Djie", "content": "echt slecht.. sinds de hartjes weg zijn.. Moet ik een advertentie kijken. ENERGIE gaat zelfs op van perfecte lessen. en HET OPLADEN VAN 0 naar 25 energie duurt een dag.. echt niet goed.. ze moeten serieus terug naar hartjes.. ik zou deze app echt niet meer aanraden. en de advertenties geven veel te weinig hartjes om ALLEEN 1 perfecte les te doen als ik dit een 0/5 kon geven zou ik het doen. voelt nu gewoon als een generic cashgrab"},
{"source": "google", "author": "Dimitri Teunckens", "content": "Useful app, but does miss some better gramatical explanation, or has no explanation on why an error you made is wrong, you only see the correction itself. The new system with 'Energy' is a serieus negative evolution and frustrating as in the mid of an exercise you run out for no reason. Beginning of the end?"},
{"source": "google", "author": "Rohan Segers", "content": "Duolingo laat je heel snel en gemakkelijk talen leren en het uiltje erin motiveert je ook altijd."},
{"source": "google", "author": "Tanja Vinke-Smeenge", "content": "Ik heb een streak van bijna 1000 dagen en heb meer heel veel plezier geleerd meer deze app maar ik merk dat ik sinds het nieuwe energie systeem ipv hartjes er weinig lol meer aan beleef. Voorheen kon je gerust meerdere lessen doen maar nu is je energie op na twee lessen ookal is het foutloos, puur omdat je soms iets langer bezig bent om een opdracht te lezen, wat logisch is als je een vreemde taal leert... Jammer Duolingo, dit is echt een domme zet van jullie geweest!"},
{"source": "google", "author": "R. Langenberg en H.D. Bodbijl", "content": "Fijne app! Jammer dat het vrij prijzig is en niet de optie bevat om levebslang aan te schaffen."},
{"source": "google", "author": "Suzanne M", "content": "Helaas na bijna 4 jaar heb ik ook die irritante energie levels gekregen, net zoals nieuwe en iPhone gebruikers. De lol gaat er nu wel af want als ik dan dubbele XP krijg voor zoveel minuten dan zie ik dat niet terug bij de tijd, alleen nog de minuten die ik had. Vervolgens heb je geen dubbele of driedubbele XP meer en vaak ook nog geen energie meer om het te volbrengen."},
{"source": "google", "author": "Len Lestaeghe", "content": "Ik kan geen chess leren terwijl er aangegeven word dat alle andere mensen dit wel kunnen. Waarom kan ik het niet? En kunnen jullie het fiksen? Hopelijk word sit probleem snel opgelost!"},
{"source": "google", "author": "K V", "content": "Sinds het energie balkje kun je maar 2 lessen doen. Jammer 👎"},
{"source": "google", "author": "Wendy Pendy", "content": "Went from 5 stars to 1. Was great, now sucks because of the change from hearts to energy. Please fix this duolingo. I am looking for another learning program. And I am not the only one. Almost 700 days."},
{"source": "google", "author": "Eleanor Kuilman", "content": "The course is too easy, the math and music isnt available for some reason. Where do i get that?"},
{"source": "google", "author": "R Terpstra", "content": "sucks after the update. the energy levels sucks give us the prefious harts back"},
{"source": "google", "author": "brenda Brenda van soest", "content": "het is zo leerzaam"},
{"source": "google", "author": "Warto", "content": "New energy system discourages learning."},
{"source": "google", "author": "Toussaint Biesmans", "content": "leuk en leerzaam"},
{"source": "google", "author": "Jacobien Ten Berge", "content": "top app!"},
{"source": "google", "author": "Martijn Scholtens", "content": "The app is great, but the notification system is horrible and pushy. I understand that you want to drive app engagement, but it is insane to remind people every day in the app that they turned off notifications (since they don't like your push approach). The app icon faces that show a level of anger I was not aware it existed, is another annoying thing (and thus removed your icon from my homescreen). To me this is a fantastic excuse to move to the next good language learning app."},
{"source": "google", "author": "Hendrika De Wit", "content": "leerzaam"},
{"source": "google", "author": "B. v. Kessel", "content": "het was een fijne app maar sinds de hartjes zijn veranderd in energie is het veel minder leuk. Je kunt veel minder lessen maken op een dag, tenzij je betaalt of eindeloos veel advertenties bekijkt. Hopelijk passen ze dit nog aan."},
{"source": "google", "author": "Frans Van der Velden", "content": "super fun learning... just don't miss your lesson...or else something will happen..."},
{"source": "google", "author": "marion van Cruchten", "content": "1 ster omdat ik niet meer relaxed mijn lesjes kan doen. Door het energiesysteem moet je nu razendsnel door je lesjes heen. Geen tijd om goed te kijken en de zinnen te herhalen. Zonder ook maar 1 fout te maken kan ik hooguit 2,5 lesjes maken. Dit is echt balen, ik vond het zo'n leuke app, maar nu niet meer."},
{"source": "google", "author": "Karima Ambari", "content": "het is heel leuk spel"},
{"source": "google", "author": "Jettie Schelhaas", "content": "eerste kennismaking tot nu toe leuk en leerzaam"},
{"source": "google", "author": "Robert de Keijzer", "content": "new energy update sucks"},
{"source": "google", "author": "Leo Ruinard", "content": "spelender wijze leren."},
{"source": "google", "author": "Noes 1974", "content": "erg makkelijk om een nieuwe taal te leren alleen jammer van de reclame die je moet kijken om sneller te willen leren. maar verder top!"},
{"source": "google", "author": "kevin crabbe", "content": "echt leuk je kan in 1 dag een nieuwe moeilijke taal leren"},
{"source": "google", "author": "Olivia Arts", "content": "De nieuwe update met energie is helemaal niks. advertenties spelen niet af en je krijgt dus geen nieuwe energie erbij. Het loopt ook super snel leeg. Geen idee waarom dit is gedaan"},
{"source": "google", "author": "Willie Koelewijn", "content": "Superleuk om elke dag wat woorden/zinnen te leren."},
{"source": "google", "author": "Richard Roozendaal", "content": "Jammer dat de hartjes zijn vervangen door energie. Het lijkt erop dat Duolingo alleen geld wil zien ipv een leerervaring te bieden. Misschien toch eens zoeken naar een app waar dit soort dingen niet worden gedaan? Jammer Duolingo..."},
{"source": "google", "author": "Ali Dur", "content": "Learn well in Turkish."},
{"source": "google", "author": "Sebnem Bosman", "content": "leuke manier om les te leren"},
{"source": "google", "author": "Janice van Ginkel", "content": "het is superleuk, maar soms kloppen zinnen niet"},
{"source": "google", "author": "Marije Labrujere", "content": "Sinds het omzetten van de hartjes naar een batterij is de app echt heel erg achteruit gegaan. Het gaat hier steeds meer om geld. Niet oke!"},
{"source": "google", "author": "Qi Gong", "content": "The points system is completely wrong. How is it possible that if you don't make any mistakes, you still end up with 0 points for 2 lessons?!"},
{"source": "google", "author": "Sani Al-Moussa", "content": "The new energy system, which replaced the original heart system, is absolutely horrible. The five hearts system wasn't amazing, but at least you didn't get punished for finishing lessons. Sometimes you do get rewarded some energy \"points,\" but it isn't enough. The app itself was quite good for language learning (except for Arabic and Hebrew, Hebrew missed a lot of sounds and stuff, and Arabic had grammar mistakes and too literal translations) and for cognitive things."},
{"source": "google", "author": "Arda Ayguzer", "content": "Kan geen chess lessen vinden"},
{"source": "google", "author": "marleen dufour", "content": "leuk om te doen💪"},
{"source": "google", "author": "Joyce Brugman", "content": "je leert talen bevoordeeld engels a s je dat nog niet weet of Duits of arabisch je leert het allemaal op duolingo daarom je ik deze app het leert me engels op een goede en leuke manier"},
{"source": "google", "author": "Dhr Karamanoğlu", "content": "echter zijn er toch nog wat enige fouten te vinden."},
{"source": "google", "author": "Nianne Wierckx", "content": "sinds het veranderd is dat je energie krijgt is het niet leuk meer. energieniveau gaat tijdens de oefeningen heel erg snel omlaag. vandaag 31 okt. weer les gedaan. 1e oefening 0 fout. energie al gezakt onder de 10. 2e oefening tot vraag 8. o energie. niet leuk dit. ik ga het nog paar dagen proberen. veranderd er niets stop ik na 880 dagen🥲"},
{"source": "google", "author": "Wim Godderis", "content": "het vervangen van de hartjes door een batterij maakt het niet meer leuk"},
{"source": "google", "author": "Faya Laarman", "content": "het is zo handig want je leert het door een spelletje te spelen zo leuk"},
{"source": "google", "author": "Een Google-gebruiker", "content": "Het is heel laagdrempelig en leuk"},
{"source": "google", "author": "Monica van Harten", "content": "vreselijk dat nieuwe gedoe met energie, alles kost energie ook al doe je het goed!!! je kunt nog maar max 3 lessen doen. Wil je meer dan ben je verplicht filmpjes te kijken voor energie. Of flink betalen!! Met de hartjes werkte het stuk beter. Deed je het goed dan kostte het geen hartjes. Nu kun je met foutloos spelen zelfs maar een paar lessen doen. Echt belachelijk!! speel dit al ruim 2 jaar met veel plezier, maar nu???"},
{"source": "google", "author": "SHAYNE_gamez", "content": "the chess course is very fun"},
{"source": "google", "author": "Melissa", "content": "I have a 1400+ day streak going on and I've seen the app suck more and more. More errors, ads, AI use and now they changed the hearts for energy. Can't even do 5 minutes of learning without them forcing you to pay money. Duolingo has planned it's own downfall. I hope everyone will stop paying money and this money wolf developer will learn this lesson by losing all paying customers."},
{"source": "google", "author": "Marnix Viergever", "content": "Ideale app om een taal te leren, gratis maar wel met advertenties. Fouten worden herhaald, maar kost je hartjes. Echter door advertenties extra te kijken kun je blijven leren. Echter sinds de nieuwe energy update kun je als niet betalende gebruiker slechts een paar lessen per dag doen, zelfs als je advertenties kijkt krijg je niet genoeg energy. Het leren gaat hierdoor langzamer, en Legendary lessen zijn nu alleen voor betalende gebruikers (kostte voorheen kristallen)"},
{"source": "google", "author": "Sara Owel", "content": "Sinds de hartjes weg zijn is het echt niet meer leuk om te spelen. Energie is zo leeg ook als je foutloos speelt. terwijl ik eerst gewoon lange tijd kon spelen is het nu met 5 minuten klaar. WAARDELOOS!!"},
{"source": "google", "author": "Arne Maes", "content": "nieuwe energie systeem ipv hartjes maakt deze app waardeloos, als dit niet snel terug veranderd, zal ik het niet lang meer volhouden en opgeven"},
{"source": "google", "author": "Charlotte Kroon", "content": "top"},
{"source": "google", "author": "Lizzy Delhy", "content": "Die nieuwe energie is echt heel demotiverend. Vriendenmissies worden haast onmogelijk en het dagelijks spelen is zo echt niet leuk meer. Dit is echt een misser. Hopelijk komen de hartjes terug!"},
{"source": "google", "author": "Robby Neuville", "content": "Het gaat niet meer om kennis verspreiden maar enkel en alleen om het geld"},
{"source": "google", "author": "lieselotte thone", "content": "goed, soms wel fout in!"},
{"source": "google", "author": "Rowan Fortuin", "content": "Leuke app, maar jammer dat als je een abonnement wilt, dat je dan meteen voor een heel jaar moet betalen, in plaats van maandelijks. Daarom moet ik het helaas met de gratis versie blijven doen."},
{"source": "google", "author": "Patrick Baks", "content": "great app to learn a language!"},
{"source": "google", "author": "Melanie Bax", "content": "De update van hartjes naar energiebar is om te huilen. Je wordt gestrafd voor je perfecte levels, gezien het meer energie kost dan oplevert. Zonde..."},
{"source": "google", "author": "keano van velzen", "content": "maak het wat leuker"},
{"source": "google", "author": "Sander Zeepvat", "content": "Sinds de update met bliksems kan je niet meer normaal 2 lessen doen, ook al heb je alles goed. erg slecht. als dit aanblijft zal ik, maar ik denk ook vele andere, een alternatief gaan uitproberen."},
{"source": "google", "author": "Bean", "content": "Used to be great, but the new update ruined the app for anyone but the most casual learner. The new 'energy system' was marketed as being beneficial to learning, but is actually just a downgrade to make people pay for the premium version."},
{"source": "google", "author": "MiPo", "content": "The app started out great, now the owners are just focussed on grabbing money. The number of ads increased over time to intolerable amounts and the number of lessons you could do without paying decreased over time to a point where the app is useless. Once it was a great way to learn a new language, now the app is just garbage."},
{"source": "google", "author": "Famthomp", "content": "het goed want je kan goed leren"},
{"source": "google", "author": "Danielle van Helvoirt", "content": "fijne app om te leren, maar regelmatig lang onderhoud"},
{"source": "google", "author": "sonja macht", "content": "helpt lezen, schrijven maar zeker ook praten. Groot voordeel vind ik dat je in je eigen tempo kunt leren: of dat nu snel of traag is. Ook vind je je zwakke punten en leer je die versterken. Bovendien LEUK om te doen. topapp. En ook voor mijn kleine beurs nog betaalbaar"},
{"source": "google", "author": "Monique Steijn", "content": "Veel herhaling dus dat leert fijn."},
{"source": "google", "author": "Sanne Van Heerde-Dijkstra", "content": "ik vond het een leuke manier om talen weer op te halen of nieuw te leren. Helaas kan ik door het energiesysteem nu max 2 lessen doen. Niet genoeg om iedere dag 2 of 3 talen bij te kunnen houden. De leertijd wordt zo te kort om echt een leereffect te krijgen. Jammer."},
{"source": "google", "author": "Nina van den heuvel", "content": "since the last update the game has really gone down hill. No more hearts for life but an energy bar which takes of energy even if the answers are correct. This means you can play max 2-3 games a day without having to refill.. They try to make you buy the paid version and sell it as a free lamguage learning game but started using AI for voices now too."},
{"source": "google", "author": "Familie Servaas", "content": "goed ik kan goed leren"},
{"source": "google", "author": "Berend Veldkamp", "content": "With the stupid Energy system that was recently introduced, you can finish no more than two lessons before running out of energy. I'm sorry we cannot give less than one star"},
{"source": "google", "author": "Hiyab Tseadu", "content": "dit app is echt heel erig leuk en goed ik geef het echt 10/10 steren het is erg leuk want als je geen Engels bevoorbeel kan dan kan Duolingo je helpen. en ookemet rekken"},
{"source": "google", "author": "Sylvia Schiphorst", "content": "ik kan geen schaken doen niet leuk"},
{"source": "google", "author": "Jaylen Beltman", "content": "Goede taalleerapp, gigantisch naadeel is het energiesysteem, het duurt ontzettend lang om op te laden en kost veel te veel diamanten om volledig op te laden. Irriteert mij mateloos."},
{"source": "google", "author": "Elf Nanoha", "content": "leuke handige vrolijke app"},
{"source": "google", "author": "Tyson Henraath", "content": "bring back hearts smh"},
{"source": "google", "author": "Rita Timmers-Rohaan", "content": "Super irritant die nieuwe manier van werken met het energie (batterij) ding. Opzichtige manier om je richting betaalde versie te laten overgaan. Ook al maak je 0 fouten, binnen twee lesjes moet je minstens 4 advertenties bekijken om verder te kunnen. Wat een flop!!"},
{"source": "google", "author": "Suus", "content": "het is echt super leerzaam"},
{"source": "google", "author": "Alex", "content": "Goed en makkelijk om een andere taal te leren, jammer dat er zoveel reclame is"},
{"source": "google", "author": "jan hein Matze", "content": "moeilijk zonder te betalen"},
{"source": "google", "author": "Iris Gauw", "content": "@Duolingo, you must really, really hate the users of your app, to come up with this horrible new energylevel-system!"},
{"source": "google", "author": "Marlies Bomhof", "content": "Nieuw energiesysteem maakt leren niet leuk meer!"},
{"source": "google", "author": "Maya Mertens", "content": "ik vind het heel leuk en ik kan er ook goed uit leren"},
{"source": "google", "author": "Lindeke de Corte", "content": "was heel leuk, maar sinds de update waarbij hartjes zijn vervangen door energie, waardeloos."},
{"source": "google", "author": "Marcel Postma", "content": "Werkt goed en inspirerend. fin dat ik het op de momenten kan doen die mij goed uitkomen en ik op een leuke manier gemotiveerd gehouden word."},
{"source": "google", "author": "Sebastien Teichmann", "content": "gemakkelijk in gebruik, leuk om in italie jezelf te kunnen uitdrukken en dingen te verstaan"},
{"source": "google", "author": "Vanessa Danneels", "content": "uitdagend en leerrijk!"},
{"source": "google", "author": "Paul Catry", "content": "Leuke dagelijkse korte bezigheid en je leert nog wat bij. Jammer dat je moet betalen om geen advertenties te krijgen."},
{"source": "google", "author": "Andries Schilt", "content": "prima app maar jammer van de energiemeter."},
{"source": "google", "author": "Nel Depuydt", "content": "een hele leuke app"},
{"source": "google", "author": "Vera Selles", "content": "geweldig leerzaam op een makkelijke mannier"},
{"source": "google", "author": "Helena Saban", "content": "je kan alles leeren wat je wilt!!!!!!!♤♡{▪︎□♤》○"},
{"source": "google", "author": "Donny Oudekerk", "content": "erg goe"},
{"source": "google", "author": "Ramona De Graaf", "content": "ik vind die hartjes van voorheen beter dan maar zo kort te tijd te hebben om een opdracht af te ronden daarna moet je zoveel reclames kijken om weer verder te kunnen en hij loopt de laatste tijd steeds vaker vast."},
{"source": "google", "author": "marieke peeters", "content": "Wat een mega stom systeem die batterij. 2 lessen en halverwege de 2de moest ik stoppen omdat de batterij op was. Met maar 2 fouten had ik met de hartjes nog makkelijk door kunnen gaan. Geld klopperij. Zo leer je niks."},
{"source": "google", "author": "Maarten de Witte", "content": "Completely useless. Since they've introduced energy instead of hearts you can get a maximum of one lesson before your energy runs out and you'd have to watch tons of adds to get more energy unless you buy SuperDuolingo. It isn't focused on teaching its users anymore. It's focus has shifted to money entirely"},
{"source": "google", "author": "Noor", "content": "vroeger denk de ik dat het niet leuk is MAAR NU VIND IK HET COOOOOOL 5 STEREN en ik leer dukts en spaans Kaffee mit Tee bitte hehe"},
{"source": "google", "author": "Dani van der Linde", "content": "hele fijne leer app, maar wel een beetje gek dat je begint met leren van eten in plaats van jezelf voorstellen."},
{"source": "google", "author": "Rixt Hansma", "content": "het is goed leerzaam. en leuk om te doen"},
{"source": "google", "author": "Joy Talloen", "content": "De batterij update is waardeloos, wie gemotiveerd een uurtje per dag wilt oefenen is eraan voor de moeite. Zelfs voor juiste antwoorden wordt je gestraft en loopt de batterij leeg, waardoor je hooguit enkele lessen kan voltooien. Tip: Wat leuk zou zijn is als je vb. voorbij het 4e checkpoint bent, je de voorgaande kunt dichtklappen, zodat je bij het openen van de app niet steeds een heel einde naar beneden moet scrollen"},
{"source": "google", "author": "Rutger", "content": "erg leuk en verslavend, wel duur"},
{"source": "google", "author": "Mister R", "content": "From 5 stars to 1. 4 stars for the decision of Energypoints. Need I say more? cause of this decision ive lost the chance of gaining the badge of this month. For now, I will delete the app. hopefully Duolingo will remember is all about fun and learning new things for people and not about gaining money :("},
{"source": "google", "author": "R. Ruhof", "content": "Its a fun program, The new energy system, instead of hearts, i like less. Now my energy meter keeps draining, and I can't make it always to the end of the 2nd lesson.. i tried duolingo max. but i often cant understand the by Lily spoken text. And there is no option for subtitels and/or slower speach. otherwise i would have subscribed."},
{"source": "google", "author": "Melissa Reijnders", "content": "Ook ik ben zwaar teleurgesteld in de wijziging naar energie ipv hartjes. De app is nu alleen nog maar bruikbaar als je ervoor betaalt en die prijzen liggen veel te hoog."},
{"source": "google", "author": "dylan vandamme", "content": "energy system sucks"},
{"source": "google", "author": "Anthony de Prince", "content": "switch to battery instead of harts sucks. playing lessen"},
{"source": "google", "author": "벤티", "content": "the battery thingy needs to go back to the hearts, people don't like it, it's always going down even if you don't make mistakes"},
{"source": "google", "author": "Marc van Leeuwen - Phùng", "content": "Changed it from a 5 star to a 2 star. After a year of learning, I decided to pay for pro. That is a bit of wasted money. It enabled me to learn faster. Or better said, I got through lessons faster, but learned less. After nearly a year I picked it up again and this time it went well. But now they introduced \"energy\", to punish those of us who take a bit longer to answer a question. I answered everything correct, but still lose. Making clear I am an unwanted student. down to 1 star now."},
{"source": "google", "author": "Guillaume Macor", "content": "Goeie app om laagdrempelig een nieuwe taal te leren. Maar het energie-systeem bederft de pret. Eerst verloor je een 'leven' als je een fout maakte. Nu betaal je energie om een vraag te beantwoorden. Je krijgt net genoeg voor twee lessen. In het oude systeem deed ik er makkelijk 5 per dag. Je kan betalen voor meer energie. En dat zal ook wel het doel zijn, gewoon geldklopperij."},
{"source": "google", "author": "Lina Gheysels", "content": "Duolingo heeft me veel geholpen om beter te worden in verschillende talen. Het zijn makkelijke lessen maar je leert er heel veel mee. Je kunt altijd een hoofdstuk opnieuw maken om te herhalen, dus als iets wat moeilijker ging, kan je het altijd herhalen om het beter te begrijpen. Duolingo is voor mij de ideale plek om een nieuwe taal te leren!"},
{"source": "google", "author": "Deborah Bosma", "content": "ik vond het super leuk, was ook erg trots dat ik al 1 jaar bezig was. elke avond even oefenen. deed 2 cursussen. ik keek er altijd naar uit. helaas zijn ze over gegaan naar een batterij dat op tijd gaat. en niet meer om hoeveel fouten je maakt. voor mij betekent dat ik dus maar 1,5 les kan doen. ik vind dat erg jammer 😢 soms net 1 les, het is niet eens meer mogelijk om even goed te lezen van nieuwe woorden. meedoen met een dag challenge lukt ook niet meer. laat staan meer talen of muziek 😭"},
{"source": "google", "author": "Elem Tasci", "content": "ik ben niet blij met de vervanging van de hartje met de energie, ook als ik geen fouten maak, is mijn energie op. ik heb geen zin meer om door te gaan met mijn dagelijkse oefening."},
{"source": "google", "author": "Ilona De Groote", "content": "Sinds de batterij in plaats van de levens is er niet meer te leren. Je moet doelen halen, maar kan maximaal 3 lessen per dag doen."},
{"source": "google", "author": "Laura Rampelberg", "content": "Zeer jammer dat er bij elke zin energie weggaat. Het hartjessysteem was veel beter. Je kon blijven spelen en leren."},
{"source": "google", "author": "Felien Welman", "content": "it works really well! i havent had any glitches yet in the 3 years ive been using this"},
{"source": "google", "author": "Noyb Ednm", "content": "die energie slaat nergens op. ik heb geen fouten gemaakt en heb al 2 keer energie midden in een les moeten bijkomen omdat mijn energie zogezegd op is. ik wil terug hartjes!!!"},
{"source": "google", "author": "Josh V E", "content": "Het is leuk om te leren op z'n manier."},
{"source": "google", "author": "Baritte Kornet", "content": "leuk je kan er van alles mee"},
{"source": "google", "author": "Kobe Willems", "content": "sava goed om talen te leren"},
{"source": "google", "author": "Tom Bruins", "content": "ik vindt het echt super leerzaam alleen ik had wel verwacht dat er niet na elke les een advertentie komt want ik heb nog nooit een app gezien zonder advertentie behalve de soorten apps zoals whatsapp en camera maar als het zou lukken om geen advertentie er meer in te plaatsen dan zou ik 5 sterren geven dankjewel alvast ☺☺"},
{"source": "google", "author": "Jonathan", "content": "Add tagalog"},
{"source": "google", "author": "Lilian Bleize", "content": "leuke manier om gratis een andere taal te leren ( of op peil te houden). Dat was mijn review een paar jaren geleden. Helaas is de hartjesmeter vervangen door een energie meter. Die loopt gewoon leeg, zelfs als je foutloos je lesjes doet. Op deze manier ben je gedwongen om een betaalde versie te nemen óf te stoppen. Ik stop. Gloeiend irritant!"},
{"source": "google", "author": "Demi", "content": "waar slaat dit op, waarom zou je je app zo verpesten omdat je wilt dat mensen een bizar bedrag per maand gaan betalen?"},
{"source": "google", "author": "Sara Blanpain", "content": "het systeem met de energie is echt slecht, je kan amper 2 lesjes volgen. Graag terug de hartjes!"},
{"source": "google", "author": "Marinus", "content": "waardeloos geworden na de update. je wordt gedwongen om te gaan betalen door het nieuwe puntensysteem. als dit zo blijft ga ik wat anders zoeken."},
{"source": "google", "author": "Diet Vonk", "content": "heel overzichtelijk"},
{"source": "google", "author": "Shabnam Mahmoud", "content": "dit is een goede leermanier maar ik denk dat het beter is als je bij oefenen voor energie de hele energie Oplaat"},
{"source": "google", "author": "JP Fuzz", "content": "energy even worse than hearts..."},
{"source": "google", "author": "Simone Vos", "content": "Ik speel al 4 1/2 jaar met veel plezier duolingotot ik waseen groot en enthousiast duolino fan! maar.....wat ballen na zoveel dagen oefenen(1300+!!!) is de nieuwe batterij i.p.v. 🤍🤍🤍 afschuwelijk!!!! Na 2 dpelletjes zonder fouten is je batterij al leeg??? Ik vind er zo geen bal meer aan zo! Het is jammer van het spel! Maar op zoek naar een nieuwe app als het zo door gaat! Hoop dat het vlug hersteld wordt!"},
{"source": "google", "author": "Liam Serkeyn", "content": "dezr app helpt niets met je taal leren ik doe het al 101 dagen en kan er niks zoek een andere app als deze want als je deze app gebruikt blijf je vast zitten DEZE APP IS EEN SCAM!!!"},
{"source": "google", "author": "Anastasia Klomp", "content": "een heel leuk app voor taalen"},
{"source": "google", "author": "sharon Loth", "content": "ik haat deze update, je kan je lessen niet afmaken je energie is op voor je een les kan voltooien . boooo. als jullie dit niet terug draaien gooi ik jullie eraf dan maar geen missies IK HAAT JULLIE NIEUWE UPDATE MET ENERGIE IPV HARTJES DIT WERKT NIET MEE OM JE DAGMISSIES TE VOLDOEN"},
{"source": "google", "author": "Vande Reyde", "content": "Heel leuk, je leert er veel mee!"},
{"source": "google", "author": "Christel Goyvaerts", "content": "het is een zeer goede app"},
{"source": "google", "author": "peter hartog", "content": "erg leerzaam"},
{"source": "google", "author": "Nikita Leshukov", "content": "The new energy system is frustrating."},
{"source": "google", "author": "Ramazan Bejzaku", "content": "What it's like do a week for a dual lingo promotion desert for gratitus. I an abolic matter, less odds and truth. Anxiety in which stop method Class are you coming during the prime during my campaign account? Does delete an economic villa, Swan kutin?"},
{"source": "google", "author": "Chelsey", "content": "The energy system is terrible. Hearts weren't great but they were a lot better than this. Duolingo got too greedy, too bad."},
{"source": "google", "author": "Lé", "content": "Leuker dan een spelletje"},
{"source": "google", "author": "Jesper Wentink", "content": "The new energy system ruins the experience for free users. Even with perfect lessons you run out of energy in just a few minutes. Do not recommend until they switch back to hearts."},
{"source": "google", "author": "Marthe Huisman", "content": "Het nieuwe systeem met energy is echt heel frusterend. Je kan nog geen twee lessen doen en je weet niet goed of je nog een les kan starten."},
{"source": "google", "author": "Luc Dalle", "content": "de energie is afgrijselijk slecht en werkt demotiverend"},
{"source": "google", "author": "Sharkie", "content": "This new energy system is so trash, I cant even do 1 kanji lesson with it."},
{"source": "google", "author": "Ad", "content": "vertaling is niet altijd goed, jammer kan beter"},
{"source": "google", "author": "I", "content": "Lid sinds dec 2016. Sinds enkele maanden regelmatig incorrecte grammaticale vertalingen van het Nederlands naar het Frans. Daarnaast slechte zinsopbouw of een onjuiste vertaling van woorden. Onbetrouwbaar cursusmateriaal om een taal goed te kunnen leren. Wellicht door de in gebruikname van AI? Ik krijg de indruk dat de cursist wordt gebruikt om AI te trainen. Jammer."},
{"source": "google", "author": "Suzanne Van Vliet", "content": "leuk laagdrempelig leren"},
{"source": "google", "author": "PN", "content": "De cursus Engels is slecht, Amerikaanse uitspraak en vertalingen zijn soms niet goed. Het is echt Amerikaans gericht"},
{"source": "google", "author": "Enno de Bruin", "content": "The new energy system breaks the game for me now like a lot of people allready said even though if you dont make mistakes the energy drains too fast it feels so unfair now to play. Please refert back to hearts u still get enough revenue with the adds."},
{"source": "google", "author": "Merveille Donselaar", "content": "Het ligt er aan welke taal je leerd Engels is heel makkelijk maar Korea leren dat is weer een andere verhaal en het stomme is dat je niet een uitleg krijgt of zo en dan moet je de tekens wel kennen anders is het te moeilijk. Maarrrrrrrrrrrrr beste leerzame app ooit! en je kunt ook muziek doen en rekenen fantastisch!!! zeker een AANRADER!!!!!!!"},
{"source": "google", "author": "Verena _001", "content": "This app used to be great... Also who's idea was it to swtich from hearts to energy?? horrible decision."},
{"source": "google", "author": "Dave Z", "content": "zonder energie graag"},
{"source": "google", "author": "Ineke Basteleus", "content": "Onmogelijk om nog iets bij te leren met het nieuwe energiesysteem als je het gratis wil doen, ik kan amper 2 lessen nog per dag doen."},
{"source": "google", "author": "Kees Bond", "content": "hte is leuk maar ook leerzaam en ik heb er al een superveel van geleerd"},
{"source": "google", "author": "Gio Bu", "content": "ja ik vind de reclames vervelend en ik vind dat je alle talen via nederland moet kunnen doen dat zouden jullie nog kunnen verbeteren"},
{"source": "google", "author": "jelger deddens", "content": "wat een stomme app wordt dit. nu met de energielevel die steeds lager wordt. geen levens die je verkiest maar engerie wat je kwijt raakt. ze doen werkelijk alles je maar over te halen tot betalen."},
{"source": "google", "author": "TheMercyful Emperor", "content": "Adding energy that can end your lessons halfway through is an amazing way to punish people that want to learn a new language 👍🏻"},
{"source": "google", "author": "Erik S", "content": "I agree with everyone complaining about the new “energy” system. Replacing hearts with this nonsense ruins the whole experience. Instead of helping people learn, it now punishes you for trying. My guess is that the ratio of paying users has reached some sort of positive balance, so free users are no longer important to them. It’s a clear management failure, they had a great app and turned it into a frustrating cash grab. Maybe time to exit shares before the app crashes completely."},
{"source": "google", "author": "Thomas Smidt", "content": "love the chess course but I hate the energie concept because with hearts if you dont make a mistake you can keep practicing but with energie you neet to buy it to get going if you run out even when you dont make any mistakes"},
{"source": "google", "author": "Ismay de Jong", "content": "The new energy system is really awful. Totally ruined the app for me"},
{"source": "google", "author": "sankoo georgio", "content": "no explanations, no option to look at a previous screen"},
{"source": "google", "author": "Linda Pijpers", "content": "The shared score on LinkedIn is not correct, I did a English course and reached a score of 130. On my LinkedIn account it shows I have a Dutch score of 130, a course I never did? Dutch is my mother tongue didn't need or do a course for that. Besides that, I can't continue my English course to get a better score?"},
{"source": "google", "author": "Niels Kooman", "content": "nieuwe batterij systeem beperkt het leren en effectiviteit van de app aanzienlijk"},
{"source": "google", "author": "Lily Szeplaki", "content": "Eerder zou ik het 4 sterren geven, want Duolingo is een fantastische app, maar hij maakt de hele tijd reclame voor schaaklessen en die kan ik niet zien. Noch bij de Nederlandstaligen noch bij de Engelstaligen."},
{"source": "google", "author": "Een Google-gebruiker", "content": "Toffe manier om een taal te leren"},
{"source": "google", "author": "任鑫涛", "content": "Been using app for years, it's a shame to see the free language app we all used to love is coming more and more pay for our services. The new energy system is ridiculous, the heart system was bad enough for beginners to a language. Now you can barely complete 2 lessons depending on the length of them."},
{"source": "google", "author": "Nav3000", "content": "super goed om te leren"},
{"source": "google", "author": "kim jacobs", "content": "Het nieuwe energie-systeem ipv hartjes is echt niet motiverend! Je verliest altijd energie, zelfs als je goede antwoorden geeft of perfecte lessen maakt. Echt jammer 😔"},
{"source": "google", "author": "Albert Strijk", "content": "moeilijker dan je denkt, maar dit helpt je echt een taal te leren"},
{"source": "google", "author": "Yvonne Van Roosmalen", "content": "heel leuk om zo een taal te leren"},
{"source": "google", "author": "Ilse S", "content": "kan gevaarlijk worden mijn duo kijkt echt eng als ik een dag niet oefen👹"},
{"source": "google", "author": "Nicolas Van Damme", "content": "energy system really for a language learning app i understood the heart system a bit, but energy do you want to stunt energetic learners even more? 1/5 change it back or see your user base dwindle for better language learning platforms"},
{"source": "google", "author": "Lou Wistje", "content": "Sinds de nieuwe update naar het energiesysteem is de lol er wel echt vanaf. Door de update is het bijna niet meer te doen, je wordt gedwongen om nóg meer advertenties te kijken dan voorheen. Als kers op de taart zijn de betaalde abonnementen flink omhoog gegaan in prijs. Niet meer leuk dus."},
{"source": "google", "author": "Wandena Weemen", "content": "je kan super goed en veel talen leren op een leuke manier"},
{"source": "google", "author": "Marjolein Knoops", "content": "Sinds de hartjes vervangen zijn door energie, ben je wel erg snel klaar. Het geeft zo weinig mogelijkheden om een taal te leren in dit nieuwe energie systeem dat ik de zin om door te gaan verloren heb. Voordat je goed en wel bezig bent, houdt het al weer op, de motivatie daalt hierdoor naar een dieptepunt. Erg jammer!"},
{"source": "google", "author": "Jur", "content": "This app used to be about learning new languages. Now it just is about money. In the past there was room to make mistakes and learn from them, now you are pelanised for making mistakes and kicked out of your session for making one. That you use ads to generate profit is fine by me, but that you purposely make the app worse so people will pay 20$ a month just to use it is just absurd. Get rid of the hearts and energy system you scammers."},
{"source": "google", "author": "Vera Van Riel", "content": "super leerzaam zou wel willen dat ik een taal nog iets kan verhogen zelf omdat ik merk dat het toch te makkelijk is"},
{"source": "google", "author": "Timo Tra", "content": "super leuk en heel leerzaam!"}
]