{
  "name": "Lingo Legend Language Learning",
  "google_package": "com.hyperthought.lingolegend",
  "google": {
    "title": "Lingo Legend Language Learning",
    "description": "Learn a language while playing language learning games! Master Spanish, French, Mandarin, Korean, Japanese, Italian, German, Portuguese, Dutch, or Russian with our innovative language learning games. Dive into a fantasy world where learning languages is an adventure. Now featuring two exciting game modes!\r\n\r\n*Farm Mode*\r\n- Practice your language skills in a cozy, relaxing environment within the enchanting world of Lingo Legend.\r\n- Plant and harvest crops, unlocking infrastructure to expand your farm.\r\n- Customize your dream farm with tons of unique decorations.\r\n- Breed and care for adorable farm animals, the naala.\r\n- Meet new villagers and build lasting friendships.\r\n\r\n*Adventure Mode*\r\n- Test your language learning skills in strategic monster battles.\r\n- Draw ability cards from a personalized deck and answer language flashcards to use them.\r\n- Collect cards, choose your strategy, and build your deck.\r\n- Embark on perilous journeys, meet captivating characters, and complete quests.\r\n- Explore a dynamic, mysterious world filled with beautiful landscapes.\r\n- Find recipes, gather materials, and craft gear to gain experience and style.\r\n- Play as a customizable avatar with unique gear to collect and equip.\r\n- Personalize your camp with tons of unlockable content.\r\n\r\nDeveloped by language learning experts, Lingo Legend offers over 200 categories of grammar, vocabulary, and common phrases. It's the perfect app to complement or kick-start your language learning journey. Lingo Legend isn't just another language learning app—it's a real game!\r\n\r\n*Supported Languages*\r\n- French (France & Canadian)\r\n- Spanish\r\n- Japanese\r\n- Korean\r\n- Mandarin Chinese\r\n- German\r\n- Italian\r\n- Portuguese (Brazilian & European)\r\n- Dutch\r\n- Russian\r\n\r\n*Educational Features*\r\n- Developed by language learning experts passionate about keeping you engaged.\r\n- Learn words and phrases relevant to everyday life with themes like Ordering Food and Meeting New People.\r\n- Ensure long-term retention with our spaced-repetition algorithm.\r\n- Define your learning path and practice what you want, when you want.\r\n\r\nDownload Lingo Legend now and revolutionize your language learning with fun and interactive language games!\r\n\r\nHave questions? Want to connect with us?\r\nContact support - support@lingolegend.com\r\nJoin Discord - https://discord.gg/TzWJSfzf4R\r\nFollow on Twitter - https://twitter.com/LingoLegend\r\n\r\nPrivacy Policy - https://www.lingolegend.com/privacy-policy\r\nTerms of Use - https://www.lingolegend.com/terms-of-use",
    "rating": 4.775128,
    "rating_text": null,
    "ratings_total": 8389,
    "ratings_histogram": [
      156,
      127,
      170,
      527,
      7401
    ],
    "installs": "100,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 3,
      "review": "please! 5 stars when u add Dutch > Spanish or Dutch English 🙏",
      "date": "2025-06-20T00:21:12"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "I love it! The first app where I can't wait to learn. Making some fast and great progress.",
      "date": "2025-01-15T16:21:46"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "Fun way to learn a language just a few things 1. pls Add that I can turn the game up louder in the game settings so that I can learn and listen to music 2. If I made a spelling mistake let me rewrite it, I don't want any points for it, but if I never correct my mistake then I will never learn from it Except that I like it",
      "date": "2023-10-27T07:49:26"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Looks nice, but can't sign up. Not with Google or mail. It either crashes or keeps loading. Been trying for more than 45 minutes now. (Would have stopped a long time ago if there wasn't music, and if I had something better to do). Edit tried everything btw; restarting, clearing data, clearing cache.",
      "date": "2023-08-11T09:21:12"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "I love it (but only because i paid for it). I'd love it if the game expanded. More languages like Russian and Swedish and better ways to practice the languages as a whole instead of just words and sentences.",
      "date": "2023-08-10T18:41:00"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "The app randomly froze and is now permanently stuck at the loading screen. What do I do?",
      "date": "2023-07-28T04:19:22"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "It doesn't really work..the stamina cost so much that i can do only one battle every 12 hours.. so i learn spanish very very slow",
      "date": "2023-06-20T15:08:21"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "great app fun game",
      "date": "2023-04-03T05:56:52"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Really nice idea and game!! My compliments! The only issue that I'm having is that the waiting time for energy to regain is way too long which makes it less fun to play without paying",
      "date": "2023-02-17T19:15:06"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "There was no Sweden, You don't have alot of language...",
      "date": "2023-01-14T23:42:24"
    }
  ]
}