{
  "name": "QuillBot - AI Writing Keyboard",
  "google_package": "com.quillbot.mobile",
  "google": {
    "title": "QuillBot - AI Writing Keyboard",
    "description": "Write without limits with QuillBot. Your all-in-one AI assistant for Android.\r\n\r\nQuillBot makes writing, editing, and communicating effortless. Our free AI app combines a Paraphraser, Grammar Checker, Translator, and AI Detector with generative AI features—and now document management—so you can write and save your work anywhere, never losing progress.\r\n\r\nParaphrase, fix mistakes instantly, detect AI content, translate in seconds, generate ideas, and more—all in one workspace.\r\n\r\nWith tools to manage documents and create on the go, QuillBot is your complete AI writing assistant—helping ensure your content is clear, correct, and compelling.\r\n\r\n<b>🚀Key Features:</b>\r\nParaphraser, Grammar Checker, Translator, and AI Detector.\r\n\r\n<b>AI Paraphrasing Tool</b>\r\nRephrase sentences in 2 free modes and 8 Premium modes to enhance clarity, adjust tone, and more\r\n\r\n<b>AI Grammar Checker</b>\r\nThe free Grammar Checker eliminates mistakes, using AI to ensure suggestions are accurate.\r\n\r\n<b>AI Content Detector</b>\r\nThe AI checker scans your writing and quickly reports which parts of your text may be flagged as AI-generated.\r\n\r\n<b>Translator</b>\r\nInstantly translate text in 40+ languages, including Spanish, French, German, and English.\r\n\r\n\r\n<b>Paraphrasing Tool Modes Include:</b>\r\n\r\n<b>Free</b>\r\nStandard: Rephrase text with new vocabulary and word order\r\nFluency: Improve the clarity and readability of text\r\n\r\n<b>Premium</b>\r\nNatural: Rephrase text in a more human, authentic way\r\nFormal: Rephrase text in a more sophisticated way\r\nAcademic: Express text in a more technical and scholarly way\r\nSimple: Present text in a way that’s easy to understand\r\nCreative: Rephrase text in an original and innovative way\r\nExpand: Increase the length of text\r\nShorten: Convey the meaning of text concisely\r\nCustom mode: Rewrite text to match the unique description provided\r\n\r\n<b>How the Keyboard App Works:</b>\r\n\r\nDownload from the Play Store, create an account, and allow keyboard access to improve your writing everywhere.\r\n\r\n<b>How the AI Writing Assistant Works:</b>\r\n\r\nThe AI writing assistant is a floating widget that works across all your apps, helping you write error-free, paraphrase, translate, and generate text instantly. Best of all: you can keep your preferred keyboard and still get QuillBot support anywhere you write.\r\n\r\n<b>✨QuillBot Premium: Ready to take your writing to the next level?</b>\r\n\r\nPremium unlocks unlimited words, advanced sentence recommendations, 10+ modes, and more. Learn more at quillbot.com/premium.\r\n\r\n\r\n<b>Why Choose QuillBot?</b>\r\n\r\nWe’re the best paraphrase tool, AI checker, language translator, and grammar-checking app on the market.\r\n\r\n✅Comprehensive: Go beyond autocorrect and strengthen the impact of your writing\r\n✅Customizable: Make your sentences stand out with 10+ rewriting modes\r\n✅Flexible: Create unlimited different paraphrasing styles with Custom mode\r\n✅Accurate: Improve your writing with a rephraser trained by expert linguists\r\n✅High quality: Feel confident your rewrites are clear and grammatically correct\r\n✅Multilingual: App, assistant, and keyboard support English, German, French, and Spanish.\r\n✅Detailed: Receive in-depth feedback on your content with AI Detector\r\n✅Fast: Get instant results from our sentence checker, AI Detector, Translator, and Paraphraser\r\n✅Free: Get a grammar check, 2 paraphrasing modes, Translator, and AI Detector at no cost\r\n\r\n<b>App Privacy and Data Safety:</b> The security of your personal data is one of QuillBot’s top priorities. To learn more about our privacy policy, visit quillbot.com/privacy. Read our full Terms and Conditions at https://quillbot.com/terms.\r\n\r\nAccessibility permission is used to process text written in apps and provide you with tailored writing assistance. We also use this permission to turn QuillBot on when you’re typing in apps.\r\n\r\nCommunicate with confidence. Download QuillBot today to paraphrase, fix typos, and write flawlessly anywhere.",
    "rating": 4.079208,
    "rating_text": null,
    "ratings_total": 17216,
    "ratings_histogram": [
      2883,
      658,
      494,
      1180,
      11916
    ],
    "installs": "5,000,000+",
    "genre": "Productivity"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 5,
      "review": "its free perfect and fun you'd miss out if you didn't install this",
      "date": "2025-10-29T20:58:23"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "why is it, the auto correct is still on, while in my settings is already off? place.. thanks",
      "date": "2025-10-02T16:34:35"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Goed",
      "date": "2024-04-17T15:58:32"
    }
  ]
}