{
  "name": "Learn Dutch With Amy for Kids",
  "google_package": "com.squins.tkl.nl",
  "google": {
    "title": "Learn Dutch With Amy for Kids",
    "description": "Learn Dutch with fun games for kids!\r\nChildren playfully learn over 180 new words at their own pace. Parents and caregivers get insight into their educational progress in the results overview.\r\n\r\nTry 3 themes for free!\r\n\r\n<b>How can Learn Dutch With Amy help your kids?</b>\r\n• Learn and play: challenging games (slideshow, concentration game, puzzle, and quiz).\r\n• Learn step by step: words are ordered into clear categories (Farm, Clothing, Colors, Transportation, Numbers, Shapes, Playground, Food & drinks, Zoo, Home, Body, Music, and Sports).\r\n• High-quality graphics designed by professionals.\r\n• Words are spoken by a voice over professional with a friendly female voice.\r\n• Teaches pronunciation and spelling.\r\n• Helps children learn new words they do not know yet (expanding your child's vocabulary).\r\n\r\nListening and reading skills of children are measured by the app, and can be viewed by parents and supervisors. The results can be viewed for a limited time only. An in-app purchase allows you to view the results of the last two weeks, and allows filtering by category and skill.\r\n\r\nLearn Dutch With Amy offers several fun and interactive preschooler games that teach kids in the following areas:\r\n\r\n<b>FARM</b>: match cute animals from ducks to cows and learn how these words look, sound, and how to write and pronounce them correctly before kindergarten.\r\n\r\nWords: tractor, koe, kip, paard, kat, hond, eend, geit, and 5 more!\r\n\r\n<b>CLOTHING</b>: what do we put on today and how do you pronounce that in Dutch?\r\n\r\nWords: muts, laars, want, schoen, broek, jurk, bloes, riem, and 8 more!\r\n\r\n<b>COLORS</b>: your child will learn the most common colors as easy as 123.\r\n\r\nWords: zwart, bruin, rood, donkergroen, grijs, lichtblauw, lichtgroen, oranje, and 5 more!\r\n\r\n<b>TRANSPORTATION</b>: see and learn the different means of transportation on the road, in the water or in the sky!\r\n\r\nWords: auto, trein, vrachtwagen, vliegtuig, fiets, bus, helikopter, motor, and 5 more!\r\n\r\n<b>NUMBERS</b>: learning the basics of the 123s is vital for toddlers and preschool aged kids and will help later with kindergarten math.\r\n\r\nWords: nul, een, twee, drie, vier, vijf, zes, zeven, and 3 more!\r\n\r\n<b>SHAPES</b>: your preschooler will get to know the basic shapes by learning cute and colorful rectangles, circles, triangles, etc.\r\n\r\nWords: pijl, cirkel, hart, ovaal, rechthoek, ring, spiraal, vierkant, and 2 more!\r\n\r\n<b>PLAYGROUND</b>: learn how to pronounce and write the equipment of the playground in Dutch.\r\n\r\nWords: draaimolen, rekstok, klimrek, ringen, zandbak, wip, glijbaan, wipkip, and 4 more!\r\n\r\n<b>FOOD & DRINKS</b>: learn how to pronounce and write the names of different food and drink items from around the world and tell everyone about them!\r\n\r\nWords: appel, banaan, brood, wortel, kaas, ei, vis, vork, and 15 more!\r\n\r\n<b>ZOO</b>: look at the zoo animals and learn how they are written and pronounced in Dutch.\r\n\r\nWords: papegaai, leeuw, aap, zebra, olifant, giraffe, kameel, krokodil, and 8 more!\r\n\r\n<b>HOME</b>: apart from learning the basic shapes of everyday home appliances, your preschooler will hear the names along with their pronunciations.\r\n\r\nWords: stoel, deur, telefoon, plant, douche, trap, tafel, toilet, and 3 more!\r\n\r\nAnd 3 more categories!\r\n\r\nThe following categories are available for free: <b>Food & drinks</b>, <b>Zoo</b>, and <b>Body</b>.\r\n\r\nRemaining categories are available as an in-app purchase.\r\n\r\nNew games and categories regularly become available.\r\n\r\nKindergartens use this game to decrease language delays for newcomers.\r\n\r\nTeachkidslanguages.com is a startup that aims to improve the way young children learn languages.\r\n\r\nDo you have questions or feedback? We love to hear from you! Please contact us at info@teachkidslanguages.com\r\n\r\nVisit us! https://www.teachkidslanguages.com\r\nLike us on Facebook! https://www.facebook.com/TeachKidsLanguages\r\nFollow us! https://twitter.com/TeachKidsLang\r\n\r\nLike us? If yes, please give us a review!",
    "rating": 0,
    "rating_text": null,
    "ratings_total": 0,
    "ratings_histogram": [
      0,
      0,
      0,
      0,
      0
    ],
    "installs": "100,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 4,
      "review": "Wat een fijne en uitgebreide app. Onze dochter speelt er al heel lang op. Zag alleen iets over een update met zintuigen maar die vind ik niet terug in de app.",
      "date": "2024-01-06T08:04:50"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "jammer genoeg maar 3 thema`s gratis",
      "date": "2023-01-31T15:37:26"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Uhe2 w. 1cdp1",
      "date": "2022-10-23T18:07:35"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Niks voor mij",
      "date": "2022-10-13T16:49:42"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Zeer aantrekkelijk en zinvol voor OKAN",
      "date": "2022-08-30T19:34:29"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Super app. Dochter heel tevreden. App in pro aangekocht. Lukte eerst niet, maar heel goed geholpen door de klantendienst. Werkt perfect nu. 😀",
      "date": "2022-01-19T11:47:27"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Nett de betaalde versie gekocht maar kan nogsteeds niks doen",
      "date": "2021-09-22T09:26:25"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Zeer slecht, je download het gratis en als je hem opstart moet je betalen. Als je niet betaald heb je der niks aan.",
      "date": "2021-08-01T12:12:04"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Mijn kindje vindt het geweldig, super leerzaam",
      "date": "2021-05-03T17:10:20"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Te gekke app Alleen jammer dat wanneer je de kleuren moet oefenen er bijvoorbeeld bij paars een aubergine ook groen bij zit. Tip neem per plaatje een kleur",
      "date": "2021-03-19T19:21:50"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Complete app met uren aan speelplezier. Wat het gebruiksgemak behoorlijk bemoeilijkt is dat de zijbalk met de terug-knop niet verdwijnt (Android) en mijn dochtertje daar regelmatig met haar vinger op komt. Hierdoor wordt haar spelletje heel vaak Ongewenst onderbroken. Wellicht kan dat met een update verholpen worden?",
      "date": "2021-02-25T22:54:07"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Uitkijken met de pro versie aanschaffen. Geld is afgeschreven maar heb geen pro versie van de app. Lekker dan.",
      "date": "2021-01-28T10:28:18"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "heel leuk en leerzaam spelletje",
      "date": "2021-01-22T17:03:10"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Duidelijk voor jonge kinderen.",
      "date": "2021-01-06T19:52:50"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Ik vint het niet leuk dat maar 3 spelle gratis zijn",
      "date": "2020-10-21T09:09:07"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Het was heel leuk om met mijn kindje van 1000000 jaar te doen",
      "date": "2020-10-21T09:01:26"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Drama",
      "date": "2020-10-20T21:56:46"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Hele leuke app, ik heb gelijk de pro aangeschaft maar er is niks veranderd in de app. Kan ik hiermee geholpen worden?",
      "date": "2020-08-19T09:42:54"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Goed voor kinderen",
      "date": "2020-08-17T12:08:24"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Het is een fijne app. Er mag wel dat meer tijd zitten tussen het lidwoord en het woord zo dat ze goed het verschil horen en de lidwoorden ook goed leren uitspreken.",
      "date": "2020-06-10T23:57:34"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "mooi",
      "date": "2020-05-10T10:47:45"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Ik heb de volledige versie gekocht en het is afgeschreven, maar de app blijft nog beperkt. Wat kunnen jullie voor mij doen?",
      "date": "2020-04-06T13:14:01"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Erg leuk voor peuters, spelenderwijs en overzichtelijk kennis maken met woordjes",
      "date": "2020-03-23T06:36:14"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Het is inderdaad een top app.. ook er voor betaald voor pro! Maar nu geen pro meer?? Toch ook via deze weg kenbaar maken dat het opgelost is! Dank je wel voor de snelle service!",
      "date": "2020-03-02T17:39:28"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leerzame app voor kinderen. Mijn zoon heeft spelenderwijs veel nieuwe woorden geleerd. Ik raad deze app zeker aan voor de kleintjes. Ook nog eens supersnelle contactmogelijkheid. Dat waardeer ik zeker! Ik had een probleem met betaling, maar ik werd gelijk geholpen. 👏🏻👍🏻",
      "date": "2020-01-19T01:45:23"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "zeer leerzaam",
      "date": "2020-01-07T00:26:07"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "dat is niet leuk👎😠",
      "date": "2019-12-26T10:52:26"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Gedeelte daar gratis is is wel heel klein. Dat voelt vreemd, omdat je na 2 minuten eigenlijk al uitgespeeld bent.",
      "date": "2019-12-25T12:42:39"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Als ik dit all gekocht heb ken ik dan ook met mijn andere mobile installeren.???",
      "date": "2019-10-14T23:42:58"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Mijn kleine vindt het een top app geniet ervan, echter heb ik de pro versie aangeschaft in-app maar deze is niet geüpgrade. Wel €4,49 voor betaald.",
      "date": "2019-09-23T18:47:21"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "niet goed je moet elke keer betaling",
      "date": "2019-08-16T20:47:46"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "per ongeluk verkeerde versie gekocht. Moest Engels leren hebben ipv Nederlands. Is er een mogelijkheid tot refund?",
      "date": "2019-08-04T13:58:17"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "de rest betalen pff",
      "date": "2019-07-20T12:17:19"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "beetje jammer dat hij aangeboden wordt als gratis app, maar je kan maar 1 thema kiezen en voor alle andere thema's moet je 4.99 betalen.",
      "date": "2019-06-01T07:29:28"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "betaalde app. terwijl aangegevn wordt gratis app te zijn.",
      "date": "2019-05-08T13:57:26"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "leuk spel💖👌👍",
      "date": "2019-03-06T19:23:49"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Zeer goede app, eindelijk iets wat goed werkt met goede Nederlandse uitspraak. Heb de betaalde versie ook maar meteen gekocht, is het geld meer dan waard. Onze kleine is er dol op.",
      "date": "2019-02-06T20:05:55"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Heb alleen het gratis thema geprobeerd en ben erg enthousiast over de kwaliteit en de leuke afbeeldingen",
      "date": "2019-02-06T18:16:13"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "kinderen zijn enthousiast,",
      "date": "2019-01-17T21:15:57"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Betalend app niet doen",
      "date": "2018-09-30T16:46:50"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Wat een vreselijk saai iets",
      "date": "2018-09-06T00:02:50"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Super fijne app voor onze zoon. Het heeft een simpele uitleg. Er zouden wel meer groente en fruit soorten bij mogen.",
      "date": "2018-09-05T18:21:56"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuke app, de bediening van het spel is makkelijk voor mijn peuter om zelfstandig ermee te spelen. Ik zie graag meer uitbreiding van de woorden en toevoeging van rekenbegrippen.",
      "date": "2018-03-12T08:53:08"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Goede app om te leren. Prijs is wat hoog. Jammer dat er niet meer content verkrijgbaar is. Bijvoorbeeld letters, familie, huishouden etc.",
      "date": "2018-03-09T19:46:06"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Waarom voor betalen ?",
      "date": "2018-02-13T21:01:41"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuke en leerzame app.",
      "date": "2018-02-01T21:09:48"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Nee niet voldoende",
      "date": "2018-02-01T18:28:52"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Ik vind he t dat je kind nederlands kan leren je hoord wat je moet doen veel plezier!",
      "date": "2017-12-24T09:43:18"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Geweldig!",
      "date": "2017-12-06T19:49:17"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Zoontje van bijna 2,5 is grote fan",
      "date": "2017-12-05T21:11:48"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "jammer dat heel véél spelletjes vergrendeld zijn. maar 3 spelletjes beschikbaar.  voor de rest prima!",
      "date": "2017-11-07T21:39:27"
    },
    {
      "platform": "google",
      "rating": 1,
      "review": "Alles is betaald",
      "date": "2017-10-16T08:06:33"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Bedankt!",
      "date": "2017-10-04T20:12:30"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "Ik kan niet de pro versie kopen. Mijn bank (Abna) staat niet bij.  Maar is wel een goede app.  Wil weten hoe kan ik pro kopen. Alvast bedankt",
      "date": "2017-07-11T15:08:44"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Een speelse manier om mijn zoon te helpen om nieuwe dingen te leren. Eve  een Google Play tegoed kaart kopen en dan zal ik de volledige versie aanschaffen. Zoon (bijna 2j) kiest steeds zelf dit spelletje om te doen!",
      "date": "2017-07-04T10:18:54"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Hele leuke en leerzame app. Alleen jammer dat je niet alles kunt openen (enkel tegen betaling).",
      "date": "2017-04-30T21:57:02"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Jammer dat veel van deze app's allemaal betaald zijn en klein beetje maar gratis is.",
      "date": "2017-02-21T18:00:18"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Top spel Mijn dochter is er verslaafd aan En heeft er ook nieuwe woordjes geleerd",
      "date": "2017-01-29T11:38:55"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "Quasi alles is betalend.",
      "date": "2017-01-23T21:13:35"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leerzaam en toch leuk!",
      "date": "2016-12-11T21:02:16"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Zonde zeg",
      "date": "2016-12-03T09:59:35"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "رائع ممتاز",
      "date": "2016-10-31T22:00:33"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuk en uitgebreid",
      "date": "2016-10-13T21:14:58"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuke app voor peuters om woordjes te leren",
      "date": "2016-10-06T21:41:40"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Duidelijke uitspraak en mooie duidelijke plaatjes",
      "date": "2016-10-02T22:42:37"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuke app om kleine kinderen woordjes te leren. Nog meer geluiden erbij zou het helemaal af maken.",
      "date": "2016-10-01T21:03:11"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leerzaam",
      "date": "2016-09-27T01:09:40"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Hele leuke app, kinderen leren snel hiermee.",
      "date": "2016-09-25T20:59:19"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Heel leuk. Goede uitspraak.",
      "date": "2016-09-13T22:48:15"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Alleen spijtig dat je voor meer ervoor moet bijbetalen inplaats dat je het gewoon erbij geeft ,lokt meer downloads uit",
      "date": "2016-09-01T23:59:54"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Mijn dochter vind het geweldig.. en heeft veel van geleerd",
      "date": "2016-08-28T17:09:44"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Niet zo leuk  om dat je er voor  moet betaalen",
      "date": "2016-08-26T21:39:39"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Mijn kleinzoon die spaanstalig is en op Curacao woont heeft er in mijn vakantie veel van geleerd! Heel erg jammer dat hij er niet mee door kan gaan als ik weer weg ben! Als ik de app op de telefoon van zijn ouders wil installeren, krijgen we de melding dat het in dit land (Curacao dus) niet beschikbaar is. Vandaar dus geen 5 sterren!",
      "date": "2016-08-17T05:48:38"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Onze zoon met een verstandelijke beperking leert hier er veel van. Zijn woordenschat is erg uitgebreid",
      "date": "2016-08-14T15:54:42"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "leuk en leerzaam alleen jammer dat je van al die spelletjes maar 2 kan doen en de rest moet kopen.",
      "date": "2016-07-03T17:30:27"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Onze dochter van 20 mnden vindt het super leuk!",
      "date": "2016-06-01T21:37:52"
    },
    {
      "platform": "google",
      "rating": 2,
      "review": "Verder goed",
      "date": "2016-05-11T20:33:22"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leerzame voor de kleintjes",
      "date": "2016-04-28T18:34:39"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Echt je geld waard! Leuke app met verschillende leerzame speelmogelijkheden. Leuk dat er ook vrij regelmatig een update is!!!",
      "date": "2016-04-23T12:44:52"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Jammer dat er weinig keuze is aan gratis spel max3",
      "date": "2016-04-11T15:18:46"
    },
    {
      "platform": "google",
      "rating": 4,
      "review": "Leuk,maar je kunt alleen maar 2 thema's spelen",
      "date": "2016-04-08T19:40:10"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Kindvriendelijk",
      "date": "2016-03-31T21:27:54"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuk App.",
      "date": "2016-03-20T15:17:00"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Heel goed voor me kinderen",
      "date": "2016-03-10T23:21:02"
    },
    {
      "platform": "google",
      "rating": 5,
      "review": "Leuk en leerzaam voor de allerjongste kinderen. Ziet er ook goed uit! Zeker een aanrader",
      "date": "2016-03-10T22:58:50"
    }
  ]
}