{
  "name": "Learn German Daily with Readle",
  "google_package": "com.hello.german",
  "google": {
    "title": "Learn German Daily with Readle",
    "description": "Learn German 5-min a day with personalized stories and daily news on your level. Readle is a <b>German language learning app</b> made for learners that strive to get past the basics, and create a real learning habit. \r\n\r\nLearn German with topics you love from a large library of 2,000 easy and entertaining 5-min reads. Build your German vocabulary with smart flashcards directly from the stories that were curated by native speakers..\r\n\r\nDownload Readle <b>FREE</b> and start learning German today! 🇩🇪\r\n\r\n★ Easily read and listen to German anytime, anywhere. Just 5 minutes a day and one story each day to <b>learn German</b> even faster. ★\r\n\r\n★ Filter stories by your <b>individual level</b> from A1, A2, B1, B2 to C1 and choose topics you enjoy reading. You'll forget that you learn German along the way! ★\r\n\r\n★ Enhance your vocabulary with smart <b>flashcards</b> using a spaced repetition system. Add German words from your favorite stories and store them in your long-term memory. ★\r\n\r\n★ Over 200 <b>German grammar</b> helpers along the stories will help you understand the complexities of the <b>German language</b> with ease. ★\r\n\r\nLearn German quickly from an A1 beginner to an advanced C1 level. Expand your German vocabulary for TestDaF, Goethe Zertifikat, or daily conversation. Listen to recordings by native German speakers, a perfect way to practice your listening skills.\r\n\r\n【 Customized German Stories 】\r\nExplore exciting stories & news lessons tailored to A1, A2, B1, B2, and C1 levels, helping you grasp vocabulary and grammar in various contexts.\r\n\r\n【 Individual Flashcards 】\r\nCreate personalized flashcard decks from the German stories you read. Readle uses spaced repetition to ensure you never forget.\r\n\r\n【 Instant German Dictionary 】\r\nTap on a word for translation & explanation. No need to open Leo, Duden, or other dictionaries to learn German.\r\n\r\n【 Story Grammar Helper & Key Vocabulary 】\r\nGet detailed explanations of essential grammar and key vocabulary within stories. Practice German grammar in multiple contexts easily.\r\n\r\n【 Quiz to Test Your German Skills 】\r\nEach story includes a quiz to practice grammar, vocabulary, and articles (der, die, das). Retake quizzes to improve reading comprehension and prepare for exams like Goethe, DSH, TestDaF, and Telc.\r\n\r\n【 Story Library & New Stories Daily 】\r\nWith 2,000+ German stories across various categories, start learning now with daily new stories to learn German.\r\n\r\n- Travel\r\n- Culture\r\n- Food\r\n- Latest News (DW News, ZDF, Tagesschau, etc.)\r\n- Transportation\r\n- Entertainment\r\n- Science and Medical\r\n- Technology\r\n- People\r\n- Parties\r\n\r\nA must-have app for learning German for travel, daily life, or exam preparation. Readle is your best companion for mastering German!\r\n\r\nDownload today and start learning German fast and easily with Readle!\r\n\r\nContinue your German journey with Readle:\r\n\r\nFacebook: https://www.facebook.com/ReadleApp\r\nInstagram: https://www.instagram.com/readle.german/",
    "rating": 4.58,
    "rating_text": null,
    "ratings_total": 9967,
    "ratings_histogram": [
      388,
      194,
      388,
      1195,
      7770
    ],
    "installs": "500,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": [
    {
      "platform": "google",
      "rating": 5,
      "review": "Gute App",
      "date": "2023-06-26T00:47:09"
    },
    {
      "platform": "google",
      "rating": 3,
      "review": "Het is een mooie app, maar alleen mogelijk om van Engels naar Duits te leren.",
      "date": "2023-01-04T01:01:00"
    }
  ]
}