{
  "name": "Memorang: Flashcards, Test Pre",
  "google_package": "com.memorang",
  "google": {
    "title": "Memorang: Flashcards, Test Pre",
    "description": "Memorang is an AI-powered learning app for busy students in higher education who need an easier way to ace their courses and exams. Although originally designed by MIT engineers and doctors to make medical school easier, it’s now available for everyone to use for any subject! Here’s how it works:\r\n\r\n1️⃣  Study for free with community flashcards and practice questions, create your own, or ace your exams with professional Study-Packs authored by test-prep experts.\r\n\r\n2️⃣  Create a study schedule by choosing a goal date and how much time you have per day to study. You’ll then get a simple, daily stream of learning tasks to complete. Memorang uses artificial intelligence and spaced repetition to calculate what you need to review next and what you’re at risk of forgetting. There’s no better way to save time and stay on track!\r\n\r\n✏️ CONTENT FEATURES (FREE)\r\n- Create flashcards\r\n- Organize and rearrange content within study folders\r\n- Collaborate with your friends\r\n- Browse community flashcards and folders\r\n\r\n🧠 STUDY FEATURES (FREE)\r\n- Set a short or long-term schedule to generate daily study tasks\r\n- Smart algorithms powered by spaced repetition to adapt to your knowledge mastery\r\n- Track your progress from individual facts to broad topics\r\n- Customize your learning goals\r\n- Flip flashcards\r\n- Quiz yourself on any topic\r\n- Match terms and their facts\r\n- Practice questions with detailed explanations\r\n\r\n📦 STUDY-PACKS (IN-APP PURCHASES)\r\n- USMLE Step 1 Flashcards\r\n- USMLE Step 2 CK Flashcards\r\n- Netter’s Anatomy Flashcards\r\n- MCAT Flashcards\r\n- Family Medicine PreTest\r\n- Surgery PreTest\r\n- OB / GYN PreTest\r\n- Psychiatry PreTest\r\n- Pediatrics PreTest\r\n- Neurology PreTest\r\n- Medicine PreTest\r\n- Dark mode\r\n\r\n⏳ COMING SOON\r\n- Annotations\r\n- Leaderboards\r\n- Offline mode\r\n- Diagram learning mode\r\n- More study packs!\r\n\r\nNote: Each Study-Pack contains restricted, premium content that requires an in-app purchase in order to access it for a limited period of time (e.g. 12 months). When this period expires, you will lose access as Memorang does not support auto-renewal. If you wish to extend your access (e.g. you moved your exam date), you can add time via additional in-app purchases.",
    "rating": 4.142857,
    "rating_text": null,
    "ratings_total": 39,
    "ratings_histogram": [
      5,
      0,
      2,
      5,
      25
    ],
    "installs": "5,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": []
}