{
  "name": "Proofreader AI Grammar Checker",
  "google_package": "prowriting.english.grammar.checker.translator",
  "google": {
    "title": "Proofreader AI Grammar Checker",
    "description": "Proofreader: the AI-powered writing assistant that helps you perfect your text effortlessly.\r\n\r\nSupercharge your writing with our intelligent features: text paraphrasing, grammar checker, style enhancements, contextual synonyms, vocabulary suggestions, translations, definitions, and more. Polish your writing and communicate with confidence.\r\n\r\nTry the Pro Version for Free for 7 Days! \r\nChoose the plan that suits you best and start your free trial today.\r\n\r\nFeatures\r\n• Grammar, Spelling, and Punctuation Checker – Powered by AI with a wide range of rules.\r\n• Detailed Corrections – Understand your mistakes with clear explanations and learn as you go.\r\n• Translator – Translate text between over 100 languages. \r\n• Dictionary – Access definitions with sample phrases to learn new words and their usage.\r\n• Language Preference – Choose your preferred English dialect: American, British, Australian, Canadian, New Zealand, or South African. Spelling, grammar, and punctuation checks adapted to each English dialect.\r\n• Text reader – Listen to the text and learn how to pronounce it correctly.\r\n\r\nPro Features\r\n• Rewrite with AI – Correct and discover new ways to rephrase sentences. Get diverse paraphrasing suggestions to elevate your style and creativity. Additionally, write in any foreign language, translate into English, and receive rephrase recommendations in one tap.\r\n• Advanced Grammar Checks – Receive detailed corrections for sentence structure, determiners, and commas.\r\n• Style Checks – Enhance your text’s professionalism with recommendations beyond grammar. Improve consistency and readability, and remove filler words.\r\n• Vocabulary Enhancement Suggestions – Use engaging words and enrich your writing with alternative words and expressions.\r\n• Contextual Synonyms - Obtain relevant synonym suggestions tailored for each sentence.\r\n\r\nContact Support for any questions or feedback: help@elearninglab.app\r\n\r\nTerms of Service: https://elearninglab.app/terms.html\r\nPrivacy Policy: https://elearninglab.app/privacy.html\r\n\r\nDownload Proofreader for free now and start perfecting your texts. Take your English writing to the next level with one app!",
    "rating": 4.72,
    "rating_text": null,
    "ratings_total": 3572,
    "ratings_histogram": [
      107,
      107,
      0,
      250,
      3107
    ],
    "installs": "500,000+",
    "genre": "Education"
  },
  "apple": null,
  "reviews": []
}